{
    "id": 10,
    "abstract": "ABSTRACT  [0088]     A novel and useful mm-wave frequency generation system is disclosed that takes advantage of injection locking techniques to generate an output oscillator signal with improved phase noise (PN) performance and power efficiency. Low frequency and high frequency DCOs as well as a pulse generator make up the oscillator system. A fundamental low frequency (e.g., 30 GHz) signal and its sufficiently strong higher (e.g., fifth) harmonic (e.g., 150 GHz) are generated simultaneously in a single oscillator system. The second high frequency DCO having normally poor phase noise is injected locked to the first low frequency DCO having good phase noise. Due to injection locking, the high frequency output signal generated by the second DCO exhibits good phase noise since the phase noise of the second DCO tracks that of the first DCO.     28 12463.0011",
    "initialClaims": [
        "1. An oscillator system, comprising: a reference frequency pulse generator operative to generate a reference signal containing a plurality of harmonics; a first oscillator operative to receive said reference signal output by said pulse generator and to generate a first fundamental frequency and one or more harmonic signals therefrom, wherein said first oscillator is injection locked to said pulse generator; and a second oscillator operative to receive one of the harmonic signals output by said first oscillator, and to generate an output signal therefrom, wherein said second oscillator is injection locked to said first oscillator.",
        "2. The oscillator system according to claim 1, wherein said reference signal generated by said pulse generator exhibits relatively good phase noise.",
        "3. The oscillator system according to claim 1, wherein said first oscillator's one or more harmonic signals exhibits relatively good phase noise being injection locked to said pulse generator.",
        "4. The oscillator system according to claim 1, wherein said second oscillator normally exhibits relatively bad phase noise but is operative to generate said output signal having relatively good phase noise being injection locked to said first oscillator.",
        "5. The oscillator system according to claim 1, wherein said second oscillator is operative to generate relatively high output power at said output node.",
        "6. The oscillator system according to claim 1, wherein said second oscillator exhibits a relatively wide locking range.",
        "7. An oscillator system, comprising: a pulse generator having relatively good phase noise operative to generate a reference frequency signal containing a plurality of harmonics; a first oscillator operative to generate a millimeter wave output fundamental signal along with a higher harmonic signal, wherein said first oscillator is injection locked to said reference frequency signal output of said pulse generator; and a second oscillator normally having relatively poor phase noise operative to generate an output oscillator signal at an output node having relatively good phase noise, wherein said second oscillator is injection locked to said first oscillator causing the phase noise of said second oscillator to track that of said first oscillator.",
        "8. The oscillator system according to claim 7, wherein said second oscillator is operative to generate relatively high output power at said output node.",
        "9. The oscillator system according to claim 7, wherein the phase noise of said first oscillator follows that of said pulse generator.",
        "10. The oscillator system according to claim 7, wherein said first oscillator comprises a class F oscillator operative to generate a relatively strong higher harmonic signal.",
        "11. The oscillator system according to claim 7, wherein said second oscillator exhibits a relatively wide locking range.",
        "12. The oscillator system according to claim 7, wherein: the output fundamental signal is approximately 30 GHz; the higher harmonic signal is approximately 150 GHz; and the output oscillator signal is approximately 150 GHz.",
        "13. A method of generating an oscillator signal, comprising: generating a reference frequency signal; first injection locking a first oscillator and to the reference frequency signal thereby generating a millimeter wave first oscillator signal along with a harmonic signal, wherein phase noise of said first oscillator tracks that of said reference frequency signal; second injection locking a second oscillator to the harmonic signal and generating an output oscillator signal therefrom at an output node; and wherein the phase noise of said second oscillator tracks that of said first oscillator.",
        "14. The method according to claim 13, wherein said reference frequency signal having relatively good phase noise and said second oscillator normally having relatively poor phase noise.",
        "15. The method according to claim 13, wherein: the first oscillator signal is approximately 30 GHz; the harmonic signal is approximately 150 GHz; and the output oscillator signal is approximately 150 GHz.",
        "16. The method according to claim 13, further comprising generating the output oscillator signal to have relatively high output power at said output node.",
        "17. The method according to claim 13, further comprising providing said second oscillator with a relatively wide locking range.",
        "18. An oscillator system, comprising: a pulse generator having relatively good phase noise operative to generate a reference frequency signal having a plurality of harmonics; a first oscillator operative to receive the reference frequency signal and to generate a fundamental signal along with a higher harmonic signal therefrom, wherein said first oscillator is injection locked to the reference frequency signal output of said pulse generator; a second oscillator normally operative to generate a first output oscillator signal at an output node, wherein said second oscillator is injection locked to said first oscillator causing the phase noise of said second oscillator to track that of said first oscillator; and a third oscillator operative to generate a second output signal, wherein said third oscillator indirectly injection locked to said reference frequency signal output of said pulse generator causing the phase noise of said third oscillator to track that of said pulse generator.",
        "19. The oscillator system according to claim 18, further comprising a buffer circuit adapted to receive the signal output of said third oscillator and generate a buffered output signal therefrom.",
        "20. The oscillator system according to claim 18, wherein: the first oscillator signal is approximately 30 GHz; the higher harmonic signal is approximately 150 GHz; the first output oscillator signal is approximately 150 GHz; and the second output oscillator signal is approximately 83 GHz."
    ],
    "finalClaims": [
        "1. An oscillator system, comprising: a reference frequency pulse generator operative to generate a reference signal containing a plurality of harmonics; a first oscillator operative to receive said reference signal output by said pulse generator and to resonate at and generate a first fundamental frequency and one or more harmonic signals therefrom, wherein said first oscillator is injection locked to said pulse generator at one of said plurality of harmonics generated by said pulse generator; and a second oscillator operative to receive and resonate at said one of the harmonic signals output by said first oscillator, and to generate an output signal therefrom at a frequency of the one of the harmonic signals output by said first oscillator, wherein said second oscillator is injection locked to said first oscillator at the frequency of the one of the harmonic signals output from said first oscillator.",
        "2. The oscillator system according to claim 1, wherein said reference signal generated by said pulse generator exhibits relatively good phase noise.",
        "3. The oscillator system according to claim 1, wherein said first oscillator's one or more harmonic signals exhibits relatively good phase noise being injection locked to said pulse generator.",
        "4. The oscillator system according to claim 1, wherein said second oscillator normally exhibits relatively bad phase noise but is operative to generate said output signal having relatively good phase noise being injection locked to said first oscillator.",
        "5. The oscillator system according to claim 1, wherein said second oscillator is operative to generate relatively high output power at said output node.",
        "6. The oscillator system according to claim 1, wherein said second oscillator exhibits a relatively wide locking range.",
        "7. An oscillator system, comprising: a pulse generator having relatively good phase noise operative to generate a reference frequency signal containing a plurality of harmonics; a first oscillator operative to receive said reference frequency signal and to resonate at and generate a millimeter wave output fundamental frequency signal along with and a higher harmonic signal, wherein said first oscillator is injection locked to said reference frequency signal output of said pulse generator at one of the plurality of harmonics generated by the pulse generator; and a second oscillator normally having relatively poor phase noise operative to receive the higher harmonic signal, and to generate an output oscillator signal therefrom at a frequency of the higher harmonic signal and at an output node having relatively good phase noise, wherein said second oscillator is injection locked to said first oscillator at the frequency of the higher harmonic signal, wherein causing the phase noise of said second oscillator to track tracks that of said first oscillator.",
        "8. The oscillator system according to claim 7, wherein said second oscillator is operative to generate relatively high output power at said output node.",
        "9. The oscillator system according to claim 7, wherein the phase noise of said first oscillator follows that is relatively clean due to the phase noise of said first oscillator tracking that of said pulse generator.",
        "10. The oscillator system according to claim 7, wherein said first oscillator comprises a class F oscillator operative to generate a relatively strong higher harmonic signal.",
        "11. The oscillator system according to claim 7, wherein said second oscillator exhibits a relatively wide locking range.",
        "12. The oscillator system according to claim 7, wherein the higher harmonic signal generated by said first oscillator comprises a fifth harmonic of the output fundamental frequency signal. the output fundamental signal is approximately 30 GHz; the higher harmonic signal is approximately 150 GHz; and the output oscillator signal is approximately 150 GHz.",
        "13. A method of generating an output oscillator signal, comprising: generating a reference frequency signal containing a plurality of millimeter wave harmonics; first injection locking a first oscillator and to the reference frequency signal one of the plurality of millimeter wave harmonics thereby generating a millimeter wave fundamental first oscillator signal along with and a harmonic signal thereof, said first oscillator operative to resonate at a frequency of said fundamental first oscillator signal wherein phase noise of said first oscillator tracks that of said reference frequency signal; and second injection locking a second oscillator to the harmonic signal output of said first oscillator and generating the output oscillator signal therefrom at an output node, said second oscillator operative to resonate at a frequency of said harmonic output of said first oscillator; and . wherein the phase noise of said second oscillator tracks that of said first oscillator.",
        "14. The method according to claim 13, wherein said reference frequency signal having relatively good phase noise and said second oscillator normally having relatively poor phase noise.",
        "15. The method according to claim 13, wherein the harmonic of the fundamental first oscillator signal generated by said first oscillator comprises a fifth harmonic thereof. the first oscillator signal is approximately 30 GHz; the harmonic signal is approximately 150 GHz; and the output oscillator signal is approximately 150 GHz.",
        "16. The method according to claim 13, further comprising generating the output oscillator signal to have relatively high output power at said output node.",
        "17. The method according to claim 13, further comprising providing said second oscillator with a relatively wide locking range.",
        "18. An oscillator system, comprising: a pulse generator having relatively good phase noise operative to generate a reference frequency signal having a plurality of harmonics; a first oscillator operative to receive the reference frequency signal output by said pulse generator and to resonate at and generate a fundamental signal along with and to also generate a first higher harmonic signal therefrom, wherein said first oscillator is injection locked to the reference frequency signal a first one of the plurality of harmonics output of said pulse generator; a second oscillator normally operative to receive said first higher harmonic signal, to resonate at said first higher harmonic signal, to generate a first output oscillator signal at an output node at a frequency of said first higher harmonic signal, wherein said second oscillator is injection locked to said first oscillator at the frequency of said first higher harmonic signal causing the phase noise of said second oscillator to track that of said first oscillator; and a third oscillator operative to receive said reference signal and to generate a second output signal therefrom at a second higher harmonic frequency, wherein said third oscillator indirectly resonating at and injection locked to said reference frequency signal a second one of the plurality of harmonics output of said pulse generator, causing wherein the phase noise of said third oscillator to track that tracks the relatively good phase noise of said pulse generator.",
        "19. The oscillator system according to claim 18, further comprising a buffer circuit adapted to receive the signal output of said third oscillator and generate a buffered output signal therefrom.",
        "20. The oscillator system according to claim 18, wherein: the first oscillator signal is approximately 30 GHz; the higher harmonic signal is approximately 150 GHz; the first output oscillator signal is approximately 150 GHz; and the second output oscillator signal is approximately 83 GHz. said first higher harmonic of said fundamental signal generated by said first oscillator said second higher harmonic output of said pulse generator comprises a fifth harmonic"
    ],
    "CTNFDocumentIdentifier": "KCCBS7UPRXEAPX0",
    "CTNFBodyText": "\n\n    DETAILED ACTION\nNotice of Pre-AIA  or AIA  Status\nThe present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA .\n\nSpecification\nThe abstract of the disclosure is objected to because para label  “[0088]” should be deleted.  Correction is required.  See MPEP § 608.01(b).\n\nClaim Rejections - 35 USC § 112\nThe following is a quotation of 35 U.S.C. 112(b):\n(b)  CONCLUSION.—The specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the inventor or a joint inventor regards as the invention.\n\n\nThe following is a quotation of 35 U.S.C. 112 (pre-AIA ), second paragraph:\nThe specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the applicant regards as his invention.\n\n\nClaims 9, 18-20 are  rejected under 35 U.S.C. 112(b) or 35 U.S.C. 112 (pre-AIA ), second paragraph, as being indefinite for failing to particularly point out and distinctly claim the subject matter which the inventor or a joint inventor, or for pre-AIA  the applicant regards as the invention.\nIn claim 18, last paragraph:\n“ said third oscillator indirectly injection locked to said reference frequency signal output of said pulse generator…causing the phase noise…to track that of said pulse generator”\nThis is awkwardly written and is not clear how the phase noise can track the reference signal output?/pulse generator?\nClaims 19 and 20(dependent claims) are thus indefinite too.\nThis is the same for claim 9, where the “phase noise of said first oscillator follows that of said pulse generator”?\n\n\nClaim Rejections - 35 USC § 103\nIn the event the determination of the status of the application as subject to AIA  35 U.S.C. 102 and 103 (or as subject to pre-AIA  35 U.S.C. 102 and 103) is incorrect, any correction of the statutory basis for the rejection will not be considered a new ground of rejection if the prior art relied upon, and the rationale supporting the rejection, would be the same under either status.  \nThe following is a quotation of 35 U.S.C. 103 which forms the basis for all obviousness rejections set forth in this Office action:\nA patent for a claimed invention may not be obtained, notwithstanding that the claimed invention is not identically disclosed as set forth in section 102, if the differences between the claimed invention and the prior art are such that the claimed invention as a whole would have been obvious before the effective filing date of the claimed invention to a person having ordinary skill in the art to which the claimed invention pertains. Patentability shall not be negated by the manner in which the invention was made.\n\nThe factual inquiries set forth in Graham v. John Deere Co., 383 U.S. 1, 148 USPQ 459 (1966), that are applied for establishing a background for determining obviousness under 35 U.S.C. 103 are summarized as follows:\n1. Determining the scope and contents of the prior art.\n2. Ascertaining the differences between the prior art and the claims at issue.\n3. Resolving the level of ordinary skill in the pertinent art.\n4. Considering objective evidence present in the application indicating obviousness or nonobviousness.\nThis application currently names joint inventors. In considering patentability of the claims the examiner presumes that the subject matter of the various claims was commonly owned as of the effective filing date of the claimed invention(s) absent any evidence to the contrary.  Applicant is advised of the obligation under 37 CFR 1.56 to point out the inventor and effective filing dates of each claim that was not commonly owned as of the effective filing date of the later invention in order for the examiner to consider the applicability of 35 U.S.C. 102(b)(2)(C) for any potential 35 U.S.C. 102(a)(2) prior art against the later invention.\nClaims 1-17  is/are rejected under 35 U.S.C. 103 as being unpatentable over Bashir et al (2016/0099720) in view of Dubey(US 8,638,175) and Luong et al(US 2011/029854).\n\n(claims 1, 7, 13) The reference to Bashir et al, see figure 7A, shows a reference oscillator input(560) supplying fundamental Fo and harmonics to a DCO(first oscillator) that is injection locked downstream. The first oscillator will provide a first fundamental frequency and harmonics and is locked to incoming reference.\n\n\n    PNG\n    media_image1.png\n    614\n    804\n    media_image1.png\n    Greyscale\n\n\nRegarding claim 2: the reference signal provided in the main reference has a “relatively” good phase noise due to the help of the DPR that allows for fine phase adjust.\nRe claim 3, 14: the 1st oscillator will thus have relatively better  phase noise as it is injection locked to this fine phase adjusted output of the reference pulse.\nThe method steps being inherent.\nThe reference to Bashir et al does not show another oscillator downstream, a 2nd oscillator to receive the output signal of the first oscillator. \n\nThe reference to Dubey is relied on to show the downstream 2nd oscillator, see figure below, where a first oscillator is shown and used to injection lock a downstream oscillator, a second oscillator and allow for a reduction of phase noise on the output from the 2nd oscillator. \n\n\n    PNG\n    media_image2.png\n    544\n    1238\n    media_image2.png\n    Greyscale\n\n\nRe claim 4, 9, : the downstream oscillator(2nd) will have an output signal w/good phase noise as a result of the previous stages, as noted above, including the harmonic locking.\nRe claim 5, 8, 16: The output of the oscillator system will have a ‘relatively high output’ power when a signal is presented, as opposed to when there is no signal.\nRe claim 6,11, 17 : The ring oscillator(see background section of DUBEY) used for the 2nd oscillator allows for a wide tuning range and thus a wider locking range. \nThe references above do  not show MMW application and CLASS F(LC type) and particular frequencies of operation for the first oscillator and the output oscillator harmonics.\nWith regards the MMW band of operation and specific harmonics being used, the examiner notes that ring oscillators have been implemented in MMW wave bands and as shown below an injection locked ring oscillator as shown by Luong et al may be part of the injection locking as noted above in Bashir et al and Dubey, to allow for MMW application and the particular frequencies needed is simply a matter of design consideration, such as 30 GHz(Fo) for the 1st oscillator and 150GHz (3xFo) for the output signal stage.(Re: claims 12 and 15)\n\n    PNG\n    media_image3.png\n    481\n    817\n    media_image3.png\n    Greyscale\n\n\n\nAs noted in para (0009) good phase noise is achieved with such a LC type(pulsed harmonic tuning) ring oscillator which is considered a CLASS F(Re claim 10).\n\nIn light of the above it would have been obvious to one of ordinary skill in the art before the effective filing date of the claimed invention to have recognized that the Bashir et al injection locked oscillator may be connected to downstream oscillators, specifically wide tuning oscillators, such as LC(class F type) stage ring oscillators highlighted by Dubey and Luong et al to allow for a low phase noise and MMW application as noted being a simple matter of design consideration.\n\n\nAllowable Subject Matter\nClaims 18-20  would be allowable if rewritten or amended to overcome the rejection(s) under 35 U.S.C. 112(b) or 35 U.S.C. 112 (pre-AIA ), 2nd paragraph, set forth in this Office action.\n\n",
    "NOABodyText": "CNTA  16/256,231  NOA  71570     Notice of Pre-AIA or AIA Status  15-10-aia AIA 07-03-aia The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA.   EXAMINER'S AMENDMENT    13-02 AIA An examiner’s amendment to the record appears below. Should the changes and/or additions be unacceptable to applicant, an amendment may be filed as provided by 37 CFR 1.312. To ensure consideration of such an amendment, it MUST be submitted no later than the payment of the issue fee.   The application has been amended as follows:  In the abstract:  The para info ”[0088]”  should be deleted.  Please provide a new abstract reflecting this.     Allowable Subject Matter  12-151-07 AIA 07-97 12-51-07 Claim s 1-20 allowed.  13-03 AIA The following is an examiner’s statement of reasons for allowance: The examiner has reviewed the prior art of record, including 8,941,420 and 9,154,145 and with the amendments to the claims, these references do not suggest the pulse generator injecting  first oscillator that generates both a fundamental and higher harmonic and subsequent harmonic injection locking of second oscillator downstream in addition to all else claimed .   Any comments considered necessary by applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled “Comments on Statement of Reasons for Allowance.”  Any inquiry concerning this communication or earlier communications from the examiner should be directed to ARNOLD M KINKEAD whose telephone number is (571)272-1763.  The examiner can normally be reached on M-F 7am-5:30pm(Fri-Flex).  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisor, Robert Pascal can be reached on 571-272-1769 .  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see https://ppair-my.uspto.gov/pair/PrivatePair. Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free). If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.        /ARNOLD M KINKEAD/Primary Examiner, Art Unit 2849      Application/Control Number:  16/256,231\tPage 2    Art Unit:  2849      Application/Control Number:  16/256,231\tPage 3    Art Unit:  2849",
    "applicationNumber": "16256231",
    "patentsCitedByExaminer": [
        {
            "referenceIdentifier": "20160099720",
            "abstract": "A novel and useful digitally controlled injection-locked RF oscillator with an auxiliary loop. The oscillator is injection locked to a time delayed version of its own resonating voltage (or its second harmonic) and its frequency is modulated by manipulating the phase and amplitude of injected current. The oscillator achieves a narrow modulation tuning range and fine step size of an LC tank based digitally controlled oscillator (DCO). The DCO first gets tuned to its center frequency by means of a conventional switched capacitor array. Frequency modulation is then achieved via a novel method of digitally controlling the phase and amplitude of injected current into the LC tank generated from its own resonating voltage. A very linear deviation from the center frequency is achieved with a much lower gain resulting in a very fine resolution DCO step size and high linearity without needing to resort to oversampled noise shaped dithering.",
            "claims": [
                "1. A frequency modulator circuit, comprising:\na frequency oscillator incorporating a tank circuit and operative to generate a resonating waveform;\na delay circuit coupled to said frequency oscillator and operative to generate a delayed version of said resonating waveform;\na feedback loop coupled to said frequency oscillator and said delay circuit, said feedback loop operative to inject said delayed resonating waveform back into said tank circuit; and\nwherein said modulator circuit frequency is determined by a duration said resonating waveform is delayed by said delay circuit.",
                "2. The oscillator circuit according to claim 1, wherein said resonating frequency of said frequency generator is controlled by a tunable element in said tank circuit.",
                "3. The oscillator circuit according to claim 1, wherein said delay circuit comprises two paths with approximate 90 degree phase shift.",
                "4. The oscillator circuit according to claim 1, wherein said delayed resonating waveform comprise current.",
                "5. A method of generating an oscillating signal, comprising:\ngenerating a resonating waveform utilizing an LC tank circuit;\ndelaying said resonating waveform to generate a delayed version of said resonating waveform therefrom;\ninjecting said delayed version of said resonating waveform into said tank circuit to modify the frequency of said resonating waveform; and\nwherein the oscillator signal frequency is determined by the time said resonating waveform is delayed.",
                "6. The method according to claim 5, wherein the frequency of said oscillating signal is controlled by a tunable element in said tank circuit.",
                "7. The method according to claim 5, wherein said delaying comprises generating two signals phase separated by approximately 90 degrees.",
                "8. The method according to claim 5, further comprising converting the resonating waveform to a square wave clock for input to a phase generator.",
                "9. An oscillator circuit, comprising:\na digitally controlled oscillator (DCO) incorporating an LC tank circuit and operative to generate a resonating waveform;\na phase generator for operative to generate a coarse delayed version of said resonating waveform;\na digital phase rotator (DPR) circuit operative to generate a fine delayed version of said resonating waveform by interpolating said coarse delayed version of said resonating waveform;\na feedback loop coupled to said digitally controlled oscillator and said digital phase rotator circuit, said feedback loop operative to inject said fine delayed version of said resonating waveform back into said tank circuit; and\nwherein said oscillator circuit frequency is determined by the duration said resonating waveform is delayed by said phase generator and said digital phase rotator circuit.",
                "10. The oscillator circuit according to claim 9, wherein said resonating frequency of said digitally controlled oscillator is controlled by a tunable element in said tank circuit.",
                "11. The oscillator circuit according to claim 10, wherein said tunable element comprises a tunable capacitor.",
                "12. The oscillator circuit according to claim 9, further comprising a oscillator buffer operative to convert the output of said digitally controlled oscillator to a square wave clock for input to said phase generator.",
                "13. The oscillator circuit according to claim 9, wherein said phase generator is operative to generate first and second output clocks having an approximately quadrature phase relationship.",
                "14. The oscillator circuit according to claim 9, wherein said digital phase rotator circuit is operative to interpolate between first and second output clocks generated by said phase generator so as to generate first and second synchronous current pulses which are summed and injected back into said LC tank circuit for determining the frequency of oscillation of said oscillator circuit.",
                "15. The oscillator circuit according to claim 9, wherein said digital phase rotator circuit comprises first and second interleaved current steering digital to analog converters (DACs) having mutually exclusive selection of current sources.",
                "16. The oscillator circuit according to claim 9, wherein said coarse delayed version of said resonating waveform is doubled in frequency compared to said fine delayed version of said resonating waveform."
            ],
            "title": "Wideband Digitally Controlled Injection-Locked Oscillator"
        },
        {
            "referenceIdentifier": "8638175",
            "abstract": "A circuit including a first oscillator configured to oscillate at a first frequency; a second oscillator configured to oscillate at a second frequency, the second frequency being different from and one of a harmonic or sub-harmonic of the first frequency; and a coupling between the first oscillator and the second oscillator configured to injection lock at least one of the first oscillator and second oscillator to the other of the first oscillator and second oscillator.",
            "claims": [
                "1. A circuit comprising:\nat least one first ring oscillator configured to oscillate at a first frequency;\na second ring oscillator configured to oscillate at a second frequency, the second frequency being different from the first frequency and one of a harmonic or sub-harmonic of the first frequency; and\na coupling between the at least one first ring oscillator and the second ring oscillator configured to injection lock at least one of the at least one first ring oscillator and the second ring oscillator to the other of the at least one first ring oscillator and the second ring oscillator, wherein:\nthe second ring oscillator comprises a plurality of inverters, an inverter from the plurality of inverters comprising at least two transistors; and\na gate of a transistor of the at least two transistors is coupled to an output from the coupling via an injection locking input.",
                "2. The circuit as claimed in claim 1, wherein the coupling comprises at least one of:\na unilateral coupling from the at least one first ring oscillator to the second ring oscillator;\na unilateral coupling from the second ring oscillator to the at least one first ring oscillator; and\na bilateral coupling between the at least one first ring oscillator and the second ring oscillator.",
                "3. The circuit as claimed in claim 1, wherein the coupling comprises at least one of:\na filter;\na direct coupling;\na level shifter;\na diode; and\nan impulse generator.",
                "4. The circuit as claimed in claim 3, wherein the filter comprises at least one of:\na low pass filter configured to couple from a higher frequency ring oscillator to a lower frequency ring oscillator;\na high pass filter configured to couple from a lower frequency ring oscillator to a higher frequency ring oscillator.",
                "5. The circuit as claimed in claim 1, wherein the at least one first ring oscillator comprises at least two oscillators.",
                "6. The circuit as claimed in claim 5, wherein at least two oscillators from the at least two oscillators are homogeneously coupled such as to produce a low noise first frequency.",
                "7. The circuit as claimed in claim 5, wherein:\nat least one oscillator from the at least two oscillators is configured to oscillate at a first frequency;\na second at least one oscillator from the at least two oscillators is configured to oscillate at a third frequency; and\nthe at least one oscillator from the at least two oscillators and the second at least one oscillator from the at least two oscillators are heterogeneously coupled.",
                "8. An integrated circuit comprising a circuit as claimed in claim 1.",
                "9. A mixer comprising a circuit as claimed in claim 1.",
                "10. A phase locked loop (PLL) comprising a circuit as claimed in claim 1.",
                "11. An analog to digital converter (ADC) comprising a circuit as claimed in claim 1.",
                "12. A communications device comprising a circuit as claimed in claim 1.",
                "13. A method comprising:\noscillating at least one first ring oscillator at a first frequency;\noscillating a second ring oscillator at a second frequency, the second frequency being different from the first frequency and one of a harmonic or sub-harmonic of the first frequency; and\ninjection lock coupling between the at least one first ring oscillator and the second ring oscillator to form an injection lock coupling, wherein:\nthe second ring oscillator comprises a plurality of inverters, an inverter from the plurality of inverters comprising at least two transistors; and\nthe method further comprises coupling a gate of a transistor of the at least two transistors to an output from the injection lock coupling via an injection locking input.",
                "14. The method as claimed in claim 13, wherein coupling comprises performing at least one of:\nunilateral coupling from the at least one first ring oscillator to the second ring oscillator;\nunilateral coupling from the second ring oscillator to the at least one first ring oscillator; and\nbilateral coupling between the at least one first ring oscillator and the second ring oscillator.",
                "15. The method as claimed in claim 13, wherein coupling comprises at least one of:\nfiltering at least one output of the at least one first ring oscillator and the second ring oscillator;\ndirect coupling at least one output of the at least one first ring oscillator and the second ring oscillator;\nlevel shifting at least one output of the at least one first ring oscillator and the second ring oscillator;\ndiode coupling at least one output of the at least one first ring oscillator and the second ring oscillator; and\nimpulse generating at least one output of the at least one first ring oscillator and the second ring oscillator.",
                "16. The method as claimed in claim 15, wherein filtering comprises performing at least one of:\nlow pass filtering from a ring oscillator operating at a higher frequency to a ring oscillator operating at a lower frequency;\nhigh pass filtering from the ring oscillator operating at a lower frequency to the ring oscillator operating at a higher frequency.",
                "17. The method as claimed in claim 13, wherein the oscillating the at least one first ring oscillator at a first frequency comprises oscillating at least two oscillators.",
                "18. The method as claimed in claim 17, wherein oscillating the at least two oscillators from the at least one first ring oscillator comprises homogeneously coupling the at least two oscillators such as to produce a low noise first frequency.",
                "19. The method as claimed in claim 17, wherein oscillating at least two oscillators comprises oscillating at least one oscillator from the first ring oscillator of the at least two oscillators at the first frequency; and\noscillating a second at least one oscillator from the first ring oscillator of the at least two oscillators at a third frequency, the third frequency being different and one of a harmonic or sub-harmonic of the first frequency; and\nheterogeneously coupling the at least one oscillator from the first ring oscillator of the at least two oscillators and the second at least one oscillator from the first ring oscillator of the at least two oscillators."
            ],
            "title": "Coupled ring oscillator"
        }
    ],
    "firstInventorToFileIndicator": "Y",
    "applicationStatusCode": 150,
    "applicationTypeCode": "UTL",
    "entityStatusData": {
        "smallEntityStatusIndicator": false,
        "businessEntityStatusCategory": "Small"
    },
    "filingDate": "2019-01-24",
    "class/subclass": "331/2",
    "nationalStageIndicator": false,
    "firstInventorName": "Amirhossein Ansari Bozorg",
    "cpcClassificationBag": [
        "H03L7/24",
        "H03B5/06",
        "H03B5/1212",
        "H03L1/021",
        "H03L7/0991",
        "H03B5/1218",
        "H03B2200/009",
        "H04L27/227",
        "H03B5/1237",
        "H03B5/1228",
        "H03B5/1296",
        "H03B2200/0074",
        "H03B5/1206"
    ],
    "effectiveFilingDate": "2019-01-24",
    "publicationDateBag": [
        "2019-07-25"
    ],
    "publicationSequenceNumberBag": [
        "0229675"
    ],
    "earliestPublicationDate": "2019-07-25",
    "applicationTypeLabelName": "Utility",
    "applicationStatusDate": "2020-11-18",
    "class": "331",
    "applicationTypeCategory": "REGULAR",
    "applicationStatusDescriptionText": "Patented Case",
    "patentNumber": "10862423",
    "grantDate": "2020-12-08",
    "applicantBag": [
        {
            "applicantNameText": "University College Dublin",
            "correspondenceAddressBag": [
                {
                    "cityName": "Dublin",
                    "countryCode": "IE",
                    "nameLineOneText": "University College Dublin",
                    "countryName": "IRELAND",
                    "postalAddressCategory": "postal"
                }
            ]
        }
    ],
    "firstApplicantName": "University College Dublin",
    "customerNumber": 25937,
    "groupArtUnitNumber": "2849",
    "earliestPublicationNumber": "US20190229675A1",
    "inventionTitle": "Multi-Stage Sub-THz Frequency Generator Incorporating Injection Locking",
    "applicationConfirmationNumber": 7860,
    "examinerNameText": "KINKEAD, ARNOLD M",
    "subclass": "2",
    "publicationCategoryBag": [
        "Granted/Issued",
        "Pre-Grant Publications - PGPub"
    ],
    "docketNumber": "12463.0011",
    "title": "Multi-Stage Sub-THz Frequency Generator Incorporating Injection Locking"
}