{
    "id": 1,
    "abstract": "ABSTRACT OF THE DISCLOSURE Systems and methods for improving wireless access point communications are  provided. Some embodiments contemplate filtering operations such that two or more  radios can be used in the 5GHz or 2.4GHz band without interfering with each other.  Some embodiments employ discrete Low Noise Amplifiers (LNA) and Power Amplifiers  (PA) as well as frontend modules. In some examples, filtering may be primarily used on  the receiving side to filter out other signals in 5GHz before they are amplified by an  external LNA or LNAs, e.g., as integrated in a WLAN chipset. Filtering may also be  performed on the transmit side in some embodiments. -  22  -",
    "initialClaims": [
        "1. A computer-implemented method comprising: associating a first communication subchannel with a first bandwidth region; associating a second communication subchannel with a second bandwidth region; transmitting and receiving a first dataset associated with the first communication subchannel in the first bandwidth region; transmitting and receiving a second dataset associated with the second communication subchannel in the second bandwidth region; assessing a load imposed on the first communication subchannel and the second communication subchannel; and reassigning at least a portion of the first communication subchannel based on the assessment of the load, wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region. 2. The computer-implemented method of Claim 1, wherein the first bandwidth region and the second bandwidth region are non-overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region. 3. The computer-implemented method of Claim 1, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified 4. The computer-implemented method of Claim 1, further comprising: applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset. 5. The computer-implemented method of Claim 2, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz. 6. The computer-implemented method of Claim 1, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz. 7. A non-transitory computer-readable medium comprising instructions executable by at least one processor to perform a method comprising: associating a first communication subchannel with a first bandwidth region; associating a second communication subchannel with a second bandwidth region; transmitting and receiving a first dataset associated with the first communication subchannel in the first bandwidth region; transmitting and receiving a second dataset associated with the second communication subchannel in the second bandwidth region; assessing a load imposed on the first communication subchannel and the second communication subchannel; and reassigning at least a portion of the first communication subchannel based on the assessment of the load, wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region. 8. The non-transitory computer-readable medium of Claim 7, wherein the first bandwidth region and the second bandwidth region are non- overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region. 9. The non-transitory computer-readable medium of Claim 7, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified 10. The non-transitory computer-readable medium of Claim 7, further comprising: applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset. 11. The non-transitory computer-readable medium of Claim 10, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz. 12. The non-transitory computer-readable medium of Claim 10, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 58385MHz. 13. The non-transitory computer-readable medium of Claim 7, wherein the non-transitory computer-readable medium is in communication with one of a USB or Firewire peripheral. 14. A system comprising: one or more processors; a memory unit having instructions stored thereon, which when executed by the one or more processors cause the system to: associate a first communication subchannel with a first bandwidth region; associate a second communication subchannel with a second bandwidth region; transmit and receive a first dataset associated with the first communication subchannel in the first bandwidth region; transmit and receive a second dataset associated with the second communication subchannel in the second bandwidth region; assess a load imposed on the first communication subchannel and the second communication subchannel; and reassign at least a portion of the first communication subchannel based on the assessment of the load, wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region. 15. The system of Claim 14, wherein the first bandwidth region and the second bandwidth region are non-overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region. 16. The system of Claim 14, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified. 17. The system of Claim 14, wherein the memory unit has furhter instructions stored thereon, which when executed by the one or more processors cause the system to further: apply a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset. 18. The system of Claim 17, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz. 19. The system of Claim 14, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz.",
        "2. The computer-implemented method of Claim 1, wherein the first bandwidth region and the second bandwidth region are non-overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region.",
        "3. The computer-implemented method of Claim 1, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified",
        "4. The computer-implemented method of Claim 1, further comprising: applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset.",
        "5. The computer-implemented method of Claim 2, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz.",
        "6. The computer-implemented method of Claim 1, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz.",
        "7. A non-transitory computer-readable medium comprising instructions executable by at least one processor to perform a method comprising: associating a first communication subchannel with a first bandwidth region; associating a second communication subchannel with a second bandwidth region; transmitting and receiving a first dataset associated with the first communication subchannel in the first bandwidth region; transmitting and receiving a second dataset associated with the second communication subchannel in the second bandwidth region; assessing a load imposed on the first communication subchannel and the second communication subchannel; and reassigning at least a portion of the first communication subchannel based on the assessment of the load, wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region.",
        "8. The non-transitory computer-readable medium of Claim 7, wherein the first bandwidth region and the second bandwidth region are non- overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region.",
        "9. The non-transitory computer-readable medium of Claim 7, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified",
        "10. The non-transitory computer-readable medium of Claim 7, further comprising: applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset.",
        "11. The non-transitory computer-readable medium of Claim 10, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz.",
        "12. The non-transitory computer-readable medium of Claim 10, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 58385MHz.",
        "13. The non-transitory computer-readable medium of Claim 7, wherein the non-transitory computer-readable medium is in communication with one of a USB or Firewire peripheral.",
        "14. A system comprising: one or more processors; a memory unit having instructions stored thereon, which when executed by the one or more processors cause the system to: associate a first communication subchannel with a first bandwidth region; associate a second communication subchannel with a second bandwidth region; transmit and receive a first dataset associated with the first communication subchannel in the first bandwidth region; transmit and receive a second dataset associated with the second communication subchannel in the second bandwidth region; assess a load imposed on the first communication subchannel and the second communication subchannel; and reassign at least a portion of the first communication subchannel based on the assessment of the load, wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region.",
        "15. The system of Claim 14, wherein the first bandwidth region and the second bandwidth region are non-overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region.",
        "16. The system of Claim 14, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified.",
        "17. The system of Claim 14, wherein the memory unit has furhter instructions stored thereon, which when executed by the one or more processors cause the system to further: apply a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset.",
        "18. The system of Claim 17, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz.",
        "19. The system of Claim 14, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz."
    ],
    "finalClaims": [
        "1. (Cancelled)",
        "2. (Cancelled)",
        "3. The computer-implemented method of Claim 1, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified.",
        "4. The computer-implemented method of Claim 1, further comprising: applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset.",
        "5. The computer-implemented method of Claim 4, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz.",
        "6. The computer-implemented method of Claim 1, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz.",
        "7. A non-transitory computer-readable medium comprising instructions executable by at least one processor to perform a method comprising: associating a first communication subchannel with a first bandwidth region; associating a second communication subchannel with a second bandwidth region; transmitting and receiving a first dataset associated with the first communication subchannel in the first bandwidth region; transmitting and receiving a second dataset associated with the second communication subchannel in the second bandwidth region; assessing a load imposed on the first communication subchannel and the second communication subchannel; and reassigning at least a portion of the first communication subchannel based on the assessment of the load- wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region; and wherein the first bandwidth region and the second bandwidth regions are non- overlappinq subdivisions of the 5GHz bandwidth reqion encompassing one or more center frequencies and separated by a cutoff region.",
        "8. (Cancelled)",
        "9. The non-transitory computer-readable medium of Claim 7, wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified.",
        "10. The non-transitory computer-readable medium of Claim 7, further comprising wherein the instructions are executable by the at least one processor to perform a method further comprising: applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset.",
        "11. The non-transitory computer-readable medium of Claim 10, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz.",
        "12. The non-transitory computer-readable medium of Claim 7, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 58385MHz.",
        "13. The non-transitory computer-readable medium of Claim 7, wherein the non-transitory computer-readable medium is in communication with one of a USB or Firewire peripheral.",
        "14. A system comprising: one or more processors; a memory unit having instructions stored thereon, which when executed by the one or more processors cause the system to: associate a first communication subchannel with a first bandwidth region; associate a second communication subchannel with a second bandwidth region; transmit and receive a first dataset associated with the first communication subchannel in the first bandwidth region; transmit and receive a second dataset associated with the second communication subchannel in the second bandwidth region; assess a load imposed on the first communication subchannel and the second communication subchannel; and reassign at least a portion of the first communication subchannel based on the assessment of the load- wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region; and wherein the first bandwidth reqion and the second bandwidth reqions are non- overlappinq subdivisions of the 5GHz bandwidth reqion encompassing one or more center frequencies and separated by a cutoff reqion.",
        "15. (Cancelled)",
        "16. The system of Claim 14, -wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified.",
        "17. The system of Claim 14, wherein the memory unit has furhter further instructions stored thereon, which when executed by the one or more processors cause the system to further: apply a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset.",
        "18. The system of Claim 17, wherein the BPF is configured to filter the first and second subchannel bands and is configured to reject, at least in part, a band above 5400MHz.",
        "19. The system of Claim 14, wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz."
    ],
    "CTNFDocumentIdentifier": "J2ROP3CURXEAPX0",
    "CTNFBodyText": "The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA .\n\nClaim Rejections - 35 USC § 112\nThe following is a quotation of 35 U.S.C. 112(b):\n(b)  CONCLUSION.—The specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the inventor or a joint inventor regards as the invention.\n\n\nThe following is a quotation of 35 U.S.C. 112 (pre-AIA ), second paragraph:\nThe specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the applicant regards as his invention.\n\n\nClaim 5 is rejected under 35 U.S.C. 112(b) or 35 U.S.C. 112 (pre-AIA ), second paragraph, as being indefinite for failing to particularly point out and distinctly claim the subject matter which the inventor or a joint inventor, or for pre-AIA  the applicant regards as the invention.  Claim 5 recites the limitation the BPF in line 1.  There is insufficient antecedent basis for this limitation in the claim.\n\nClaim Rejections - 35 USC § 101\n35 U.S.C. 101 reads as follows:\nWhoever invents or discovers any new and useful process, machine, manufacture, or composition of matter, or any new and useful improvement thereof, may obtain a patent therefor, subject to the conditions and requirements of this title.\n\nThe claimed invention of claim(s) 1-4, 6-10, 12, 14-17, 19  is directed to non-statutory subject matter because the claim(s) 1-4, 6-10, 12, 14-17, 19 as a whole, considering all claim elements both individually and in combination, do not amount to significantly more than an abstract idea.  \n The claim(s) 1-4, 6-10, 12, 14-17, 19 are directed to the abstract idea of “reassigning at least a portion of the first communication subchannel based on the assessment of the load”(claims 1, 7 & 14){Bascom indicates that Filtering content or determining who gets to see what, is an abstract idea}.  \nThe additional element(s) or combination of elements in the claim(s) 1-4, 6-10, 12, 14-17, 19 other than the abstract idea per se amount(s) to no more than: generic functions {i.e., assessing a load imposed on the first communication subchannel and the second communication subchannel (claims 1, 7 & 14)}, such that all of the claims at issue (which were similar to the representative claim) as being directed to the abstract idea of “collecting and comparing known information”{Classen}; and “collecting and analyzing information”{FairWarning}, that are well understood, routine, and conventional activities previously known to the industry.  \nLikewise, the additional element(s) or combination of elements in the claim(s) 4 other than the abstract idea per se amount(s) to no more than: generic functions {i.e., “applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset”(claim 4)} , such that all of the claims at issue (which were similar to the representative claim) as being directed to the abstract idea of “Filtering content or determining who gets to see what”{Bascom}, that are well understood, routine, and conventional activities previously known to the industry.  \nViewed as a whole, these additional claim element(s) do not provide meaningful limitation(s) to transform the abstract idea into a patent eligible application of the abstract idea such that the claim(s) 1-4, 6-10, 12, 14-17, 19 amounts to significantly  more than the abstract idea itself.  Therefore, the claim(s) 1-4, 6-10, 12, 14-17, 19 are rejected under 35 U.S.C. 101 as being directed to non-statutory subject matter.\n\nClaim Rejections - 35 USC § 102\nThe following is a quotation of the appropriate paragraphs of 35 U.S.C. 102 that form the basis for the rejections under this section made in this Office action:\nA person shall be entitled to a patent unless –\n\n(a)(1) the claimed invention was patented, described in a printed publication, or in public use, on sale or otherwise available to the public before the effective filing date of the claimed invention.\n\n\nClaim(s) 1-12, 14-19 are rejected under 35 U.S.C. 102(a)(1) as being anticipated by Laroia (US 2005/0025220 A1).\n\nRegarding claims 1, 7 & 14. \nLaroia (US 2005/0025220 A1) discloses A computer-implemented method {¶0066} comprising: \nassociating a first communication subchannel {f1-Figs.2-5} with a first bandwidth region { B1-Figs.2-5}; \nassociating a second communication subchannel {f2-Figs.2-5} with a second bandwidth region {B2-Figs.2-5}; \ntransmitting and receiving a first dataset {SS1-Figs.2-5} associated with the first communication subchannel in the first bandwidth region {¶0008}; \ntransmitting and receiving a second dataset {SS2-Figs.2-5} associated with the second communication subchannel in the second bandwidth region {¶0008}; \n assessing a load imposed on the first communication subchannel and the second communication subchannel {¶0031 wherein frequency control module 318 selectively controls generator 320 so that subcarrier frequency fx.sub.1 will remain within the acceptable frequency passband corresponding to the range of fixed filter 1 322. Similarly, frequency control module 318 would selectively program or limit generator 320' to generate subcarrier frequencies fx.sub.M within the passband frequency range of fixed filter M 322'}; and \nreassigning at least a portion of the first communication subchannel based on the assessment of the load {¶0031 wherein frequency control module 318 selectively controls generator 320 so that subcarrier frequency fx.sub.1 will remain within the acceptable frequency passband corresponding to the range of fixed filter 1 322. Similarly, frequency control module 318 would selectively program or limit generator 320' to generate subcarrier frequencies fx.sub.M within the passband frequency range of fixed filter M 322'; see also ¶0034 & a frequency control module 418 of FIG. 4 for controlling the programmable filters (422, 422') and (426, 426') of first and second filter modules (406, 410) in addition to controlling the programmable sinusoidal signal generators for subcarriers (320, 320') of the signal generator module 304, and the programmable power amplification modules (424, 424') of the power amplification module 408}, \nwherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region {¶0065}. \n\nRegarding claims 2, 8 & 15. With the same reasons as set forth in The computer-implemented method of Claim 1, Laroia further disclose wherein the first bandwidth region and the second bandwidth region are non-overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region {¶0009}.\n\t\n\nRegarding claims 3, 9 & 16. With the same reasons as set forth in The computer-implemented method of Claim 1, Laroia further disclose wherein signals received by the WLAN device that are at frequencies in the cutoff region are excluded before being amplified {¶0009}.\n\nRegarding claims 4, 10 & 17. With the same reasons as set forth in The computer-implemented method of Claim 1, Laroia further disclose applying a bandpass filter (BPF) to at least a portion of the first dataset and the second dataset {¶0009}. \n\nRegarding claims 5, 11 & 18. With the same reasons as set forth in The computer-implemented method of Claim 4  =1GHz+10GHz}\n\n Regarding claims 6, 12 & 19. With the same reasons as set forth in The computer-implemented method of Claim 1, Although, Laroia does not explicitly disclose wherein the first subchannel includes a region between 5170 and 5330MHz and the second subchannel includes a region between 5490MHz and 5835MHz, but it would have been common in practice that Laroia could apply the bandpass filter to a selected bandpass signal corresponding to the desirable subcarrier ff0 {¶0036} \n\nClaim Rejections - 35 USC § 103\nThe following is a quotation of 35 U.S.C. 103 which forms the basis for all obviousness rejections set forth in this Office action:\nA patent for a claimed invention may not be obtained, notwithstanding that the claimed invention is not identically disclosed as set forth in section 102, if the differences between the claimed invention and the prior art are such that the claimed invention as a whole would have been obvious before the effective filing date of the claimed invention to a person having ordinary skill in the art to which the claimed invention pertains. Patentability shall not be negated by the manner in which the invention was made.\n\nClaim 13 is rejected under 35 U.S.C. 103 as being unpatentable over unpatentable over Laroia (US 2005/0025220 A1) in view of Zhu (US 2015/0036514 A1).\n\nRegarding claim 13. With the same reasons as set forth in The non-transitory computer-readable medium of Claim 7, Laroia does not explicitly disclose wherein the non-transitory computer-readable medium is in communication with one of a USB or Firewire peripheral.\n\tHowever, in the same field of endeavor, Zhu (US 2015/0036514 A1) discloses wherein the non-transitory computer-readable medium is in communication with one of a USB or Firewire peripheral {¶0178}.  Therefore, it would have been obvious to an  ordinary skilled in the art at the time of the invention was made to apply Zhu's teaching to Laroia's system with the motivation being to transmitting data from one device to another {¶0178} “in coordinate aspects of different connections among different devices in different networks”{¶0165}. \n\n",
    "NOABodyText": "CNTA  15/091,542  NOA  75652  2464    15-10-aia AIA 07-03-aia  The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA.   REASONS FOR ALLOWANCE  13-03 AIA The following is an examiner’s statement of reasons for allowance:   - Claims 1, 3-7, 9-14 & 16-19 are allowable because the applicant’s argument is found persuasive and the prior art fails to teach the italic limitations, which are considered in combination with other limitations, as specified in each independent claim as following:   Independent claim 1 . (Currently amended)  A computer-implemented method comprising:  associating a first communication subchannel with a first bandwidth region;  associating a second communication subchannel with a second bandwidth region;  transmitting and receiving a first dataset associated with the first communication subchannel in the first bandwidth region;  transmitting and receiving a second dataset associated with the second communication subchannel in the second bandwidth region;  assessing a load imposed on the first communication subchannel and the second communication subchannel; and  reassigning at least a portion of the first communication subchannel based on the assessment of the load;  wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region ; and  wherein the first bandwidth region and the second bandwidth regions are non- overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region .   Independent claim 7 . (Currently amended)  A non-transitory computer-readable medium comprising instructions executable by at least one processor to perform a method comprising:  associating a first communication subchannel with a first bandwidth region;  associating a second communication subchannel with a second bandwidth region;  transmitting and receiving a first dataset associated with the first communication subchannel in the first bandwidth region;  transmitting and receiving a second dataset associated with the second communication subchannel in the second bandwidth region;  assessing a load imposed on the first communication subchannel and the second communication subchannel; and  reassigning at least a portion of the first communication subchannel based on the assessment of the load;  wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region ; and  wherein the first bandwidth region and the second bandwidth regions are non- overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region .   Independent claim 14 . (Currently amended)  A system comprising:  one or more processors;  a memory unit having instructions stored thereon, which when executed by the one or more processors cause the system to:  associate a first communication subchannel with a first bandwidth region;  associate a second communication subchannel with a second bandwidth region;  transmit and receive a first dataset associated with the first communication subchannel in the first bandwidth region;  transmit and receive a second dataset associated with the second communication subchannel in the second bandwidth region;  assess a load imposed on the first communication subchannel and the second communication subchannel; and  reassign at least a portion of the first communication subchannel based on the assessment of the load;  4Application No.: 15/091,542Docket No.: 110729-8032.US02 wherein the first bandwidth region and the second bandwidth region are receivable by a WLAN device operating in approximately the 5GHz bandwidth region ; and  wherein the first bandwidth region and the second bandwidth regions are non- overlapping subdivisions of the 5GHz bandwidth region encompassing one or more center frequencies and separated by a cutoff region .   Any comments considered necessary by applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled “Comments on Statement of Reasons for Allowance.”   Any inquiry concerning this communication or earlier communications from the examiner should be directed to PHUONGCHAU BA NGUYEN whose telephone number is (571) 272-3148.  The examiner can normally be reached on Monday-Friday 8:30 a.m.-5:00 p.m..  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisor, RICKY NGO can be reached on 571-272-3139.  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see http://pair-direct.uspto.gov.  Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free).  If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.       /PHUONGCHAU BA NGUYEN/  Primary Examiner, Art Unit 2464      Application/Control Number:  15/091,542  Page 2    Art Unit:  2464          Application/Control Number:  15/091,542  Page 3    Art Unit:  2464          Application/Control Number:  15/091,542  Page 4    Art Unit:  2464          Application/Control Number:  15/091,542  Page 5    Art Unit:  2464          Application/Control Number:  15/091,542  Page 6    Art Unit:  2464",
    "applicationNumber": "15091542",
    "patentsCitedByExaminer": [
        {
            "referenceIdentifier": "20050025220",
            "abstract": "Methods and apparatus for generating and transmitting frequency division multiplexed signals are described. The methods are well suited for use where a device uses a small subset, M, of a larger set of N subcarrier frequencies at any given time. Each transmitted FDM signal is generated by combining a plurality of individual analog subcarrier signals whose frequency may change, e.g., be hopped as a function of time. Each generated analog subcarrier signal is amplified, e.g., power amplified, and filtered prior to being combined with other analog subcarrier signals. Filters are used to compensate for or correct signal distortions and/or reduce interference between subcarriers. Fixed frequency filters are used in an exemplary frequency hopping OFDM system. In another embodiment, the filters are programmable and change, e.g., in terms of center frequency, to match the selected subcarrier frequency as frequency hopping occurs. The bandwidth of the programmable filters may remain constant.",
            "claims": [
                "1. A frequency hopping communications device for transmitting signals on a plurality of M subcarrier signals in parallel, each of said M subcarrier signals corresponding to a different one of M subcarrier signal frequencies, said M subcarrier signal frequencies being a subset of N subcarrier frequencies on which said communications device may transmit signals over time, where M&lt;\nN, said frequency hopping communications device including:\na frequency control circuit for controlling which of the N subcarrier frequencies are used by said device for the transmission of signals;\na plurality of M separate subcarrier signals paths operating in parallel, each of the M subcarrier signal paths including a programmable signal generator coupled to said frequency control circuit, a power amplification circuit and a filter circuit, said programmable signal generator for generating a subcarrier signal having a subcarrier frequency corresponding to said subcarrier signal path to which said signal generator corresponds; and\na combining circuit for combining analog subcarrier signals corresponding to different subcarrier signal paths prior to transmission.",
                "2. The device of claim 1, wherein each of the M signal filter circuits, that each correspond to a different one of said M signal paths, is a fixed filter, at least one of the M fixed filters having a passband bandwidth at least equal to Y times the average frequency spacing between the N frequencies that said device can use as the N subcarrier frequencies, where Y is a positive number greater than 1.",
                "3. The method of claim 2, wherein Y.gtoreq.N divided by M.",
                "4. The method of claim 2, wherein Y is at least as large as N.",
                "5. The method of claim 2, wherein each of said M signal filter circuits are identical fixed filters each having a passband bandwidth covering the full set of N subcarrier signal frequencies which may be used by said device.",
                "6. The method of claim 5, wherein the M subcarrier signals are OFDM subcarrier signals and where the N subcarrier frequencies are evenly spaced frequencies.",
                "7. The device of claim 2, wherein the fixed filter included on each of said M signal paths is positioned in series with said corresponding power amplification circuit either before or after the corresponding power amplification circuit.",
                "8. The device of claim 7, wherein the programmable signal generator included in each subcarrier signal path generates an analog subcarrier signal; and\nwherein said power amplification circuit and said filter circuit included in each subcarrier signal path are analog circuits.",
                "9. The device of claim 1, wherein each of the M signal filter circuits, that each correspond to a different one of said M signal paths, is a programmable filter.",
                "10. The device of claim 9, wherein each of the M programmable filters has a passband corresponding to the subcarrier signal frequency of the subcarrier signal generated by the programmable signal generator circuit included on the same subcarrier signal path as the programmable filter.",
                "11. The device of claim 10, wherein the programmable filters have a passband which has a bandwidth sufficient to pass said subcarrier signal but reject the nearest neighboring one, in frequency, of said N subcarrier signals.",
                "12. The device of claim 9, wherein said device further transmits information using at least one additional preselected subcarrier frequency, the device further comprising:\nan additional subcarrier signal path including an amplifier and fixed filter for amplifying and filtering a subcarrier signal corresponding to said additional preselected subcarrier frequency.",
                "13. The device of claim 12, where said additional subcarrier frequency corresponds to a control channel used to transmit control information.",
                "14. A frequency hopping communication method for use in a communications system wherein a device can transmit information using M subcarrier signals at a time, each of the M subcarrier signals corresponding to a different subcarrier frequency, where M is less than N and where N is the total number of different subcarrier frequencies said device can use over time, the method comprising:\ni) operating M programmable signal generators to generate said M subcarrier signals;\nii) separately processing each of the M subcarrier signals to produce M processed subcarrier signals, the processing of each of said M subcarrier signals including a amplification operation and a filtering operation, said separate processing thus including M separate filtering operations; and\niii) combining the M processed subcarrier signals to generate a frequency division multiplexed transmission signal;\niv) controlling at least one of said M programmable signal generators to change the frequency of the subcarrier signal generated by said at least one programmable signal generator; and\nv) repeating steps (i), (ii), and (iii).",
                "15. The method of claim 14, wherein said M subcarrier signals are analog signals and wherein said filtering operation is an analog filtering operation.",
                "16. The method of claim 14, wherein said M separate filtering operations are performed using M separate fixed filters, at least one of the M fixed filters having a bandwidth at least equal to Y times the average frequency spacing between the N frequencies that said device can use as the N subcarrier frequencies, where Y is a positive number greater than 1.",
                "17. The method of claim 16, wherein Y.gtoreq.N divided by M.",
                "18. The method of claim 16, wherein Y is equal to or greater than N.",
                "19. The method of claim 15, wherein said M separate filtering operations are performed using identical fixed filters each having a bandwidth covering the full set of N subcarrier signal frequencies which may be used by said device.",
                "20. The method of claim 19, wherein the N subcarrier signals are OFDM subcarrier signals.",
                "21. The method of claim 14, wherein said M separate filtering operations are performed using M separate programmable filters, the frequency of each of each of the M programmable filters corresponding to the frequency of the subcarrier signal being filtered.",
                "22. The method of claim 14, further comprising:\nchanging the amount of power amplification performed on one of the M subcarrier signals when the frequency of said subcarrier signal is changed.",
                "23. The method of claim 16, wherein controlling at least one of said M programmable signal generators to change the frequency of the subcarrier signal includes:\noperating said M programmable generators to switch from generating a first set of M subcarrier signals corresponding to a first set of M uniformly spaced subcarrier frequencies to generating a second set of M subcarrier signals corresponding to a second set of M uniformly spaced subcarrier frequencies, a first subcarrier frequency in said first set of M subcarrier frequencies being separated from a first subcarrier frequency in said second set of M subcarrier frequencies by a frequency spacing that is less than Y times the frequency spacing between subcarrier signals in said first and second sets of M subcarrier signals."
            ],
            "title": "Methods for generating and transmitting frequency hopped signals"
        },
        {
            "referenceIdentifier": "20150036514",
            "abstract": "A system, method and device for adjusting communication parameters for networks communicating with a communication device are provided. The method comprises: when the communication device is linked to a first communication network and a second communication network, comparing a strength of received signals from the second network against a threshold; and when the strength of the received signals is less than the threshold, adjusting a network parameter of signals received from the second communication network by the communication device.",
            "claims": [
                "1. A method of adjusting communication parameters for networks communicating with a communication device, the method comprising:\nwhen the communication device is linked to a first communication network and a second communication network, comparing a strength of received signals from the second network against a threshold; and\nwhen the strength of the received signals is less than the threshold, adjusting a network parameter of signals received from the second communication network by the communication device.",
                "2. The method of adjusting communication parameters for networks as claimed in claim 1, wherein when the communication device is linked to the first communication network and the second communication network, the method further comprises:\nwhen the strength of the received signals is greater than the threshold, not adjusting the network parameter of the signals received from the second communication network and not adjusting transmission parameters of signals transmitted to the first communication network.",
                "3. The method of adjusting communication parameters for networks as claimed in claim 1, wherein:\nthe first network is a cellular network; and\nthe second network is a WLAN communication network.",
                "4. The method of adjusting communication parameters for networks as claimed in claim 1, wherein:\nthe first network is a cellular network; and\nthe second network utilizes an industrial, scientific and medical (ISM) communication band.",
                "5. The method of adjusting communication parameters for networks as claimed in claim 1, wherein:\nthe network parameter adjusts times when the received signals are monitored, utilizing a first time slot for processing communications for the first network and a second time slot for monitoring for the received signals, the second time slot not overlapping with the first time slot.",
                "6. The method of adjusting communication parameters for networks as claimed in claim 5, wherein:\nduring the first time slot, the communication device does not monitor for the received signals.",
                "7. The method of adjusting communication parameters for networks as claimed in claim 1, wherein:\nthe threshold comprises a required sensitivity level for signals at a data rate received from the second network at the communication device, a de-sense value of signals received from the second network due to interference of the first network and a factor incorporating operating conditions of the communication device.",
                "8. The method of adjusting communication parameters for networks as claimed in claim 7, wherein:\nthe required sensitivity level for signals incorporates sensitivity data for a class of communication devices.",
                "9. The method of adjusting communication parameters for networks as claimed in claim 7, wherein:\nthe de-sense value indicates a received signal sensitivity level for signals received from the second communication network.",
                "10. The method of adjusting communication parameters for networks as claimed in claim 1, wherein when the communication device is linked to the first communication network and the second communication network, the method further comprises:\nwhen the strength of the received signals is not greater than the threshold, adjusting a network parameter of signals received from the second communication network by the communication device.",
                "11. The method of adjusting communication parameters for networks as claimed in claim 10, wherein:\nthe network parameter adjusts times when the received signals are monitored, utilizing a first time slot for processing communications for the first network and a second time slot for monitoring for the received signals, the second time slot not overlapping with the first time slot.",
                "12. The method of adjusting communication parameters for networks as claimed in claim 11, wherein:\nduring the first time slot, the communication device does not monitor for the received signals.",
                "13. The method of adjusting communication parameters for networks as claimed in claim 10, wherein when the communication device is linked to the first communication network and the second communication network, the method further comprises:\nwhen the strength of the received signals is greater than the threshold, lowering a transmission power of signals sent to the second communication network.",
                "14. The method of adjusting communication parameters for networks as claimed in claim 13, wherein when the communication device is linked to the first communication network and the second communication network, wherein:\nthe transmission power of signals sent to the second communication network is lowered by a factor accounting to specific absorption rate (SAR) limits.",
                "15. A system for adjusting communication parameters for networks communicating with a communication device, the system comprising:\na processor;\na memory module for storing instructions for execution on the processor; and\na monitoring module for providing instructions for execution on the processor to monitor for when the communication device is linked to a first communication network and a second communication network and then compare a strength of received signals from the second network against a threshold; and\nwhen the strength of the received signals is less than the threshold, initiate an adjustment of a network parameter of signals received from the second communication network by the communication device.",
                "16. The system for adjusting communication parameters for networks as claimed in claim 15, wherein when the strength of the received signals is greater than the threshold the monitoring module provides further instructions to the processor to not adjust the network parameter of the signals received from the second communication network and not adjusting transmission parameters of signals transmitted to the first communication network.",
                "17. The system for adjusting communication parameters for networks as claimed in claim 15, wherein:\nthe network parameter adjusts times when the received signals are monitored, utilizing a first time slot for processing communications for the first network and a second time slot for monitoring for the received signals, the second time slot not overlapping with the first time slot.",
                "18. The system for adjusting communication parameters for networks as claimed in claim 17, wherein:\nduring the first time slot, the communication device does not monitor for the received signals.",
                "19. The system for adjusting communication parameters for networks as claimed in claim 15, wherein:\nthe first network is a cellular network; and\nthe second network is a WLAN communication network.",
                "20. The system for adjusting communication parameters for networks as claimed in claim 15, wherein:\nthe threshold comprises a required sensitivity level for signals at a data rate received from the second network at the communication device, a de-sense value of signals received from the second network due to interference of the first network and a factor incorporating operating conditions of the communication device."
            ],
            "title": "SYSTEM AND METHOD FOR MANAGING COMMUNICATIONS FOR TWO NETWORKS IN A COMMUNICATION DEVICE"
        }
    ],
    "firstInventorToFileIndicator": "Y",
    "applicationStatusCode": 150,
    "applicationTypeCode": "UTL",
    "entityStatusData": {
        "smallEntityStatusIndicator": false,
        "businessEntityStatusCategory": "Regular Undiscounted"
    },
    "filingDate": "2016-04-05",
    "class/subclass": "370/338",
    "nationalStageIndicator": false,
    "firstInventorName": "Peiman AMINI",
    "cpcClassificationBag": [
        "H04W88/08",
        "H04B1/0057"
    ],
    "effectiveFilingDate": "2016-04-05",
    "publicationDateBag": [
        "2016-08-04"
    ],
    "publicationSequenceNumberBag": [
        "0227604"
    ],
    "earliestPublicationDate": "2016-08-04",
    "applicationTypeLabelName": "Utility",
    "applicationStatusDate": "2018-01-17",
    "class": "370",
    "applicationTypeCategory": "REGULAR",
    "applicationStatusDescriptionText": "Patented Case",
    "patentNumber": "9888523",
    "grantDate": "2018-02-06",
    "applicantBag": [
        {
            "applicantNameText": "NETGEAR, Inc.",
            "correspondenceAddressBag": [
                {
                    "cityName": "San Jose",
                    "geographicRegionName": "CALIFORNIA",
                    "geographicRegionCode": "CA",
                    "nameLineOneText": "NETGEAR, Inc.",
                    "postalAddressCategory": "postal"
                }
            ]
        }
    ],
    "firstApplicantName": "NETGEAR, Inc.",
    "customerNumber": 22918,
    "groupArtUnitNumber": "2464",
    "earliestPublicationNumber": "US20160227604A1",
    "inventionTitle": "MULTI RADIO WIRELESS LAN NETWORKS",
    "applicationConfirmationNumber": 6036,
    "examinerNameText": "NGUYEN, PHUONGCHAU BA",
    "subclass": "338",
    "publicationCategoryBag": [
        "Granted/Issued",
        "Pre-Grant Publications - PGPub"
    ],
    "docketNumber": "110729-8032.US02",
    "title": "MULTI RADIO WIRELESS LAN NETWORKS"
}