{
    "claims": [
        {
            "claimNumber": 1,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                13,
                                38,
                                46,
                                48,
                                52,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "2A",
                                "2C",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 1, Unruh discloses a computer-implemented authenticated encryption method for converting a plaintext message into a ciphertext message, said method comprising: (A) dividing said plaintext message into at least two working blocks, each said working block having a mathematical relationship to said plaintext message (Unruh: fig. 2A, par. 0038, plaintext block 212 & plaintext block 222; fig. 3; par. 0058, initialization vector and index value; fig. 1; pars. 0012-0013); (B) for each said working block, computing a working block ciphertext as a function of such working block, a deterministic working block initialization vector, and a deterministic working block encryption key (Unruh: fig. 2A, par. 0038; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216); fig. 3; par. 0058, initialization vector and index value; par. 0059-0061; fig. 1; pars. 0012-0013; encryption key, initialization vector (IV)); (C) for each said working block, computing a message authentication tag as a function of a deterministic working block message authentication key (Unruh: fig. 2C; par. 0040, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag which is generated by applying a hash function to each block of ciphertext) and at least one of (a) the working block ciphertext computed for such working block and (b) such working block (Unruh: Unruh: fig. 2C; par. 0040, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag, which is generated by applying a hash function to each block of ciphertext); (D) computing a global message authentication tag as a function of the message authentication tag computed for each said working block and a global message authentication key (Unruh: fig. 2C, 248 (Auth Tag), pars. 0046, 0052, Global message authentication ; fig. 1, par. 0016; The result of operations is Auth. Tag); and (E) wherein said ciphertext message comprises the working block ciphertext computed for each said working block and said global message authentication tag (Unruh: fig. 2C, ciphertext 1, ciphertext 2, … ciphertext N; Unruh: fig. 2C, 248 (Auth Tag), pars. 0046, 0052, Global message authentication; fig. 1, par. 0016; The result of operations is Auth. Tag)."
                }
            ]
        },
        {
            "claimNumber": 2,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                40
                            ],
                            "img": [
                                "1",
                                "2C"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 2, Unruh discloses the method of claim 1. Unruh further discloses wherein said ciphertext message further comprises the message authentication tag computed for each said working block (Unruh: fig. 2C; par. 0040, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag, which is generated by applying a hash function to each block of ciphertext)."
                }
            ]
        },
        {
            "claimNumber": 3,
            "parentClaim": 2,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                13,
                                38,
                                48,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "2A",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 3, Unruh discloses the method of claim 2. Unruh further discloses wherein said dividing said plaintext message into at least two working blocks comprises partitioning said plaintext message into at least two working blocks (Unruh: fig. 2A, par. 0038, plaintext block 212 & plaintext block 222; fig. 3; par. 0058, initialization vector and index value; fig. 1; pars. 0012-0013), and wherein, for each said working block, the indication corresponding to said mathematical relationship of such working block to said plaintext message comprises an indication corresponding to a position of such working block within said plaintext message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 4,
            "parentClaim": 3,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                48,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 4, Unruh discloses the method of claim 3. Unruh further discloses wherein, for each said working block, the deterministic working block initialization vector used to compute the working block ciphertext computed for such working block is a function of a global initialization vector and the indication corresponding to said position of such working block within said plaintext message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 5,
            "parentClaim": 4,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                38
                            ],
                            "img": [
                                "2A"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 5, Unruh discloses the method of claim 4. Unruh further discloses wherein, for each said working block, the deterministic working block encryption key used to compute the working block ciphertext computed for such working block is a single encryption key common to said at least two working blocks (Unruh: fig. 2A, par. 0038; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216))."
                }
            ]
        },
        {
            "claimNumber": 6,
            "parentClaim": 5,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                16,
                                46,
                                48,
                                51,
                                52,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "3",
                                "2C"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 6, Unruh discloses the method of claim 5. Unruh further discloses wherein, for each said working block, the deterministic working block message authentication key used to compute the message authentication tag computed for such working block is said global message authentication key (Unruh: fig. 2C, 248 (Auth Tag), pars. 0046, 0052, Global message authentication ; fig. 1, par. 0016; The result of operations is Auth. Tag (i.e. Global message authentication tag), wherein said computing a global message authentication tag is further a function of the length of each said working block (Unruh: pars. 0046, 0051, 0058; length of authentication data and the length of the ciphertext), and wherein said computing a global message authentication tag is further a function of said global initialization vector (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 7,
            "parentClaim": 6,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                40
                            ],
                            "img": [
                                "1",
                                "2C"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 7, Unruh discloses the method of claim 6. Unruh further discloses wherein, for each said working block, said computing a message authentication tag for such working block comprises computing a function of a deterministic working block message authentication key and such working block (Unruh: fig. 2C; par. 0040, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag which is generated by applying a hash function to each block of ciphertext)."
                }
            ]
        },
        {
            "claimNumber": 8,
            "parentClaim": 6,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                13,
                                38,
                                48,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "2A",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 8, Unruh discloses the method of claim 6. Unruh further discloses wherein, for each said working block, said computing a message authentication tag for such working block comprises computing a function of a deterministic working block message authentication key, the working block ciphertext computed for such working block (Unruh: fig. 2A, par. 0038; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216); fig. 3; par. 0058, initialization vector and index value; par. 0059-0061; fig. 1; pars. 0012-0013; encryption key, initialization vector (IV), and at least one of (a) the deterministic working block initialization vector used to compute the working block ciphertext computed for such working block and (b) the indication corresponding to the position of such working block within said plaintext message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 9,
            "parentClaim": 5,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                13,
                                38,
                                40,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "2A",
                                "2C",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 9, Unruh discloses the method of claim 5. Unruh further discloses wherein, for each said working block, the deterministic working block message authentication key used to compute the message authentication tag for such working block is a function of an initial value and the indication corresponding to the position of such working block within said plaintext message (Unruh: fig. 2A, par. 0038; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216); fig. 3; par. 0058, initialization vector and index value; pars 0059-0061; fig. 1; pars. 0012-0013; encryption key, initialization vector (IV)); wherein, for each said working block, said computing a message authentication tag for such working block comprises computing a function of a deterministic working block message authentication key and the working block ciphertext computed for such working block (Unruh: fig. 2C; par. 0040, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag which is generated by applying a hash function to each block of ciphertext)."
                }
            ]
        },
        {
            "claimNumber": 10,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                54,
                                56,
                                62
                            ],
                            "img": [
                                "1",
                                "2D",
                                "5"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 10, Unruh discloses a computer-implemented method for converting at least two ciphertext working blocks into a plaintext message, said at least two ciphertext working blocks associated with a global message authentication tag, said method comprising: (A) for each said ciphertext working block, computing a plaintext working block as a function of such ciphertext working block, a deterministic working block initialization vector, and a deterministic working block decryption key (Unruh: fig. 2D; Ciphertext 1, Ciphertext 2.., Plaintext 1, Plaintext 2, Seed (1), Seed(2), encryption key.; par. 0054; the ciphertext may be decrypted by reversing the direction of data flow; fig. 5, par. 0062); (B) for each said ciphertext working block, computing a message authentication tag as a function of a deterministic working block message authentication key (Unruh: fig. 2D; pars. 54-56, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag which is generated by applying a hash function to each block of ciphertext and at least one of (a) such ciphertext working block and an indication corresponding to a mathematical relationship of such ciphertext working block to said plaintext message and (b) the plaintext working block computed for such ciphertext working block (Unruh: fig. 2D; pars. 54-56, applying hash function for each block cipher multH (218)); (C) computing a global message authentication tag as a function of the message authentication tag computed for each said working block and a global message authentication key (Unruh: fig. 2D, Auth. Tag (248); pars. 0054-0056; The tag T’); (D) comparing said computed global message authentication tag with said global message authentication tag associated with said at least two ciphertext working blocks (Unruh: par. 0056; The tag T’ generated by the decryption method (i.e. computed global message authentication tag) may be compared to the tag T generated (i.e. Global message authentication tag) by the encryption method); and (D) wherein said plaintext message comprises each plaintext working block computed for each said ciphertext working block (Unruh: fig. 2D, par. 0054)."
                }
            ]
        },
        {
            "claimNumber": 11,
            "parentClaim": 10,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                54,
                                56
                            ],
                            "img": []
                        }
                    ],
                    "reason": "Regarding claim 11, Unruh discloses the method of claim 10. Unruh further discloses wherein each said ciphertext working block is associated with a message authentication tag and wherein said method further comprises, for each said ciphertext working block, comparing the message authentication tag computed for such ciphertext working block with said message authentication tag associated with such ciphertext working block (Unruh: pars. 0054-0056; The tag T’ generated by the decryption method (i.e. computed global message authentication tag) may be compared to the tag T generated (i.e. Global message authentication tag) by the encryption method)."
                }
            ]
        },
        {
            "claimNumber": 12,
            "parentClaim": 11,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                48,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 12, Unruh discloses the method of claim 11. Unruh further discloses wherein said plaintext message comprises the concatenation of each plaintext working block computed for each said ciphertext working block, and wherein, for each said ciphertext working block, the indication corresponding to said mathematical relationship of such ciphertext working block to said plaintext message comprises an indication corresponding to a position of the plaintext working block computed for such ciphertext working block within said plaintext message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 13,
            "parentClaim": 12,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                48,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 13, Unruh discloses the method of claim 12. Unruh further discloses wherein, for each said ciphertext working block, the deterministic working block initialization vector used to compute the plaintext working block for such ciphertext working block is a function of a global initialization vector (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061) and the indication corresponding to said position of the plaintext working block computed for such ciphertext working block within said plaintext message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; par. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 14,
            "parentClaim": 13,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                39
                            ],
                            "img": [
                                "2B"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 14, Unruh discloses the method of claim 13. Unruh further discloses wherein, for each said ciphertext working block, the deterministic working block decryption key used to compute the plaintext working block for such ciphertext working block is a single decryption key common to said at least two ciphertext working blocks (Unruh: fig. 2B, par. 0039; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216)."
                }
            ]
        },
        {
            "claimNumber": 15,
            "parentClaim": 14,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                46,
                                48,
                                51,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 15, Unruh discloses the method of claim 14. Unruh further discloses wherein, for each said ciphertext working block, the deterministic working block message authentication key used to compute the message authentication tag for such ciphertext working block is said global message authentication key, wherein said computing a global message authentication tag is further a function of the length of each plaintext working block computed for each said ciphertext working block (Unruh: pars. 0046, 0051, 0058; length of authentication data and the length of the ciphertext), and wherein said computing a global message authentication tag is further a function of said global initialization vector (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 16,
            "parentClaim": 15,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                54
                            ],
                            "img": [
                                "1",
                                "2D"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 16, Unruh discloses the method of claim 15. Unruh further discloses wherein, for each said ciphertext working block, said computing a message authentication tag comprises computing a function of a deterministic working block message authentication key and the plaintext working block computed for such ciphertext working block (Unruh: fig. 2D; par. 0054, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag which is generated by applying a hash function to each block of ciphertext.)"
                }
            ]
        },
        {
            "claimNumber": 17,
            "parentClaim": 15,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                48,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 17, Unruh discloses the method of claim 15. Unruh further discloses wherein, for each said ciphertext working block, said computing a message authentication tag comprises computing a function of a deterministic working block message authentication key, such ciphertext working block, and at least one of (a) the deterministic working block initialization vector used to compute the plaintext working block for such ciphertext working block and (b) the indication corresponding to the position of the plaintext working block computed for such ciphertext working block within said plaintext message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061)."
                }
            ]
        },
        {
            "claimNumber": 18,
            "parentClaim": 14,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                54,
                                58
                            ],
                            "img": [
                                "2D",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 18, Unruh discloses the method of claim 14. Unruh further discloses wherein, for each said ciphertext working block, the deterministic working block message authentication key used to compute the message authentication tag for such ciphertext working block is a function of an initial value and the indication corresponding to the position of the plaintext working block computed for such ciphertext working block within said plaintext message (Unruh: fig. 3; par. 0058, initialization vector and index value); wherein, for each said ciphertext working block, said computing a message authentication tag for such ciphertext working block comprises computing a function of a deterministic working block message authentication key and such ciphertext working block (Unruh: fig. 2D, par. 0054)."
                }
            ]
        },
        {
            "claimNumber": 19,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                13,
                                38,
                                46,
                                48,
                                52,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "2A",
                                "2C",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 19, Unruh discloses a computer-implemented message authentication method for producing message authentication information, said method comprising: (A) dividing a message into at least two working blocks, each said working block having a mathematical relationship to said message (Unruh: fig. 2A, par. 0038, plaintext block 212 & plaintext block 222; fig. 3; par. 0058, initialization vector and index value; fig. 1; pars. 0012-0013); (B) for each said working block, computing a message authentication tag as a function of such working block (Unruh: fig. 2A, par. 0038; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216); fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061; fig. 1; pars. 0012-0013; encryption key, initialization vector (IV)) and at least one of (a) a global message authentication key and an indication corresponding to said mathematical relationship of such working block to said message and (b) a deterministic working block message authentication key that comprises an indication corresponding to said mathematical relationship of such working block to said message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; par. 0059-0061); (C) computing a global message authentication tag as a function of the message authentication tag computed for each said working block and said global message authentication key (Unruh: fig. 2C, 248 (Auth Tag), pars. 0046, 0052, Global message authentication; fig. 1, par. 0016; The result of operations is Auth. Tag); and (D) wherein said message authentication information comprises said global message authentication tag (Unruh: fig. 2C, 248 (Auth Tag) (i.e. Global message authentication tag), pars. 0046, 0052, Global message authentication; fig. 1, par. 0016; The result of operations is Auth. Tag)."
                }
            ]
        },
        {
            "claimNumber": 20,
            "parentClaim": 19,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                13,
                                38,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "1",
                                "2A",
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 20, Unruh discloses the method of claim 19. Unruh further discloses wherein said message authentication information further comprises the message authentication tag computed for each said working block Unruh: fig. 2A, par. 0038; plaint text 1 (212), Seed(1) & encryption key for the operation 214 is represented by a value Kw, Ciphertext 1 (216); fig. 3; par. 0058, initialization vector and index value; par. 0059-0061; fig. 1; pars. 0012-0013; encryption key, initialization vector (IV), and wherein said dividing said message into at least two working blocks comprises partitioning said message into at least two working blocks (Unruh: fig. 2A, par. 0038, plaintext block 212 & plaintext block 222; fig. 3; par. 0058, initialization vector and index value; fig. 1; pars. 0012-0013)."
                }
            ]
        },
        {
            "claimNumber": 21,
            "parentClaim": 20,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                46,
                                48,
                                51,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 21, Unruh discloses the method of claim 20. Unruh further discloses wherein, for each said working block, the indication corresponding to said mathematical relationship of such working block to said message comprises an indication corresponding to a position of such working block within said message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061), and wherein said computing a global message authentication tag is further a function of the length of each said working block (Unruh: pars. 0046, 0051, 0058; length of authentication data and the length of the ciphertext)."
                }
            ]
        },
        {
            "claimNumber": 22,
            "parentClaim": 20,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                58
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 22, Unruh discloses the method of claim 20. Unruh further discloses wherein, for each said working block, the deterministic working block message authentication key that comprises an indication corresponding to said mathematical relationship of such working block to said message is a function of an initial value and an indication corresponding to a position of such working block within said message (Unruh: fig. 3; par. 0058, initialization vector and index value)."
                }
            ]
        },
        {
            "claimNumber": 23,
            "parentClaim": -1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                12,
                                54,
                                56,
                                62
                            ],
                            "img": [
                                "1",
                                "2D",
                                "5"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 23, Unruh discloses a computer-implemented method for determining the authenticity of at least two working blocks comprising a message, said at least two working blocks associated with a global message authentication tag, said method comprising: (A) for each said working block, computing a message authentication tag as a function of such working block (Unruh: fig. 2D; pars. 54-56, applying hash function for each block cipher multH (218); fig. 1; par. 0012, Authentication tag which is generated by applying a hash function to each block of ciphertext) and at least one of (a) a global message authentication key and an indication corresponding to a mathematical relationship of such working block to said message and (b) a deterministic working block message authentication key that comprises an indication corresponding to said mathematical relationship of such working block to said message (Unruh: par. 0048; I is an index that corresponds to the position of a block in the plaintext record; fig. 5, par. 0062); (B) computing a global message authentication tag as a function of the message authentication tag computed for each said working block and said global message authentication key (Unruh: fig. 2D, Auth. Tag (248); pars. 0054-0056; The tag T’); and (C) comparing said computed global message authentication tag with said global message authentication tag associated with said at least two working blocks (Unruh: par. 0056;The tag T’ generated by the decryption method (i.e. computed global message authentication tag) may be compared to the tag T generated (i.e. Global message authentication tag) by the encryption method)."
                }
            ]
        },
        {
            "claimNumber": 24,
            "parentClaim": 23,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                54,
                                56
                            ],
                            "img": []
                        }
                    ],
                    "reason": "Regarding claim 24, Unruh discloses the method of claim 23. Unruh further discloses wherein each said working block is associated with a message authentication tag and wherein said method further comprises, for each said working block, comparing the message authentication tag computed for such working block with said message authentication tag associated with said working block (Unruh: pars. 0054-0056; The tag T’ generated by the decryption method (i.e. computed global message authentication tag) may be compared to the tag T generated (i.e. Global message authentication tag) by the encryption method), and wherein said message comprises the concatenation of each said working block (Unruh: pars. 0054-0056)."
                }
            ]
        },
        {
            "claimNumber": 25,
            "parentClaim": 24,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                46,
                                47,
                                48,
                                51,
                                58,
                                59,
                                60,
                                61
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 25, Unruh discloses the method of claim 24. Unruh further discloses wherein, for each said working block, the indication corresponding to said mathematical relationship of such working block to said message comprises an indication corresponding to a position of such working block within said message (Unruh: par. 0047; I is an index that corresponds to the position of a block in the plaintext record; fig. 3; par. 0058, initialization vector and index value; pars. 0059-0061), and wherein said computing a global message authentication tag is further a function of the length of each said working block (Unruh: pars. 0046, 0051, 0058; length of authentication data and the length of the ciphertext)."
                }
            ]
        },
        {
            "claimNumber": 26,
            "parentClaim": 24,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [
                                58
                            ],
                            "img": [
                                "3"
                            ]
                        }
                    ],
                    "reason": "Regarding claim 26, Unruh discloses the method of claim 24. Unruh further discloses wherein, for each said working block, the deterministic working block message authentication key that comprises an indication corresponding to said mathematical relationship of such working block to said message is a function of an initial value and an indication corresponding to a position of such working block within said message (Unruh: fig. 3; par. 0058, initialization vector and index value)."
                }
            ]
        },
        {
            "claimNumber": 27,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 103,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [],
                            "img": []
                        },
                        {
                            "patentNum": "US 20050213752",
                            "text": [
                                8,
                                10
                            ],
                            "img": []
                        }
                    ],
                    "reason": "Regarding claim 27, Unruh discloses the method of claim 1. Unruh does not explicitly disclose providing an updated plaintext message that is an update to said plaintext message, identifying at least one updated working block that is affected by said update to said plaintext message. However, in an analogous art, Hawkes discloses a stream cipher encryption and message authentication. In one embodiment, Hawkes discloses applying the keystream to plaintext to generate an encrypted message block having at least a portion of the plaintext converted to ciphertext, and updating the state value as a function of said at least a portion of the plaintext (Hawkes:abstract; pars. 0008, 0010). Therefore, it would have been obvious to one of ordinary skill in the art at the time the invention was made to combine the teachings of Hawkes with the method and system of Unruh wherein providing an updated plaintext message that is an update to said plaintext message to provide users with a means for to ensuring security of communication message effectively (Hawkes: par. 0008)."
                }
            ]
        },
        {
            "claimNumber": 28,
            "parentClaim": 1,
            "isReject": true,
            "reasons": [
                {
                    "sectionCode": 102,
                    "citedPatents": [
                        {
                            "patentNum": "US 20100303229",
                            "text": [],
                            "img": []
                        }
                    ],
                    "reason": "Regarding claim 28, claim 28 is directed to a computer readable memory storing computer executable instructions thereon that when executed by a computer perform the method of claim 1; claim 28 is similar in scope to claim 1, and is therefore rejected under similar rationale."
                }
            ]
        }
    ]
}