{
  "id": 3,
  "abstract": "ABSTRACT  The present invention relates to gas distributors used in wafer carriers. The gas distributors comprise a body having an interior space, a separator configured at the front side of the body in the interior space, and an air inlet connected with the body.  One edge of the separator and the front side of the body together form a passage. The configuration of the passage in the gas distributors enables the gas distributors to evenly distribute gases.  11",
  "initialClaims": [
    "1. A gas distributor used in wafer carriers, comprising: a body having an interior space; and a separator configured in the interior space, wherein one edge of the separator and the front side of the body form a passage, and wherein the separator divides the interior space into: a first room connected with an air inlet, wherein the air inlet and passage are configured at adjacent sides of the body; and a second room connected with at least one air outlet, wherein the at least one air outlet is configured on the rear side of the body.",
    "2. The gas distributor used in wafer carriers as claimed in claim 1, wherein the separator further comprises an extended member, and wherein the extended member extends into the first room.",
    "3. The gas distributor used in wafer carriers as claimed in claim 2, wherein the extended member has a plane facing the front side of the body, and wherein the width of the plane is greater at the end away from the air inlet.",
    "4. The gas distributor used in wafer carriers as claimed in claim 2, wherein the extended member has a plane facing the front side of the body, and wherein the plane comprises a first part and a second part having a width larger than that of the first part.",
    "5. The gas distributor used in wafer carriers as claimed in claim 4, wherein the width of the second part is constant and the width of the second part is greater at the end away from the air inlet."
  ],
  "finalClaims": [
    "1. (Cancelled)",
    "2. (Cancelled)",
    "3. A gas distributor used in wafer carriers, comprising: a body having an interior space, wherein the interior space comprises a front side and a back side; a separator being configured in the interior space, wherein the separator comprises a first edge and a second edge, the first edge is connected with the front side of the interior space and the second edge reaches the back side of the interior space, forming a passage; wherein the separator divides the interior space into: a first room connected with an air inlet, wherein the air inlet is configured in a bottom of the first room; and a second room connected with at least one air outlet, wherein the at least one air outlet is configured on the front side of the interior space; wherein the separator further comprises an extended member which is connected with the second edge of the separator, and the extended member is parallel to the back side of an interior space in the first room; The-gas- distriuter used in wafer cer claimed in caim 1, wherein the extended member has a first end and a second end; wherein the first end is located at the bottom of the first room, and the second end is located on top of the first room; wherein a first width of the extended member between the first end of the extended member and the second edge of the separator is smaller than a second width of the extended member between the second end of the extended member and the second edge of the separator.",
    "4. A gas distributor used in wafer carriers, comprising: a body having an interior space, wherein the interior space comprises a front side and a back side: a separator being configured in the interior space, wherein the separator comprises a first edge and a second edge, the first edge is connected with the front side of the interior space and the second edge reaches the back side of the interior space, forming a passage: wherein the separator divides the interior space into: a first room connected with an air inlet, wherein the air inlet is configured in a bottom of the first room: and a second room connected with at least one air outlet, wherein the at least one air outlet is configured on the front side of the interior space: wherein the separator further comprises an extended member which is connected with the second edge of the separator, and the extended member is parallel to the back side of an interior space in the first room The-gas- digtriuter ued in wafer- c g claimed in elaim 1, wherein the extended member has at least one surface facing the front side of the interior space in the first room, and wherein the at least one surface comprises a first part and a second part having a width larger than that of the first part.",
    "5. The gas distributor used in wafer carriers as claimed in claim 4, wherein the width of the first part is constant and the width of the second part is greater at an end away from the air inlet."
  ],
  "CTNFDocumentIdentifier": "IWGK9PBYRXEAPX1",
  "CTNFBodyText": "DETAILED ACTION\nThe present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA .\nClaim Rejections - 35 USC § 112\nThe following is a quotation of 35 U.S.C. 112(b):\n(b)  CONCLUSION.—The specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the inventor or a joint inventor regards as the invention.\n\n\nThe following is a quotation of 35 U.S.C. 112 (pre-AIA ), second paragraph:\nThe specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the applicant regards as his invention.\n\n\nClaims 1-5 are rejected under 35 U.S.C. 112(b) or 35 U.S.C. 112 (pre-AIA ), second paragraph, as being indefinite for failing to particularly point out and distinctly claim the subject matter which the inventor or a joint inventor, or for pre-AIA  the applicant regards as the invention.\nClaim 1 recites the limitation the front side in line 4.  Because this is the first introduction of this limitation, it should read a front side. There is insufficient antecedent basis for this limitation in the claim.\nThe term adjacent sides in claim 1 is a relative term which renders the claim indefinite.  The term adjacent sides is not defined by the claim, the specification does not provide a standard for ascertaining the requisite degree, and one of ordinary skill in the art would not be reasonably apprised of the scope of the invention.  In order to expedite the prosecution of this application, adjacent sides will be taken to mean, any area right next to the body. \nClaim 1 recites the limitation the rear side in line 9.  Because this is the first introduction of this limitation, it should read a rear side. There is insufficient antecedent basis for this limitation in the claim.\nClaims 3 and 4, recite “a plane”.  A plane can mean a surface, it can also be in relation to an axial location.  It is unclear as to what is meant by the Applicant.  For the purposes of expediting the prosecution of this application, a plane, will be taken to mean a view, e.g. a plane view. \nThe term width in claims 4 and 5 is a relative term which renders the claim indefinite.  The term width is not defined by the claim, the specification does not provide a standard for ascertaining the requisite degree, and one of ordinary skill in the art would not be reasonably apprised of the scope of the invention.  Width can mean the thickness of an element or it can mean the distance between two points.  In order to expedite the prosecution of this application, width will be taken to mean the distance between transition points.\nClaim 3 recites the limitation the end in line 3.  Because this is the first introduction of this limitation, it should read an end. There is insufficient antecedent basis for this limitation in the claim.\nClaim 5 recites the limitation the end in line 3.  Because this is the first introduction of this limitation, it should read an end. There is insufficient antecedent basis for this limitation in the claim.\n Claim Rejections - 35 USC § 102\nThe following is a quotation of the appropriate paragraphs of 35 U.S.C. 102 that form the basis for the rejections under this section made in this Office action:\nA person shall be entitled to a patent unless –\n\n(a)(1) the claimed invention was patented, described in a printed publication, or in public use, on sale or otherwise available to the public before the effective filing date of the claimed invention.\n\nClaims 1-5 are rejected under 35 U.S.C. 102(a)(1) as being anticipated by Suzuki et al. (USPN 6758876 B2), as best understood.\n    PNG    media_image1.png    706    921    media_image1.png    Greyscale\nFigure 1 - Suzuki et al. Annotated Fig. 19\nRegarding Claim 1, Suzuki et al. discloses a gas distributor used in wafer carriers (See Fig. 19), comprising: a body (1) having an interior space (See Fig. 19, where the interior space is the area bounded by the outside of the body) and a separator (4/23, where these two elements work in concert to spread/separate the gas entering the body) configured in the interior space (See Fig. 19, where the interior space is the area bounded by the outside of the body).  Suzuki et al. also discloses, wherein  one edge of the separator (4/23, where these two elements work in concert to spread/separate the gas entering the body) and the front side (See Fig. 19, where the front side is where inlet 21, is located) of the body (1) form a passage (See, Suzuki et al. Annotated Fig. 19).  Suzuki et al. further discloses the separator (4/23, where these two elements work in concert to spread/separate the gas entering the body) divides the interior space into a first room connected with an air inlet (21), wherein the air inlet (21) and passage (Suzuki et al. Annotated Fig. 19) are configured at adjacent sides of the body (1) as seen in Suzuki et al. Annotated Fig. 19, where all elements are located in proximity to the edges of the body.  Suzuki et al. discloses a second room (See, Suzuki et al. Annotated Fig. 19) connected with at least one air outlet (22).  Lastly, Suzuki et al. discloses the at least one air outlet (22) is configured on the rear side of the body (1) as seen in Suzuki et al. Annotated Fig. 19.\nRegarding Claim 2, Suzuki et al. discloses the separator (4/23, where these two elements work in concert to spread/separate the gas entering the body) further comprises an extended member (23), and wherein the extended member (23) extends into the first room (See Suzuki et al. Annotated Fig. 19).\nRegarding Claim 3, Suzuki et al. discloses the extended member (23) has a plane facing the front side (See Suzuki et al. Annotated Fig. 19) of the body (1), and wherein the width of the plane is greater at the end away from the air inlet (21) as seen in Suzuki et al. Annotated Fig. 19, where the 1st Part of the Plane width, plus the 2nd  Part of the Plane Width form the Width of the plane, which gets longer as it moves away from the opening, 21.\nRegarding Claim 4, Suzuki et al. discloses the extended member (23) has a plane facing the front side (See Suzuki et al. Annotated Fig. 19) of the body (1), and wherein the plane comprises a first part and a second part having a width larger than that of the first part (See Suzuki et al. Annotated Fig. 19).\nRegarding Claim 5, Suzuki et al. discloses the width of the second part is constant and the width of the second part is greater at the end away from the air inlet (21) as seen in Suzuki et al. Annotated Fig. 19.\nConclusion\nThe prior art made of record and not relied upon is considered pertinent to applicant's disclosure. Burns et al. (US PGPub 20120297981 A1) teaches a gas distributor with an angled inlet.\n",
  "NOABodyText": "CNTA  14/735,126  NOA  88482  3753    DETAILED ACTION  15-10-aia AIA 07-03-aia The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA.  Allowable Subject Matter  12-151-07 AIA 07-97 12-51-07 Claim s 3-5 are allowed.  Applicant has incorporated claim 1 into previously allowable claim 3 and has made claim 3 an independent claim.  Applicant has also made claim 4 an independent claim and has included limitations from claim 1 and previously allowable claim 3.  Conclusion  Any inquiry concerning this communication or earlier communications from the examiner should be directed to Angelisa Hicks, whose telephone number is 571-272-9552.  The examiner can normally be reached on Monday-Friday (8:30AM-5:00PM EST).  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisors can be reached by phone. John Fristoe can be reached at 571-272-4926, Craig Schneider can be reached at 571-272-3607 or Mary McMammon can be reached at 571-272-6007.  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see http://pair-direct.uspto.gov. Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free). If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.   /Angelisa L. Hicks/  Examiner, Art Unit 3753   /CRAIG SCHNEIDER/  Supervisory Patent Examiner, Art Unit 3753         Application/Control Number:  14/735,126  Page 2    Art Unit:  3753          Application/Control Number:  14/735,126  Page 3    Art Unit:  3753",
  "applicationNumber": "14735126",
  "patentsCitedByExaminer": [
    {
      "referenceIdentifier": "20120297981",
      "abstract": "An improved system and method for purging a microenvironment to desired levels of relative humidity, oxygen, or particulates through the implementation of a purge gas delivery apparatus and method that provides even distribution of the purging gas within the microenvironment. A substrate container has a tower therein with a fluid flow passageway extending the length of the tower. Apertures with porous media between the aperture and fluid flow passageway regulate the volume and pressure of air discharging at each aperture. Alternatively, the tower may be formed of a porous tubular polymeric material. A sleeve may direct the discharge purge gas in the interior.",
      "claims": [
        "1. A system for transporting substrates comprising:\na substrate container having a container portion with an opening for loading/unloading substrates, a door adapted to sealably cover the opening;\na substrate carrying section disposed in the transport container;\nan apparatus comprising an inlet tower adapted to be mounted to substrate container portion for admitting a gaseous working fluid to the interior of the container for purging the substrate container body with the gaseous working fluid;\nthe inlet tower having a length and comprising a non porous polymer sleeve extending the length of the tower, one or more outlet regions arranged along the length of the tower, and an interior flow passageway extending the length of the tower, filter media positioned at each outlet region intermediate the one or more outlet regions and the interior flow passageway whereby the gaseous working fluid being admitted to the substrate container may be filtered as it passes through said filter media.",
        "2. The apparatus if claim 1, wherein the one or more outlet regions of said inlet tower comprises a plurality of orifices and the filter material comprises a strip of porous material that covers the orifices, the strip of porous material extending in the interior of the tower.",
        "3. The apparatus of claim 1, wherein said inlet tower comprises a porous polymeric material that blocks water from the interior of the tower.",
        "4. A system for transporting substrates comprising:\na substrate transport container having a container body with an opening and a wafer loading/unloading door adapted to sealably cover the opening;\nan apparatus for admitting a gaseous working fluid to the interior of the container comprising an inlet tower formed of porous barrier material surrounded by a non porous polymer sleeve and a filter in the tower formed of porous barrier material.",
        "5. The apparatus of claim 4, wherein said sleeve of the inlet tower has in cross section, a \"C\" shape.",
        "6. A system for transporting substrates comprising:\na substrate transport container having a container body with an opening and a wafer loading/unloading door adapted to sealably cover the opening; and\nan apparatus for admitting a gaseous working fluid to the interior of the container comprising an inlet tower and a bladder portion made from the porous filter material, the bladder portion extending a length of the inlet tower.",
        "7. The apparatus of claim 6, wherein said bladder has one side that is thinner than an opposite side.",
        "8. The apparatus of claim 6, wherein said bladder has a length and is open on one side of said elongate bladder, said opening extending at least substantially the length of the elongate bladder.",
        "9. A method of maintaining the environment within the wafer transport container to avoid damage to the substrates, the method comprising steps of:\nplacing a porous barrier material in the purge tower apparatus covering the orifices.",
        "10. The method of claim 9 wherein, the porous barrier material is in the form of a bladder.",
        "11. The method of claim 9 wherein, the porous barrier material is in the form of a bladder with the back side missing.",
        "12. The method of claim 9 wherein, the porous barrier material is in the form of the purge tower.",
        "13. The method of claim 9 wherein, the porous barrier is a strip of porous material.",
        "14. The method of claim 9 wherein, the porous material comprising one of sintered material, fibrous material, or foamed material.",
        "15. A method of providing equalized purging flow of a gaseous material along the length of a purge tower in a substrate container, the method comprising providing a purge tower with an interior connected to a purge gas source exterior of the container, the purge tower having a plurality of apertures, and providing porous material adjacent the apertures while leaving open a gaseous flow path the length of the tower that is not blocked by porous material.",
        "16. A method of providing equalized purging flow of a gaseous fluid along the length of a purge tower in a substrate container, the method comprising providing a purge tower of a tubing portion and formed of a porous polymer, the tubing portion closed at a top end and connected at the bottom end to a purge port;\nconnecting the purge port to a purge gas source exterior of the container, providing a pressurization of the purge tower such that flow velocities and volumes near the top of the tower are equal or substantially equal to such flow velocities and volumes near the bottom of the tower.",
        "17. The method of claim 16 wherein the method further provides adjusting the direction of the purge flow utilizing an elongate sleeve with a lengthwise slot, the sleeve conforming to and fitted to the tubing portion.",
        "18. A substrate container comprising:\na substrate container having a container portion with an opening for loading/unloading substrates, a door adapted to sealably cover the opening;\nthe substrate container having a substrate carrying region in the transport container and further comprising an inlet tower mounted to container portion in the interior of the for admitting a gaseous working fluid to the interior of the container for purging the wafer container body with the gaseous working fluid;\nthe inlet tower having a length and one or more outlet regions arranged along the length of the tower, and an interior flow passageway extending the length of the tower, the tower comprising a filter media formed as a tubular structure extending the length of the tower, the tubular structure having an axial fluid flow passageway connecting to a purge port at the bottom of the container portion for allowing purge gas to flow up the tubular structure and to exit the tubular structure along the entire length of the tubular structure, the filter media defining the axial flow passage."
      ],
      "title": "POROUS BARRIER FOR EVENLY DISTRIBUTED PURGE GAS IN A MICROENVIRONMENT"
    },
    {
      "referenceIdentifier": "6758876",
      "abstract": "A method of using a substrate transport pod is provided, which is suitable for manufacturing semiconductor devices with copper wiring and low dielectric insulating film having dielectric constants of less than 3. The method is based on loading the substrates into a pod from an atmosphere of a first process, and circulating a gaseous atmosphere through interior of the pod in such a way to selectively remove at least one contaminant including moisture, particulate substances or chemical substances, and to expose the substrates to a controlled atmosphere intermittently or continually while the substrates are held in the pod before they are unloaded from the pod and introduced into a second process. For a pod that is used to house the substrates for the purpose of retaining or transporting, the pod has a pod main body and a door that provides a hermetic sealing seal, and the pod is made primarily of a materiel that has moisture absorption factor of less than 0.1%, a the pod can contact the substrates directly or indirectly and has a conductive area so as to enable static charges to be guided out of the pod.",
      "claims": [
        "1. A method for transporting substrates between a plurality of processes, comprising:\nloading the substrates into a pod from an atmosphere of a first process;\ncontacting the substrates to the pod directly or indirectly, the pod having a conductive part so as to enable static charges to be drained from the pod;\nremoving at least one contaminant of moisture, particulate substances and chemical substances intermittently or continually so as to expose the substrates to a controlled atmosphere while the substrates are retained in the pod; and\nunloading the substrates from the pod for introduction to a second process.",
        "2. A method according to claim 1, wherein an atmosphere in the first process is different than an atmosphere in the second process.",
        "3. The method of claim 1, and further comprising circulating a gas in the pod having less than 10 particles per cubic meter of a size larger than 0.1 .mu.m.",
        "4. A method according to claim 1, wherein a gas in the pod is circulated and/or controlled in any selective pattern or atmosphere.",
        "5. The method of claim 1, wherein the controlled atmosphere of the pod is a gaseous atmosphere forming an interior environment of the nod that is controlled by operating at least one of a circulations apparatus and a dehumidifying apparatus.",
        "6. The method of claim 1, wherein the controlled atmosphere of the pod forms an interior environment that is controlled based on information of the atmosphere of the first process.",
        "7. The method of claim 1, and further comprising selecting the pod to be used in said loading that has the most suitable function from a plurality of pods having different functions based on information of the atmosphere of the first process.",
        "8. A substrate transport apparatus comprising a substrate transport pod for holding substrates therein, said substrate transport pod comprising:\nat least one filter for purifying gas selected from a filter for removing particulate substances, a filter for removing chemical substances and a dehumidifying apparatus for removing moisture;\na circulation apparatus for circulating purified gas;\na holding apparatus for holding the substrates in contact with said pod, either directly or indirectly, said holding apparatus having a conductive part so as to enable static charges to be drained from said pod.",
        "9. The apparatus of claim 8, wherein said pod is provided with a gas sensor for detecting a processing gas.",
        "10. The apparatus of claim 9, wherein said circulation apparatus is arranged to be controlled according to information provided by said gas sensor.",
        "11. A substrate transport pod for containing, storing or transporting substrates, comprising:\na pod main body and a door for hermetic sealing of the pod main body, which is formed primarily of a material having moisture absorption coefficient of not more than 0.1%, wherein the pod main body is in contact with the substrates directly or indirectly and has a conductive part so as to enable static charges to be drained from the pod main body.",
        "12. A substrate transport pod according to claim 11, wherein a flow guiding structure is provided in interior of the pod main body for guiding a flow of a gas to the substrates.",
        "13. A substrate transport pod according to claim 11, wherein a sensor is provided for detecting whether the door is opened or closed.",
        "14. A substrate transport pod according to claim 11, wherein a sensor is provided for detecting presence of the substrates.",
        "15. A substrate transport pod according to claim 13, wherein a gas circulation means for circulating a gas through the pod is provided, and operated when the door is in the closed state.",
        "16. A substrate transport pod according to claim 14, wherein a gas circulation means is provided, and operated only when it is detected that the door is closed and the pod contains the substrates.",
        "17. A substrate transport pod according to claim 11, wherein the pod is provided with a gas circulation means in its interior space for circulating an internal gas.",
        "18. A substrate transport pod according to claim 11, wherein the pod is provided with a humidifying means in its interior space for removing moisture from an internal gas.",
        "19. A substrate transport pod according to claim 11, wherein the pod is provided with powering means for supplying electrical power.",
        "20. A substrate transport pod according to claim 19, wherein the powering means comprises secondary batteries installed on the pod.",
        "21. A substrate transport pod according to claim 20, wherein a powering means is further provided for charging the secondary batteries.",
        "22. A substrate transport pod according to claim 19, wherein the powering means is constructed to be non-contacting and is operated electromagnetically.",
        "23. A substrate transport pod according to claim 19, wherein the powering means is constructed to be contacting through point contacts.",
        "24. A substrate transport pod according to claim 19, wherein the powering means is provided at least on a load port of a manufacturing apparatus, in a storage facility or on a transport apparatus.",
        "25. A substrate transport pod according to claim 19, wherein powering is started as the pod is seated in the powering means.",
        "26. A substrate transport pod according to claim 11, wherein the pod is provided with a circulation apparatus for circulating a gas inside the pod and at least one of a particle filter, a chemical filter and a dehumidifying apparatus.",
        "27. A substrate transport pod according to claim 26, wherein a filter and a gas circulation means are formed as a unit in a form of a rod.",
        "28. A substrate transport pod according to claim 26, wherein a filter is cylinder shaped and the gas flows in a radial direction of the cylindrical filter.",
        "29. A substrate transport pod according to claim 26, wherein a filter is rod shaped and the gas flows in a longitudinal direction of the rod filter.",
        "30. A substrate transport pod according to claim 26, wherein a ducting and/or a flow control apparatus is provided for guiding the gas.",
        "31. A substrate transport pod according to claim 11, wherein the pod has a gas intake opening and a gas discharge opening for the gas circulated inside the pod.",
        "32. A substrate transport pod according to claim 31, wherein a reverse flow prevention mechanism is provided at least on the gas intake opening or the gas discharge opening.",
        "33. A substrate transport pod according to claim 31, wherein a ducting and/or a flow control apparatus is provided to connect to the gas intake opening.",
        "34. A substrate transport pod according to claim 31, wherein a chemical filter, and a particle filter and/or a dehumidifying apparatus is provided in the vicinity of the gas intake opening and/or a gas discharge opening.",
        "35. A substrate transport pod according to claim 11, wherein the pod is oriented so that a center of gravity in a horizontal direction lies within at least 90% or preferably 70% of a radius of substrates.",
        "36. A substrate transport pod according to claim 11, wherein the pod is provided with an internal environment matching a processing atmosphere for substrates contained in the pod, and is used to transport the substrates between a plurality of processes.",
        "37. A substrate transport apparatus comprising:\na substrate transport pod that can be sealed hermetically for holding substrates therein, said substrate transport pod comprising:\nat least one of a particle filter, a chemical filter, and a dehumidifying apparatus for removing, respectively, particulate substances, chemical substances, and moisture from a gas circulated inside the pod;\na gas circulation apparatus for circulating a purified gas;\na holding apparatus for holding the substrates so as to keep the state of the substrates by exposing the substrates to the purified gas; and\nan identifier for distinguishing individual pods, whose historical data is managed by a computing apparatus.",
        "38. A substrate transport pod according to claim 37, wherein the pod is provided with a data storing apparatus.",
        "39. A substrate transport pod according to claim 37, wherein the pod has a means for receiving external signals, and controls internal environment in the pod according to the external signals.",
        "40. A substrate transport pod according to claim 37, wherein an internal environment is controlled by sending and receiving information between the pod and a processing apparatus.",
        "41. A substrate transport pod according to claim 37, wherein the pod is provided with processing history management information on substrates, and processing of the substrates is managed by transferring the processing history management information from one pod to other pod.",
        "42. A substrate transport pod according to claim 41, wherein the processing history management is carried out by way of a host computer network.",
        "43. A substrate transport pod according to claim 41, wherein a processing history is transferred from one pod to other pod by a controller provided on a processing apparatus.",
        "44. A substrate transport pod according to claim 37, wherein a washing interval for a pod is managed by information stored in memory means of the pod.",
        "45. A substrate transport pod according to claim 37, wherein a filter change interval of a pod is computed from a product of a processed gas volume and a duration of pod operation.",
        "46. A substrate transport pod according to claim 37, wherein a washing interval is estimated from a duration of pod operation.",
        "47. A substrate transport pod according to claim 37, wherein residual power of secondary batteries provided for a pod is measured, and charging is carried out to a necessary level of power.",
        "48. A substrate transport pod according to claim 37, wherein management of information on individual pods is carried out by sending and receiving information for individual pods by wire or radio transmission through a network.",
        "49. A substrate transport pod according to claim 37, wherein processing history management information for a lot is transferred from a pod used in a preceding step to a pod to be used in a succeeding step.",
        "50. A substrate transport pod according to claim 37, wherein information on a pod to be washed is sent to a pod washing machine so that the pod can be selected and subjected to washing.",
        "51. The method of claim 1, wherein the substrates have surfaces that are resist-coated and the controlled atmosphere has an ammonia level controlled below a given level.",
        "52. The method of claim 51, wherein the ammonia level is controlled by adsorbing ammonia gas with a chemical filter.",
        "53. The apparatus of claim 8, and further comprising a dehumidifying apparatus provided for the pod so that a humidity level interior of the pod is controlled by removing moisture.",
        "54. The method of claim 1, wherein the pod is provided with a contaminant removal means and target components are selectively chosen for removing particulate contaminants, metallic contaminants, ionic contaminants, organic contaminants and moisture, and the pod is used for return transport for each process.",
        "55. A method for manufacturing a semiconductor device by transporting substrates between a plurality of processes, comprising:\nloading the substrates into a pod from an atmosphere of a first process;\ncontacting the substrates to the pod directly or indirectly the pod having a conductive part so as to enable static charges to be drained from the pod;\ncirculating a gaseous atmosphere through the interior of the pod to remove at least one contaminant of moisture, particulate substances and chemical substances so as to expose the substrates to a controlled atmosphere intermittently or continually while the substrates are retained in the pod; and\nunloading the substrates from the god and introducing the substrates into a second process.",
        "56. The method of claim 1, wherein the pod is used in a wiring process in which copper wiring and low dielectric films are formed on the substrates.",
        "57. The apparatus of claim 8, wherein the pod further comprises a moisture aversion part including at least one of a filter, a dehumidifying apparatus and a circulation apparatus, that is detachable for washing.",
        "58. The apparatus of claim 57, wherein a plate can be attached to the pod, whereby the pod can be washed by a pod washing machine when the moisture aversion part is detached and the plate is attached."
      ],
      "title": "Substrate transport apparatus, pod and method"
    }
  ],
  "firstInventorToFileIndicator": "Y",
  "applicationStatusCode": 150,
  "applicationTypeCode": "UTL",
  "entityStatusData": {
    "smallEntityStatusIndicator": false,
    "businessEntityStatusCategory": "Small"
  },
  "filingDate": "2015-06-09",
  "class/subclass": "137/573",
  "nationalStageIndicator": false,
  "firstInventorName": "CHIN-MING LIN",
  "cpcClassificationBag": [
    "H01L21/67393",
    "Y10T137/86212"
  ],
  "effectiveFilingDate": "2015-06-09",
  "publicationDateBag": [
    "2015-12-10"
  ],
  "publicationSequenceNumberBag": [
    "0357218"
  ],
  "earliestPublicationDate": "2015-12-10",
  "applicationTypeLabelName": "Utility",
  "applicationStatusDate": "2018-01-31",
  "class": "137",
  "applicationTypeCategory": "REGULAR",
  "applicationStatusDescriptionText": "Patented Case",
  "patentNumber": "9899246",
  "grantDate": "2018-02-20",
  "applicantBag": [
    {
      "applicantNameText": "GUDENG PRECISION INDUSTRIAL CO., LTD",
      "correspondenceAddressBag": [
        {
          "cityName": "New Taipei City",
          "countryCode": "TW",
          "nameLineOneText": "GUDENG PRECISION INDUSTRIAL CO., LTD",
          "countryName": "TAIWAN",
          "postalAddressCategory": "postal"
        }
      ]
    }
  ],
  "firstApplicantName": "GUDENG PRECISION INDUSTRIAL CO., LTD",
  "customerNumber": 88174,
  "groupArtUnitNumber": "3753",
  "earliestPublicationNumber": "US20150357218A1",
  "inventionTitle": "GAS DISTRIBUTOR USED IN WAFER CARRIERS",
  "applicationConfirmationNumber": 3190,
  "examinerNameText": "HICKS, ANGELISA",
  "subclass": "573",
  "publicationCategoryBag": [
    "Granted/Issued",
    "Pre-Grant Publications - PGPub"
  ],
  "docketNumber": "KS-00041",
  "title": "GAS DISTRIBUTOR USED IN WAFER CARRIERS",
  "parsed_CTNF": [
    {
      "claimNumber": 1,
      "parentClaim": -1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 102,
          "citedPatents": [
            {
              "patentNum": "US 6758876",
              "text": [],
              "img": [
                "19"
              ]
            }
          ],
          "reason": "Regarding Claim 1, Suzuki et al. (US 6758876) discloses a gas distributor used in wafer carriers comprising a body having an interior space and a separator configured in the interior space. Suzuki et al. also discloses that one edge of the separator and the front side of the body form a passage, and the separator divides the interior space into a first room connected with an air inlet, where the air inlet and passage are configured at adjacent sides of the body. It further discloses a second room connected with at least one air outlet, configured on the rear side of the body."
        }
      ]
    },
    {
      "claimNumber": 2,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 102,
          "citedPatents": [
            {
              "patentNum": "US 6758876",
              "text": [],
              "img": [
                "19"
              ]
            }
          ],
          "reason": "Regarding Claim 2, Suzuki et al. (US 6758876) discloses the separator further comprises an extended member, and the extended member extends into the first room."
        }
      ]
    },
    {
      "claimNumber": 3,
      "parentClaim": 2,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 102,
          "citedPatents": [
            {
              "patentNum": "US 6758876",
              "text": [],
              "img": [
                "19"
              ]
            }
          ],
          "reason": "Regarding Claim 3, Suzuki et al. (US 6758876) discloses the extended member has a plane facing the front side of the body, and the width of the plane is greater at the end away from the air inlet."
        }
      ]
    },
    {
      "claimNumber": 4,
      "parentClaim": 2,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 102,
          "citedPatents": [
            {
              "patentNum": "US 6758876",
              "text": [],
              "img": [
                "19"
              ]
            }
          ],
          "reason": "Regarding Claim 4, Suzuki et al. (US 6758876) discloses the extended member has a plane facing the front side of the body, and wherein the plane comprises a first part and a second part having a width larger than that of the first part."
        }
      ]
    },
    {
      "claimNumber": 5,
      "parentClaim": 4,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 102,
          "citedPatents": [
            {
              "patentNum": "US 6758876",
              "text": [],
              "img": [
                "19"
              ]
            }
          ],
          "reason": "Regarding Claim 5, Suzuki et al. (US 6758876) discloses the width of the second part is constant and the width of the second part is greater at the end away from the air inlet."
        }
      ]
    }
  ]
}