{
  "id": 4,
  "abstract": "ABSTRACT A cylinder liner that is casted in a block and defines a cylinder bore corresponding to one cylinder includes: a cylindrical liner body; a projection part provided so as to include a plurality of projections on an outer peripheral surface of a part of the liner body; and a bore adjacent part formed such that the outer peripheral surface at an upper side end of the liner body is positioned more on an inner side of the liner body than the outer peripheral surface below the upper side end, and the projections are absent on at least a part of the outer peripheral surface at the upper side end, in a predetermined range of the outer peripheral surface of the liner body, which faces another cylinder bore to be adjacent when casted in the block. 23",
  "initialClaims": [
    "1. A cylinder liner that is casted in a block and defines a cylinder bore corresponding to one cylinder, comprising: a cylindrical liner body; a projection part provided so as to include a plurality of projections on an outer peripheral surface of a part of the liner body; and a bore adjacent part formed such that the outer peripheral surface at an upper side end of the liner body is positioned more on an inner side of the liner body than the outer peripheral surface below the upper side end, and the projections are absent on at least a part of the outer peripheral surface at the upper side end, in a predetermined range of the outer peripheral surface of the liner body, which faces another cylinder bore to be adjacent when casted in the block.",
    "2. The cylinder liner according to claim 1, further comprising a positioning part provided so as to be at a predetermined relative position to the bore adjacent part such that the bore adjacent part is positioned at a predetermined position facing the other adjacent cylinder bore when casted in the block.",
    "3. The cylinder liner according to claim 2, wherein the bore adjacent part is provided in a pair at one side face part and the other side face part positioned on an opposite side of the one side face part across a center axis of the liner body, at the upper side end, and the positioning part is provided on a part corresponding to at least one of the one side face part and the other side face part at a lower side end of the liner body.",
    "4. The cylinder liner according to claim 3, wherein the positioning part is provided in a pair at respective lower parts of the one side face part and the other side face part at the lower side end of the liner body, and the bore adjacent parts and the positioning parts are provided such that a virtual line defined by connecting the bore adjacent parts provided in the pair and a virtual line defined by connecting the positioning parts provided in the pair cross at an angle of 0 degrees to 90 degrees in an upper view of the liner body.",
    "5. The cylinder liner according to claim 4, wherein the virtual line defined by connecting the bore adjacent parts provided in the pair and the virtual line defined by connecting the positioning parts provided in the pair overlap in the upper view of the liner body.",
    "6. A method of manufacturing a block for a multi-cylinder engine using a plurality of cylinder liners according to claim 5, the method comprising: a step of positioning the plurality of cylinder liners on a predetermined straight line by bringing the positioning part of each of the plurality of cylinder liners into contact with a straight positioning shaft; a step of casting a body side of the block to the plurality of positioned cylinder liners; and a step of forming a passage where a cooling medium flows at a position held between the bore adjacent parts that the corresponding two cylinder liners respectively have, between the adjacent cylinder bores defined by the cylinder liners, in the body of the block after being casted.",
    "7. A manufacturing method of a cylinder liner that is casted in a block and defines a cylinder bore corresponding to one cylinder, the cylinder manufacturing method comprising: a step of casting a basic member of a cylindrical liner body including a plurality of projections on an outer peripheral surface; a step of providing a machining reference surface to the basic member of the liner body; a step of determining a first part at an upper side end of the basic member of the liner body, which faces another cylinder bore to be adjacent when casted in the block, with the machining reference surface as a reference; and a step of cutting an outer surface of the basic member of the liner body corresponding to the first part, and forming a bore adjacent part by positioning the outer peripheral surface at the upper side end more on an inner side of the liner body than the outer peripheral surface below the upper side end and removing the projections on at least a part of the outer peripheral surface at the upper side end.",
    "8. The cylinder liner manufacturing method according to claim 7, further comprising: a step of determining a second part at the lower side end of the basic member of the liner body, to be a predetermined relative position to the bore adjacent part; and a step of cutting the basic member of the liner body corresponding to the second part in the radial direction, and forming a positioning part that positions the bore adjacent part at a predetermined position facing the other adjacent cylinder bore when casted in the block."
  ],
  "finalClaims": [
    "1. (Cancelled)",
    "2. (Cancelled)",
    "3. (Cancelled)",
    "4. The cylinder liner according to claim 3, wherein the positioning part is provided in a pair at respective lower parts of the one side face part and the other side face part at the lower side end of the liner body, and the bore adjacent parts and the positioning parts are provided such that a virtual line defined by connecting the bore adjacent parts provided in the pair and a virtual line defined by connecting the positioning parts provided in the pair cross at an angle of 0 degrees to 90 degrees in an upper view of the liner body.",
    "5. The cylinder liner according to claim 4, wherein the virtual line defined by connecting the bore adjacent parts provided in the pair and the virtual line defined by connecting the positioning parts provided in the pair overlap in the upper view of the liner body.",
    "6. A method of manufacturing a block for a multi-cylinder engine using a plurality of cylinder liners according to claim 5, the method comprising: a step of positioning the plurality of cylinder liners on a predetermined straight line by bringing the positioning part of each of the plurality of cylinder liners into contact with a straight positioning shaft; a step of casting a body side of the block to the plurality of positioned cylinder liners; and a step of forming a passage where a cooling medium flows at a position held between the bore adjacent parts that the corresponding two cylinder liners respectively have, between the adjacent cylinder bores defined by the cylinder liners, in the body of the block after being casted.",
    "7. A manufacturing method of a cylinder liner that is casted in a block and defines a cylinder bore corresponding to one cylinder, the cylinder manufacturing method comprising: a step of casting a basic member of a cylindrical liner body including a plurality of projections on an outer peripheral surface; a step of providing a machining reference surface to the basic member of the liner body; a step of determining a first part at an upper side end of the basic member of the liner body, which faces another cylinder bore to be adjacent when casted in the block, with the machining reference surface as a reference; and a step of cutting an outer surface of the basic member of the liner body corresponding to the first part, and forming a bore adjacent part by positioning the outer peripheral surface at the upper side end more on an inner side of the liner body than the outer peripheral surface below the upper side end and removing the projections on at least a part of the outer peripheral surface at the upper side end.",
    "8. The cylinder liner manufacturing method according to claim 7, further comprising: a step of determining a second part at the lower side end of the basic member of the liner body, to be a predetermined relative position to the bore adjacent part; and a step of cutting the basic member of the liner body corresponding to the second part in the radial direction, and forming a positioning part that positions the bore adjacent part at a predetermined position facing the other adjacent cylinder bore when casted in the block."
  ],
  "CTNFDocumentIdentifier": "KC3HJ2QWRXEAPX2",
  "CTNFBodyText": "\n\n    DETAILED ACTION\n\nClaim Rejections - 35 USC § 103\nThe following is a quotation of 35 U.S.C. 103 which forms the basis for all obviousness rejections set forth in this Office action:\nA patent for a claimed invention may not be obtained, notwithstanding that the claimed invention is not identically disclosed as set forth in section 102, if the differences between the claimed invention and the prior art are such that the claimed invention as a whole would have been obvious before the effective filing date of the claimed invention to a person having ordinary skill in the art to which the claimed invention pertains. Patentability shall not be negated by the manner in which the invention was made.\n\nClaims 1-2 are rejected under 35 U.S.C. 103 as being unpatentable over Rebmann (US Pub No 2018/0179985) in view of Wang et al. (US Pub No 2018/0298842).\nIn regard to claim 1,\nRebmann discloses a cylinder liner (see Figs 3d and 6) that is casted in a block (Paragraph 0022)and defines a cylinder bore (2a, Fig 3d) corresponding to one cylinder, comprising:\na cylindrical liner body (1, Figs 3d and 6);\nan outer peripheral surface (best seen in Fig 6, to include generally the inner walls of gap 6a between each bore, along with the “bulk” of the exterior of the liner)\na bore adjacent part (gap 6a, Figs 3d and 6) formed such that the outer peripheral surface at an upper side end of the liner body is positioned more on an inner side of the liner body than the outer peripheral surface below the upper side end (gap 6a generally forming a step “in towards” the bore 2a (best seen in Fig 3d), versus the thickness at the “bottom” of gap 6a).\nRebmann does not positively disclose:\na projection part provided so as to include a plurality of projections on the outer peripheral surface of a part of the liner body; or\nwherein the projections are absent on at least a part of the outer peripheral surface at the upper side end, in a predetermined range of the outer peripheral surface of the liner body, which faces another cylinder bore to be adjacent when casted in the block.\nHowever, it is very well known in the art to configure cylinder liners with “projections” formed on the exterior surfaces, where said surfaces mate with engine blocks into which they are installed. For example,\nWang discloses a cylinder liner (Title) arrangement, wherein the exterior surfaces of the liner elements are provided with projections (see Fig 3a). Wang teaches that: (Paragraph 0035) such a configuration “provides an excellent structural and thermal bond through mechanical locking between the liner and the engine block material” and (Paragraph 0038) “FIG. 3A clearly illustrates the intimacy that results from the use of a cylinder liner having an as-cast rough surface which provides a relatively high coefficient of thermal transfer between the cylinder liner 304 and the engine block 300.”.\nIt would have been obvious to one of ordinary skill in the art at the time the invention was made to configure the portions of the outer surfaces of the liner with such projections where the liner mates with its engine block (so, not the area of gaps 6a) in order to provide an excellent structural and thermal bond between the liner and block as taught by Wang.\nIn regard to claim 2,\nRebmann modified supra discloses the liner of claim 1, further comprising a positioning part (considered to be the “flange” surrounding the liner sections, as seen in Fig 6) provided so as to be at a predetermined relative position to the bore adjacent part (all being formed as a single structure, the flange generally keeping the position of each liner section relative to the others) such that the bore adjacent part is positioned at a predetermined position facing the other adjacent cylinder bore when casted in the block (gaps 6a being located between each of bores 2a-2d).\n\nAllowable Subject Matter\nClaims 3-6 are objected to as being dependent upon a rejected base claim, but appear that they would be allowable if rewritten in independent form including all of the limitations of the base claim and any intervening claims.\nClaims 7-8 appear to contain allowable subject matter.\n\nConclusion\n",
  "NOABodyText": "CNTA  16/546,449  NOA  89074     Reasons for Allowance  13-03 AIA The following is an examiner’s statement of reasons for allowance:  The primary reasons for allowance are noted below, in excerpts from independent claims 1 and 7:   (From claim 1): “wherein the bore adjacent part is provided in a pair at one side face part and the other side face part positioned on an opposite side of the one side face part across a center axis of the liner body, at the upper side end, and  the positioning part is provided on a part corresponding to at least one of the one side face part and the other side face part at a lower side end of the liner body”   (From claim 7): “a step of determining a first part at an upper side end of the basic member of the liner body, which faces another cylinder bore to be adjacent when casted in the block, with the machining reference surface as a reference; and  a step of cutting an outer surface of the basic member of the liner body corresponding to the first part, and forming a bore adjacent part by positioning the outer peripheral surface at the upper side end more on an inner side of the liner body than the outer peripheral surface below the upper side end and removing the projections on at least a part of the outer peripheral surface at the upper side end”   Cylinder liners with “positioning parts” in general are known in the art; for example, see Rebmann (US Pub No 2018/0179985) and the non-final rejection of 6 July 2020. However, the specific structural and location details of the parts (and the steps of manufacturing such parts) set forth in the noted excerpts above are sufficiently limiting to set the instant application apart from the prior art .   Any comments considered necessary by applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled “Comments on Statement of Reasons for Allowance.”   Conclusion  Any inquiry concerning this communication or earlier communications from the examiner should be directed to JACOB M AMICK whose telephone number is (571)272-5790.  The examiner can normally be reached on Core Hours 10-6 M-F (First Fridays Off).  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examiner’s supervisor, Lindsay Low can be reached on (571) 272-1196.  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see https://ppair-my.uspto.gov/pair/PrivatePair. Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll- free). If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.        /JACOB M AMICK/Primary Examiner, Art Unit 3747     Application/Control Number:  16/546,449\tPage 2    Art Unit:  3747      Application/Control Number:  16/546,449\tPage 3    Art Unit:  3747",
  "applicationNumber": "16546449",
  "patentsCitedByExaminer": [
    {
      "referenceIdentifier": "20180298842",
      "abstract": "A cylinder liner for an engine block includes a first engine block bonding surface, and a second engine block bonding surface that provides a lower heat transfer coefficient between the cylinder liner and an adjacent engine block material than the first engine block bonding surface. The second engine block bonding surface extends a substantial portion of the axial length of the cylinder liner.",
      "claims": [
        "1. A cylinder liner for an engine block, the liner comprising:\na first engine block bonding surface; and\na second engine block bonding surface that provides a lower heat transfer coefficient between the cylinder liner and an adjacent engine block material than the first engine block bonding surface, and wherein the second engine block bonding surface extends a substantial portion of the axial length of the cylinder liner.",
        "2. The cylinder liner of claim 1, wherein the first engine block bonding surface extends around a substantial majority of the circumferential periphery of the cylinder liner.",
        "3. The liner of claim 1, wherein the first engine block bonding surface comprises an as-cast rough surface.",
        "4. The liner of claim 3, wherein the as-cast rough surface comprises a spiny-lock surface.",
        "5. The liner of claim 3, wherein the as-cast rough surface comprises a plurality of projections radially extending between about 0.3 to 0.7 millimeters.",
        "6. The liner of claim 1, wherein the second engine block bonding surface comprises a machined surface.",
        "7. The liner of claim 1, wherein the second engine block bonding surface extends across a majority of the axial length of the liner.",
        "8. The liner of claim 1, wherein the first engine block bonding surface is configured to provide a high thermal conductivity between the liner and the engine block and wherein the second engine block bonding surface is configured to provide a lower thermal conductivity such that heat transfer into an inter-bore section of an adjacent engine block material is reduced during operation of an engine incorporating the cylinder liner.",
        "9. The liner of claim 1, wherein the second engine block bonding surface circumferentially extends across an area adjacent to the inter-bore section of the engine block.",
        "10. The liner of claim 9, wherein the first engine block bonding surface extends across the remaining circumferential extent.",
        "11. An engine block comprising:\nan engine block material defining a plurality of cylinder bores and an inter-bore section between two of the plurality of cylinder bores; and\na cylinder liner positioned within one of the cylinder bores, wherein the liner includes a first engine block bonding surface, and a second engine block bonding surface oriented adjacent to the inter-bore section that provides a lower heat transfer coefficient between the cylinder liner and the engine block material than the first engine block bonding surface, wherein the second engine block bonding surface extends a substantial portion of the axial length of the cylinder liner.",
        "12. The engine block of claim 11, wherein the first engine block bonding surface extends around a substantial majority of the circumferential periphery of the cylinder liner.",
        "13. The engine block of claim 11, wherein the first engine block bonding surface comprises an as-cast rough surface.",
        "14. The engine block of claim 13, wherein the as-cast rough surface comprises a spiny-lock surface.",
        "15. The engine block of claim 13, wherein the as-cast rough surface comprises a plurality of projections radially extending between about 0.3 to 0.7 millimeters.",
        "16. The engine block of claim 11, wherein the second engine block bonding surface comprises a machined surface.",
        "17. The engine block of claim 11, wherein the second engine block bonding surface extends across a majority of the axial length of the liner.",
        "18. The engine block of claim 11, wherein the first engine block bonding surface is configured to provide a high thermal conductivity between the liner and the engine block and wherein the second engine block bonding surface is configured to provide a lower thermal conductivity such that heat transfer into an inter-bore section of an adjacent engine block material is reduced during operation of an engine incorporating the cylinder liner.",
        "19. The engine block of claim 11, wherein the second engine block bonding surface circumferentially extends across an area adjacent to the inter-bore section of the engine block.",
        "20. The liner of claim 19, wherein the first engine block bonding surface extends across the remaining circumferential extent."
      ],
      "title": "CYLINDER LINER FOR INTERNAL COMBUSTION ENGINE"
    },
    {
      "referenceIdentifier": "20180179985",
      "abstract": "An assembly, a crankcase, a reciprocating internal combustion engine, and a method for producing a reciprocating internal combustion engine facilitates engine block cleaning after casting, enables current and future residual-soiling standards to be met, and provides a solution to the challenges facing current and future high-performance engines, in particular the load zones head plate and cylinder tube, as well as potential for local improvement to properties in the crankcase in the additional load zones, namely the screw connection connecting the cylinder head and the crankshaft bearing. The assembly includes at least two cylinders and a platelike deck plate connecting them of integral design, wherein the platelike deck plate has a clearance for each cylinder and wherein the assembly can be inserted into or placed upon a crankcase of a reciprocating internal combustion engine, in that at least one coolant guideway is arranged between the cylinders.",
      "claims": [
        "1. Reciprocating internal combustion engine comprising a cylinder head (8), a crankcase (7a;\n7b) according to claim 7 and an assembly (1), wherein the crankcase (7a;\n7b) comprises a recess (for accommodating the assembly (1), wherein the assembly (comprises at least two cylinders (2a, 2b;\n2a, 2b, 2c;\n2a, 2b, 2c, 2d;\n2a, 2b, 2c, 2d, 2e, 2f) and a platelike deck plate (connecting them, wherein the assembly (is of integral design, wherein the platelike deck plate (has a clearance (3a;\n3b;\n3c;\n3d;\n3e;\n3f) for each cylinder (2a;\n2b;\n2c;\n2d;\n2e;\n2f) and wherein the assembly (can be inserted into a crankcase (7a;\n7b;\n7c) of a reciprocating internal combustion engine or placed upon a crankcase (7a;\n7b;\n7c) of a reciprocating internal combustion engine, and wherein the assembly (is arranged between the cylinder head (and the crankcase (7a;\n7b;\n7c) and in the recess (for accommodating the assembly (and wherein the outer wall areas of the cylinders (2a, 2b, 2c, 2d;\n2a, 2b, 2c, 2d, 2e, 2f) of the assembly (and the wall areas of the recess (in the crankcase (7a;\n7b;\n7c) for accommodating the assembly (form a coolant chamber (11), wherein at least one coolant guideway (is arranged between the cylinders (2a, 2b;\n2b, 2c;\n2c, 2d;\n2e, 2f;\n2a, 2b, 2c;\n2c, 2d, 2e) of the assembly (1), wherein the coolant guideway (of the assembly (is realized by drilling through the area between two neighboring cylinders (2a, 2b;\n2b, 2c;\n2c, 2d;\n2d, 2e;\n2e, 2f) and/or by a cooling-channel core in the area between two cylinders (2a, 2b;\n2b, 2c;\n2c, 2d;\n2d, 2e;\n2e, 2f), and the platelike deck plate (of the assembly (is configured free of openings except for the clearance (3a;\n3b;\n3c;\n3d) for each cylinder (2a;\n2b;\n2c;\n2d).",
        "2. (canceled)",
        "3. (canceled)",
        "4. Reciprocating internal combustion engine according to claim 1, wherein the assembly (is made of cast iron with lamellar graphite (GJL), cast iron with vermicular graphite (GJV), cast iron with spheroidal graphite (GJS) and/or steel and/or a combination of the aforementioned materials.",
        "5. Reciprocating internal combustion engine according to claim 1, wherein the assembly (is made of non-ferrous materials, in particular aluminum alloys, such as aluminum-magnesium alloys (AlMgxx), aluminum-silicon alloys (AlSixx) with copper (Cu) and/or magnesium (Mg) and/or aluminum wrought alloys.",
        "6. (canceled)",
        "7. (canceled)",
        "8. (canceled)",
        "9. (canceled)",
        "10. Reciprocating internal combustion engine according to claim 1, wherein the platelike deck plate (connecting the at least two cylinders (2a, 2b;\n2a, 2b, 2c;\n2a, 2b, 2c, 2d;\n2a, 2b, 2c, 2d, 2e, 2f) is placed upon the crankcase (7a, 7b;\n7c) or inserted into the recess (for accommodating the assembly (1).",
        "11. (canceled)",
        "12. Method of producing the reciprocating internal combustion engine according to claim 1, comprising the following steps:\nSeparate production of the crankcase (7a;\n7b;\n7c), the assembly (and the cylinder head (8), Insertion of the assembly (into the crankcase (7a;\n7b;\n7c), Arrangement of the cylinder head (on the platelike deck plate (of the assembly (1), Joining of the crankcase (7a;\n7b;\n7c), the assembly (and the cylinder head (8).",
        "13. Method of producing the reciprocating internal combustion engine according to claim 1, comprising the following steps:\nSeparate production of the crankcase (7a;\n7b;\n7c), the assembly (and the cylinder head (8), Arrangement of the cylinder head (on the platelike deck plate (of the assembly (1), Insertion of the assembly (into the crankcase (7a;\n7b;\n7c), Joining of the crankcase (7a;\n7b;\n7c), the assembly (and the cylinder head (8)."
      ],
      "title": "RECIPROCATING INTERNAL COMBUSTION ENGINE, AND METHOD FOR PRODUCING A RECIPROCATING INTERNAL COMBUSTION ENGINE"
    }
  ],
  "firstInventorToFileIndicator": "Y",
  "applicationStatusCode": 150,
  "applicationTypeCode": "UTL",
  "entityStatusData": {
    "smallEntityStatusIndicator": false,
    "businessEntityStatusCategory": "Regular Undiscounted"
  },
  "filingDate": "2019-08-21",
  "class/subclass": "123/41.79",
  "nationalStageIndicator": false,
  "firstInventorName": "Akira Sato",
  "cpcClassificationBag": [
    "F02F1/004",
    "F02B75/18",
    "F02F1/16",
    "F02F1/108",
    "B22D19/08"
  ],
  "effectiveFilingDate": "2019-08-21",
  "publicationDateBag": [
    "2020-02-27"
  ],
  "publicationSequenceNumberBag": [
    "0063685"
  ],
  "earliestPublicationDate": "2020-02-27",
  "applicationTypeLabelName": "Utility",
  "applicationStatusDate": "2020-12-09",
  "class": "123",
  "applicationTypeCategory": "REGULAR",
  "applicationStatusDescriptionText": "Patented Case",
  "patentNumber": "10876494",
  "grantDate": "2020-12-29",
  "applicantBag": [
    {
      "applicantNameText": "TPR Co., Ltd.",
      "correspondenceAddressBag": [
        {
          "cityName": "Tokyo",
          "countryCode": "JP",
          "postalCode": "100-0005",
          "nameLineOneText": "TPR Co., Ltd.",
          "countryName": "JAPAN",
          "postalAddressCategory": "postal"
        }
      ]
    },
    {
      "applicantNameText": "TPR Industry Co., Ltd.",
      "correspondenceAddressBag": [
        {
          "cityName": "Yamagata",
          "countryCode": "JP",
          "postalCode": "990-0561",
          "nameLineOneText": "TPR Industry Co., Ltd.",
          "countryName": "JAPAN",
          "postalAddressCategory": "postal"
        }
      ]
    }
  ],
  "firstApplicantName": "TPR Co., Ltd.",
  "customerNumber": 4743,
  "groupArtUnitNumber": "3747",
  "earliestPublicationNumber": "US20200063685A1",
  "inventionTitle": "Cylinder Liner, Block Manufacturing Method and Cylinder Liner Manufacturing Method",
  "applicationConfirmationNumber": 3985,
  "examinerNameText": "AMICK, JACOB M",
  "subclass": "41.79",
  "publicationCategoryBag": [
    "Granted/Issued",
    "Pre-Grant Publications - PGPub"
  ],
  "docketNumber": "32421/54263",
  "title": "Cylinder Liner, Block Manufacturing Method and Cylinder Liner Manufacturing Method",
  "parsed_CTNF": [
    {
      "claimNumber": 1,
      "parentClaim": -1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20180179985",
              "text": [
                22
              ],
              "img": [
                "3d",
                "6"
              ]
            },
            {
              "patentNum": "US 20180298842",
              "text": [
                35,
                38
              ],
              "img": [
                "3A"
              ]
            }
          ],
          "reason": "Regarding Claim 1, Rebmann (US 20180179985) discloses a cylinder liner (see Figs 3d and 6) that is casted in a block (Paragraph 0022) and defines a cylinder bore (2a, Fig 3d) corresponding to one cylinder, comprising: a cylindrical liner body (1, Figs 3d and 6); an outer peripheral surface (best seen in Fig 6, to include generally the inner walls of gap 6a between each bore, along with the 'bulk' of the exterior of the liner) a bore adjacent part (gap 6a, Figs 3d and 6) formed such that the outer peripheral surface at an upper side end of the liner body is positioned more on an inner side of the liner body than the outer peripheral surface below the upper side end (gap 6a generally forming a step 'in towards' the bore 2a (best seen in Fig 3d), versus the thickness at the 'bottom' of gap 6a). Rebmann does not positively disclose: a projection part provided so as to include a plurality of projections on the outer peripheral surface of a part of the liner body; or wherein the projections are absent on at least a part of the outer peripheral surface at the upper side end, in a predetermined range of the outer peripheral surface of the liner body, which faces another cylinder bore to be adjacent when casted in the block. However, it is very well known in the art to configure cylinder liners with 'projections' formed on the exterior surfaces, where said surfaces mate with engine blocks into which they are installed. Wang (US 20180298842) discloses a cylinder liner (Title) arrangement, wherein the exterior surfaces of the liner elements are provided with projections (see Fig 3a). Wang teaches that: (Paragraph 0035) such a configuration 'provides an excellent structural and thermal bond through mechanical locking between the liner and the engine block material' and (Paragraph 0038) 'FIG. 3A clearly illustrates the intimacy that results from the use of a cylinder liner having an as-cast rough surface which provides a relatively high coefficient of thermal transfer between the cylinder liner 304 and the engine block 300.'. It would have been obvious to one of ordinary skill in the art at the time the invention was made to configure the portions of the outer surfaces of the liner with such projections where the liner mates with its engine block (so, not the area of gaps 6a) in order to provide an excellent structural and thermal bond between the liner and block as taught by Wang."
        }
      ]
    },
    {
      "claimNumber": 2,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20180179985",
              "text": [],
              "img": [
                "6"
              ]
            },
            {
              "patentNum": "US 20180298842",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 2, Rebmann (US 20180179985) modified supra discloses the liner of claim 1, further comprising a positioning part (considered to be the 'flange' surrounding the liner sections, as seen in Fig 6) provided so as to be at a predetermined relative position to the bore adjacent part (all being formed as a single structure, the flange generally keeping the position of each liner section relative to the others) such that the bore adjacent part is positioned at a predetermined position facing the other adjacent cylinder bore when casted in the block (gaps 6a being located between each of bores 2a-2d)."
        }
      ]
    },
    {
      "claimNumber": 3,
      "parentClaim": 2,
      "isReject": false,
      "reasons": []
    },
    {
      "claimNumber": 4,
      "parentClaim": 3,
      "isReject": false,
      "reasons": []
    },
    {
      "claimNumber": 5,
      "parentClaim": 4,
      "isReject": false,
      "reasons": []
    },
    {
      "claimNumber": 6,
      "parentClaim": 5,
      "isReject": false,
      "reasons": []
    },
    {
      "claimNumber": 7,
      "parentClaim": -1,
      "isReject": false,
      "reasons": []
    },
    {
      "claimNumber": 8,
      "parentClaim": 7,
      "isReject": false,
      "reasons": []
    }
  ]
}