{
  "id": 2,
  "abstract": "ABSTRACT A system for monitoring biometric signals of a user comprising: a set of wireless sensor  interfaces coupled to a garment, each of the wireless sensor interfaces comprising:  1 ) an  electrode layer comprising a receiving region,  2 ) a positional identifier, associated with a  position on the garment, and  3 ) a retention subsystem; a set of wireless sensor modules,  each of the set of wireless sensor modules comprising: a contact region electrically  coupleable to the receiving region of the electrode layer, a set of sensors configured to  detect a set of biometric signal types, and a positional interrogator configured to identify  the position associated with the corresponding wireless sensor interface; and a control  module, communicatively coupled to the set of wireless sensor modules, wherein the  control module queries a subset of the set of biometric signal types for transmission  from each of the set of wireless sensor modules based on their positions. Page  51 of 51",
  "initialClaims": [
    "1. A biometric monitoring system, comprising: - a set of wireless sensor interfaces coupled to a garment, each of the set of wireless sensor interfaces comprising: 1) an electrode layer, configured for electrical contact with a user during operation, the electrode layer comprising a receiving region, 2) a positional identifier, associated with a position on the garment, and 3) a retention subsystem; - a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces and comprising: - a contact region electrically coupleable to the receiving region of the electrode layer of the corresponding wireless sensor interface, - a set of sensors configured to detect a set of biometric signal types, and - a positional interrogator configured to identify, upon interacting with the positional identifier of the corresponding wireless sensor interface, the position associated with the corresponding wireless sensor interface; and - a control module, communicatively coupled to the set of wireless sensor modules, wherein, based upon a detected position of each of the set of wireless sensor modules, the control module queries a subset of the set of biometric signal types for transmission from each of the set of wireless sensor modules.",
    "2. The system of Claim 1, wherein the electrode layer further comprises a signal communication region, the signal communication region including a set of conductive leads, at least a portion of each of the set of conductive leads configured to electrically couple to the contact region of the corresponding wireless sensor module, and a set of biosensing contacts, coupled to the set of conductive leads of the signal communication region, the set of biosensing contacts composed of a conductive polymer, at least a portion of each of the set of biosensing contacts disposed adjacent to and in electrical contact with a skin region of the user.",
    "3. The system of Claim 1, wherein the retention subsystem comprises a fabric layer covering the electrode layer and fixed to the garment at a portion of a periphery of the fabric layer, the retention subsystem thereby configured to form a pocket comprising an opening.",
    "4. The system of Claim 1, wherein the positional identifier comprises a set of electronic circuit components which exhibit a known characteristic when an electrical current passes therethough, and wherein the positional interrogator is configured to induce the set of electrical components to exhibit the known characteristic thereof.",
    "5. The system of Claim 1, wherein the positional identifier comprises a wireless identification integrated circuit, and wherein the known characteristic comprises an encoded signal delivered by the wireless identification integrated circuit during operation.",
    "6. The system of Claim 1, wherein the positional identifier comprises an integrated circuit, wherein the known characteristic comprises a unique identification code, and wherein the unique identification code is read by the positional interrogator during operation.",
    "7. The system of Claim 1, wherein the control module is electrically coupled to the garment at a control module interface.",
    "8. The system of Claim 7, wherein the control module further comprises a user input terminal and a user output display.",
    "9. The system of Claim 1, wherein a first wireless sensor module of the set of wireless sensor modules is positioned proximal a heart region of the user, a second wireless sensor module is positioned proximal a quadriceps region of the user, the subset of biometric signal types of the first wireless sensor module queried by the control module comprises a heart rate signal type, and the subset of biometric signal types of the second wireless sensor module queried by the control module comprises an electromyography signal type.",
    "10. A biometric monitoring system, comprising: - a wireless sensor interface coupled to a garment, comprising: 1) an electrode layer, configured for electrical contact with a user during operation, the first electrode layer comprising a receiving region, 2) a positional identifier, associated with a position on the garment, and 3) a retention subsystem; - a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless sensor interface and comprising: - a contact region coupleable to the receiving region of the first electrode layer, - a set of sensors configured to detect a set of biometric signal types, and - a positional interrogator configured to identify, upon interacting with the positional identifier of the wireless sensor interface, the position associated with the wireless sensor interface; and - a control module, communicatively coupled to the wireless sensor module, wherein, based upon a detected position of the wireless sensor module, the control module queries a subset of the set of biometric signal types for transmission from the wireless sensor module.",
    "11. The system of Claim 10, wherein the retention subsystem comprises a mount, embedded in the garment, configured to receive and removably couple to an external surface of the wireless sensor module.",
    "12. The system of Claim 10, wherein the positional identifier comprises at least one passive electronic component, and wherein the positional interrogator is configured to induce the passive electronic component to exhibit a known characteristic during operation.",
    "13. The system of Claim 10, wherein the contact region of at least one wireless sensor module includes an array of raised surfaces, at least a first of the array of raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface, and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface.",
    "14. A method for monitoring a biometric signal of a user, comprising: - at a first wireless sensor module, detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment; - by way of at least one of the first wireless sensor module and a control module, automatically selecting, based on the first position of the first wireless sensor module, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module; - from the first wireless sensor module, transmitting the first subset of biometric signal outputs to the control module.",
    "15. The method of Claim 14, further comprising: - providing a set of wireless sensor modules, each at a corresponding wireless sensor interface of the garment; - detecting, at each wireless sensor module of the set of wireless sensor modules, a corresponding position of each wireless sensor module with respect to the garment, based on an interaction between each wireless sensor module and the corresponding wireless sensor interface, and - by way of the control module, automatically selecting, based on the detected corresponding position of each wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding set of biometric signal outputs of each wireless sensor module.",
    "16. The method of Claim 15, wherein the interaction between the first wireless sensor and the first wireless sensor interface comprises measurement of the impedance of a portion of the wireless sensor interface by way of the first wireless sensor module.",
    "17. The method of Claim 14, further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module.",
    "18. The method of Claim 15, further comprising combining, at the control module, two of the corresponding subsets of biometric signal outputs of two of the wireless sensor modules of the set of wireless sensor modules into a compound biometric signal.",
    "19. The method of Claim 15, wherein transmitting comprises transmitting, from a first subset of the set of wireless sensor modules, an electromyography signal; transmitting, from a second subset of the set of wireless sensor modules, a motion signal; and wherein the method further comprises rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time.",
    "20. The method of Claim 15, further comprising at least one of recording, storing and processing the first subset of biometric signal outputs at the control module.",
    "21. The method of Claim 14, wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, electrooculography signals, electrocardiography signals, and electromyography signals."
  ],
  "finalClaims": [
    "1. A biometric monitoring system, comprising:a set of wireless sensor interfaces coupled to a garment, each of the wireless sensor interfaces comprising:an electrode layer configured for electrical contact with a user during operation, the electrode layer comprising a receiving region,a positional identifier associated with a position on the garment, anda retention subsystem;a set of wireless sensor modules, each of the wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces and comprising:a contact region electrically coupleable to the receiving region of the electrode layer of the corresponding wireless sensor interface,a set of sensors configured to detect a set of biometric signal types, anda positional interrogator configured to identify, upon interacting with the positional identifier of the corresponding wireless sensor interface, the position associated with the corresponding wireless sensor interface;and a control module communicatively coupled to the set of wireless sensor modules and configured to automatically select, for each wireless sensor module of the set of wireless sensor modules, a subset of the set of biometric signal types detected by an activated set of sensors corresponding to the wireless sensor a set of wireless sensor interfaces coupled to a garment, each of the wireless sensor interfaces comprising: an electrode layer configured for electrical contact with a user during operation, the electrode layer comprising a receiving region, a positional identifier associated with a position on the garment, and a retention subsystem; a set of wireless sensor modules, each of the wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces and comprising: a contact region electrically coupleable to the receiving region of the electrode layer of the corresponding wireless sensor interface, a set of sensors configured to detect a set of biometric signal types, and a positional interrogator configured to identify, upon interacting with the positional identifier of the corresponding wireless sensor interface, the position associated with the corresponding wireless sensor interface; and a control module communicatively coupled to the set of wireless sensor modules and configured to automatically select, for each wireless sensor module of the set of wireless sensor modules, a subset of the set of biometric signal types detected by an activated set of sensors corresponding to the wireless sensor 2. (Previously Presented) The system of claim 1, wherein the electrode layer further comprises a signal communication region, the signal communication region including a set of conductive leads, at least a portion of each of the conductive leads configured to electrically couple to the contact region of the corresponding wireless sensor module, and a set of biosensing contacts, coupled to the set of conductive leads of the signal communication region, the set of biosensing contacts composed of a conductive polymer, at least a portion of each of the biosensing contacts disposed adjacent to and in electrical contact with a skin region of the user. 3. (Previously Presented) The system of claim 1, wherein the retention subsystem comprises a fabric layer covering the electrode layer, wherein a portion of a periphery of the fabric layer is fixed to the garment to form a pocket comprising an opening. 4. (Previously Presented) The system of claim 1, wherein the positional identifier comprises a set of electronic circuit components configured to exhibit a known characteristic when an electrical current passes therethough, and wherein the positional interrogator is configured to induce the set of electrical components to exhibit the known characteristic. 5. (Previously Presented) The system of claim 1, wherein the positional identifier comprises a wireless identification integrated circuit configured to wirelessly provide an encoded signal. 6. (Previously Presented) The system of claim 1, wherein the positional identifier comprises an integrated circuit configured to provide a unique identification code capable of being read by the positional interrogator. 7. (Previously Presented) The system of claim 1, wherein the control module is electrically coupled to the garment at a control module interface. 8. (Previously Presented) The system of claim 7, wherein the control module further comprises a user input terminal and a user output display. 9. (Previously Presented) The system of claim 1, wherein the set of wireless sensor modules comprises a first wireless sensor module positioned at a heart region of the user and a second wireless sensor module positioned at a quadriceps region of the user, the selected subset of biometric signal types of the first wireless sensor module comprising a heart rate signal type, and the selected subset of biometric signal types of the second wireless sensor module comprising an electromyography signal type. 10. (Previously Presented) A biometric monitoring system, comprising:a wireless sensor interface coupled to a garment, comprising:an electrode layer configured for electrical contact with a user during operation, the electrode layer comprising a receiving region, and a positional identifier associated with a position on the garment;a wireless sensor module, configured to be coupled to the wireless sensor interface and comprising:a set of sensors configured to detect a set of biometric signal types, and a wireless sensor interface coupled to a garment, comprising: an electrode layer configured for electrical contact with a user during operation, the electrode layer comprising a receiving region, and a positional identifier associated with a position on the garment; a wireless sensor module, configured to be coupled to the wireless sensor interface and comprising: a set of sensors configured to detect a set of biometric signal types, and a positional interrogator configured to identify, upon interacting with the positional identifier of the wireless sensor interface, the position associated with the wireless sensor interface; and a control module communicatively coupled to the wireless sensor module and configured to automatically select a subset of the set of biometric signal types detected by an activated set of sensors corresponding to the wireless sensor module for transmission from the wireless sensor module, wherein the subset is selected based on a detected position of the wireless sensor. 11. (Previously Presented) The system of claim 10, wherein the wireless sensor interface further comprises a retention subsystem, the retention subsystem comprising a mount embedded in the garment and configured to couple to an external surface of the wireless sensor module. 12. (Previously Presented) The system of claim 10, wherein the positional identifier comprises at least one passive electronic component, and wherein the positional interrogator is configured to induce the passive electronic component to exhibit a known characteristic. 13. (Previously Presented) The system of claim 10, wherein the contact region of at least one wireless sensor module includes an array of raised surfaces, at least a first of the raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface, and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface. 14. (Previously Presented) A method for monitoring a biometric signal of a user, comprising:at a first wireless sensor module, detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment;by way of at least one of the first wireless sensor module and a control module,automatically selecting, based on the first position, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module, wherein the first subset of biometric signal outputs is detected by an activated set of sensors corresponding to the first wireless sensor module; andtransmitting the first subset of biometric signal outputs from the first wireless sensor module to the control module. at a first wireless sensor module, detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment; by way of at least one of the first wireless sensor module and a control module, automatically selecting, based on the first position, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module, wherein the first subset of biometric signal outputs is detected by an activated set of sensors corresponding to the first wireless sensor module; and transmitting the first subset of biometric signal outputs from the first wireless sensor module to the control module. 15. (Previously Presented) The method of claim 14, further comprising:providing a set of wireless sensor modules, each of the wireless sensor modules corresponding to a wireless sensor interface of the garment;at each of the wireless sensor modules, detecting, based on an interaction between the wireless sensor module and the corresponding wireless sensor interface, a corresponding position of the wireless sensor module with respect to the garment; andby way of the control module, automatically selecting, for each of the wireless sensor modules, based on the detected position of the wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding providing a set of wireless sensor modules, each of the wireless sensor modules corresponding to a wireless sensor interface of the garment; at each of the wireless sensor modules, detecting, based on an interaction between the wireless sensor module and the corresponding wireless sensor interface, a corresponding position of the wireless sensor module with respect to the garment; and by way of the control module, automatically selecting, for each of the wireless sensor modules, based on the detected position of the wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding 16. (Previously Presented) The method of claim 14, wherein the interaction between the first wireless sensor and the first wireless sensor interface comprises measurement of an impedance of a portion of the wireless sensor interface by way of the first wireless sensor module. 17. (Previously Presented) The method of claim 14, further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module. 18. (Previously Presented) The method of claim 15, further comprising combining, at the control module, two of the corresponding subsets of biometric signal outputs of two of the wireless sensor modules of the set of wireless sensor modules into a compound biometric signal. 19. (Previously Presented) The method of claim 15, wherein transmitting the first subset of biometric signal outputs comprises transmitting an electromyography signal from the first wireless sensor module to the control module, and wherein the method further comprises;transmitting a motion signal from a wireless sensor module of the set of wireless sensor modules; andrendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time. transmitting a motion signal from a wireless sensor module of the set of wireless sensor modules; and rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time. 20. (Previously Presented) The method of claim 14, further comprising at least one of recording, storing and processing the first subset of biometric signal outputs at the control module. 21. (Previously Presented) The method of claim 14, wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, electrooculography signals, electrocardiography signals, and electromyography signals.",
    "2. The system of claim 1, wherein the electrode layer further comprises a signal communication region, the signal communication region including a set of conductive leads, at least a portion of each of the conductive leads configured to electrically couple to the contact region of the corresponding wireless sensor module, and a set of biosensing contacts, coupled to the set of conductive leads of the signal communication region, the set of biosensing contacts composed of a conductive polymer, at least a portion of each of the biosensing contacts disposed adjacent to and in electrical contact with a skin region of the user.",
    "3. The system of claim 1, wherein the retention subsystem comprises a fabric layer covering the electrode layer, wherein a portion of a periphery of the fabric layer is fixed to the garment to form a pocket comprising an opening.",
    "4. The system of claim 1, wherein the positional identifier comprises a set of electronic circuit components configured to exhibit a known characteristic when an electrical current passes therethough, and wherein the positional interrogator is configured to induce the set of electrical components to exhibit the known characteristic.",
    "5. The system of claim 1, wherein the positional identifier comprises a wireless identification integrated circuit configured to wirelessly provide an encoded signal.",
    "6. The system of claim 1, wherein the positional identifier comprises an integrated circuit configured to provide a unique identification code capable of being read by the positional interrogator.",
    "7. The system of claim 1, wherein the control module is electrically coupled to the garment at a control module interface.",
    "8. The system of claim 7, wherein the control module further comprises a user input terminal and a user output display.",
    "9. The system of claim 1, wherein the set of wireless sensor modules comprises a first wireless sensor module positioned at a heart region of the user and a second wireless sensor module positioned at a quadriceps region of the user, the selected subset of biometric signal types of the first wireless sensor module comprising a heart rate signal type, and the selected subset of biometric signal types of the second wireless sensor module comprising an electromyography signal type.",
    "10. A biometric monitoring system, comprising:a wireless sensor interface coupled to a garment, comprising:an electrode layer configured for electrical contact with a user during operation, the electrode layer comprising a receiving region, and a positional identifier associated with a position on the garment;a wireless sensor module, configured to be coupled to the wireless sensor interface and comprising:a set of sensors configured to detect a set of biometric signal types, and a wireless sensor interface coupled to a garment, comprising: an electrode layer configured for electrical contact with a user during operation, the electrode layer comprising a receiving region, and a positional identifier associated with a position on the garment; a wireless sensor module, configured to be coupled to the wireless sensor interface and comprising: a set of sensors configured to detect a set of biometric signal types, and a positional interrogator configured to identify, upon interacting with the positional identifier of the wireless sensor interface, the position associated with the wireless sensor interface; and a control module communicatively coupled to the wireless sensor module and configured to automatically select a subset of the set of biometric signal types detected by an activated set of sensors corresponding to the wireless sensor module for transmission from the wireless sensor module, wherein the subset is selected based on a detected position of the wireless sensor.",
    "11. The system of claim 10, wherein the wireless sensor interface further comprises a retention subsystem, the retention subsystem comprising a mount embedded in the garment and configured to couple to an external surface of the wireless sensor module.",
    "12. The system of claim 10, wherein the positional identifier comprises at least one passive electronic component, and wherein the positional interrogator is configured to induce the passive electronic component to exhibit a known characteristic.",
    "13. The system of claim 10, wherein the contact region of at least one wireless sensor module includes an array of raised surfaces, at least a first of the raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface, and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface.",
    "14. A method for monitoring a biometric signal of a user, comprising:at a first wireless sensor module, detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment;by way of at least one of the first wireless sensor module and a control module,automatically selecting, based on the first position, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module, wherein the first subset of biometric signal outputs is detected by an activated set of sensors corresponding to the first wireless sensor module; andtransmitting the first subset of biometric signal outputs from the first wireless sensor module to the control module. at a first wireless sensor module, detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment; by way of at least one of the first wireless sensor module and a control module, automatically selecting, based on the first position, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module, wherein the first subset of biometric signal outputs is detected by an activated set of sensors corresponding to the first wireless sensor module; and transmitting the first subset of biometric signal outputs from the first wireless sensor module to the control module.",
    "15. The method of claim 14, further comprising:providing a set of wireless sensor modules, each of the wireless sensor modules corresponding to a wireless sensor interface of the garment;at each of the wireless sensor modules, detecting, based on an interaction between the wireless sensor module and the corresponding wireless sensor interface, a corresponding position of the wireless sensor module with respect to the garment; andby way of the control module, automatically selecting, for each of the wireless sensor modules, based on the detected position of the wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding providing a set of wireless sensor modules, each of the wireless sensor modules corresponding to a wireless sensor interface of the garment; at each of the wireless sensor modules, detecting, based on an interaction between the wireless sensor module and the corresponding wireless sensor interface, a corresponding position of the wireless sensor module with respect to the garment; and by way of the control module, automatically selecting, for each of the wireless sensor modules, based on the detected position of the wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding",
    "16. The method of claim 14, wherein the interaction between the first wireless sensor and the first wireless sensor interface comprises measurement of an impedance of a portion of the wireless sensor interface by way of the first wireless sensor module.",
    "17. The method of claim 14, further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module.",
    "18. The method of claim 15, further comprising combining, at the control module, two of the corresponding subsets of biometric signal outputs of two of the wireless sensor modules of the set of wireless sensor modules into a compound biometric signal.",
    "19. The method of claim 15, wherein transmitting the first subset of biometric signal outputs comprises transmitting an electromyography signal from the first wireless sensor module to the control module, and wherein the method further comprises;transmitting a motion signal from a wireless sensor module of the set of wireless sensor modules; andrendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time. transmitting a motion signal from a wireless sensor module of the set of wireless sensor modules; and rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time.",
    "20. The method of claim 14, further comprising at least one of recording, storing and processing the first subset of biometric signal outputs at the control module.",
    "21. The method of claim 14, wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, electrooculography signals, electrocardiography signals, and electromyography signals."
  ],
  "CTNFDocumentIdentifier": "J02UM6R4RXEAPX2",
  "CTNFBodyText": "The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA .\n\nDETAILED ACTION\nClaim Rejections - 35 USC ยง 103\nThe following is a quotation of 35 U.S.C. 103 which forms the basis for all obviousness rejections set forth in this Office action:\nA patent for a claimed invention may not be obtained, notwithstanding that the claimed invention is not identically disclosed as set forth in section 102, if the differences between the claimed invention and the prior art are such that the claimed invention as a whole would have been obvious before the effective filing date of the claimed invention to a person having ordinary skill in the art to which the claimed invention pertains. Patentability shall not be negated by the manner in which the invention was made.\n\nClaim(s) 1-2, 4-8, and 10-12 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Burich et al. (PGPub 2013/0041590).\n\tAs to claim 1, Balakrishnan discloses a biometric monitoring system, comprising: a set of wireless sensor interfaces coupled to a garment (Paragraph 36: sensors in garment), each of the set of wireless sensor interfaces comprising: 1) an electrode layer, configured for electrical contact with a user during operation, the electrode layer comprising a receiving region (Paragraph 39: electrode layer), 2) a positional identifier, associated with a position on the garment (Paragraph 83: identify location on apparel), and 3) a retention subsystem (Paragraph 82: sensors are attached or embedded); and comprising: a contact region electrically coupleable to the receiving region of the electrode layer of the corresponding wireless sensor interface (Paragraph 39: connection to the sensor system), a set of sensors configured to detect a set of  biometric signal types (Paragraph 25: bio-sensor), and a positional interrogator configured to identify, upon interacting with the positional identifier of the corresponding wireless sensor interface (Paragraph 83: position of sensors is determined), the position associated with the corresponding wireless sensor interface (Paragraph 83: position of sensors).\n\tBalakrishnan does not explicitly disclose a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces, and a control module, communicatively coupled to the set of wireless sensor modules, wherein, based upon a detected position of each of the set of wireless sensor modules, the control module queries a subset of the set of biometric signal types for transmission from each of the set of wireless sensor modules.\n\tEsposito discloses a control module, communicatively coupled to the set of wireless sensor modules, wherein, based upon a detected position of each of the set of wireless sensor modules (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body), the control module queries a subset of the set of biometric signal types for transmission from each of the set of wireless sensor modules (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan to use a subset of the sensors as taught by Esposito.\n The motivation for such a modification would be to increase the flexibility of the system by allowing the users to choose which parameters to monitor as well as saving power by not activating the sensors that are not of interest.\n\tBalakrishnan in view of Esposito does not explicitly disclose a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces.\n\tBurich discloses a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces (Paragraph 139 and 149: sensors are removably mounted and/or connected).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use a subset of the sensors as taught by Esposito.\nThe motivation for such a modification would be to increase the flexibility of the system by allowing the users to choose which parameters to monitor as well as saving power by not activating the sensors that are not of interest.\nAs to claim 2, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the electrode layer further comprises a signal communication region, the signal communication region including a set of conductive leads (Balakrishnan; Fig. 2A-B: connections with the sensors), at least a portion of each of the set of  conductive leads configured to electrically couple to the contact region of the corresponding wireless sensor module (Balakrishnan; Fig. 2A-B: connections with the sensors), and a set of biosensing contacts, coupled to the set of conductive leads of the signal communication region, the set of biosensing contacts composed of a conductive polymer (Balakrishnan; Paragraph 40: sensors use conductive polymer), at least a portion of each of the set of biosensing contacts disposed adjacent to and in electrical contact with a skin region of the user (Esposito; Paragraph 7: sensor sensing skin).\nAs to claim 4, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises a set of electronic circuit components which exhibit a known characteristic when an electrical current passes therethough, and wherein the positional interrogator is configured to induce the set of electrical components to exhibit the known characteristic thereof (Balakrishnan; Paragraph 80, 82-83: location memory signal).\nAs to claim 5, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises a wireless identification integrated circuit, and wherein the known characteristic comprises an encoded signal delivered by the wireless identification integrated circuit during operation (Balakrishnan; Paragraph 80, 82-83: location stored in memory).\nAs to claim 6, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises an integrated circuit, wherein the known characteristic comprises a unique identification code, and wherein the unique  identification code is read by the positional interrogator during operation (Balakrishnan; Paragraph 80, 82-83: location stored in memory).\nAs to claim 7, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the control module is electrically coupled to the garment at a control module interface (Balakrishnan; Fig. 4: electrically connected).\nAs to claim 8, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the control module further comprises a user input terminal and a user output display (Fig. 2, 4, Paragraph 24, 86: input devices and output display).\nAs to claim 10, Balakrishnan discloses a biometric monitoring system, comprising: a wireless sensor interface coupled to a garment (Paragraph 36: sensors in garment), comprising: 1) an electrode layer, configured for electrical contact with a user during operation, the first electrode layer comprising a receiving region (Paragraph 39: electrode layer), 2) a positional identifier, associated with a position on the garment (Paragraph 83: identify location on apparel), and comprising: a contact region coupleable to the receiving region of the first electrode layer (Paragraph 39: connection to the sensor system), a set of sensors configured to detect a set of biometric signal types (Paragraph 25: bio-sensor), and a positional interrogator configured to identify (Paragraph 83: position of sensors is determined), upon interacting with the positional identifier of the wireless sensor interface, the position associated with the wireless sensor interface (Paragraph 83: position of sensors); and a control module, communicatively coupled to the wireless sensor module (Fig. 1A: connected control module).\n Balakrishnan does not explicitly disclose 3) a retention subsystem; a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless sensor interface and wherein, based upon a detected position of the wireless sensor module, the control module queries a subset of the set of biometric signal types for transmission from the wireless sensor module. \nEsposito discloses wherein, based upon a detected position of the wireless sensor module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body), the control module queries a subset of the set of biometric signal types for transmission from the wireless sensor module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use removable attachments as taught by Burich.\nThe motivation for such a modification would be to increase the flexibility of the system by allowing the users to remove components of the system for maintenance.\n\tBalakrishnan in view of Esposito does not explicitly disclose 3) a retention subsystem; a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless sensor interface.\n\tBurich discloses 3) a retention subsystem; a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless  sensor interface (Paragraph 139 and 149: sensors are removably mounted and/or connected).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use removable attachments as taught by Burich.\nThe motivation for such a modification would be to increase the flexibility of the system by allowing the users to remove components of the system for maintenance.\nAs to claim 11, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the retention subsystem comprises a mount, embedded in the garment, configured to receive and removably couple to an external surface of the wireless sensor module (Burich; Paragraph 136: interfaces on the fabric for electrical connections with other components).\nAs to claim 12, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises at least one passive electronic component, and wherein the positional interrogator is configured to induce the passive electronic component to exhibit a known characteristic during operation (Balakrishnan; Paragraph 79: passive memory).\n\t\nClaim(s) 3 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Burich et al. (PGPub 2013/0041590) and in further view of Ives (PGPub 2015/0100135).\n As to claim 3, Balakrishnan in view of Esposito and in further view of Burich does not explicitly disclose wherein the retention subsystem comprises a fabric layer covering the electrode layer and fixed to the garment at a portion of a periphery of the fabric layer, the retention subsystem thereby configured to form a pocket comprising an opening.\nIves discloses wherein the retention subsystem comprises a fabric layer covering the electrode layer and fixed to the garment at a portion of a periphery of the fabric layer, the retention subsystem thereby configured to form a pocket comprising an opening (Paragraph 45: fabric pockets for sensors).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito and in further view of Burich to also use a fabric pocket as taught by Ives.\nThe motivation for such a modification would be to allow for a secure attachment of the sensors.\n\nClaim(s) 9 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Burich et al. (PGPub 2013/0041590) and in further view of Ataee et al. (PGPub 2015/0109202).\nAs to claim 9, Balakrishnan in view of Esposito and in further view of Burich discloses wherein a first wireless sensor module of the set of wireless sensor modules is positioned proximal a heart region of the user (Paragraph 16: shirt and torso  areas), a second wireless sensor module is positioned proximal a quadriceps region of the user (Paragraph 16: trousers and underwear areas), the subset of biometric signal types of the first wireless sensor module queried by the control module comprises a heart rate signal type (Paragraph 9: heart rate).\nBalakrishnan in view of Esposito and in further view of Burich does not explicitly disclose the subset of biometric signal types of the second wireless sensor module queried by the control module comprises an electromyography signal type.\n\tAtaee discloses the subset of biometric signal types of the second wireless sensor module queried by the control module comprises an electromyography signal type (Paragraph 13: EMG signals).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to also monitor EMG as taught by Ataee.\nThe motivation for such a modification would be to increase the robustness of the system allowing it to be applicable many different applications (Ataee; Paragraph 9).\n\nClaim(s) 13 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Burich et al. (PGPub 2013/0041590) and in further view of Farell et al. (PGPub 2007/0299325).\n\nnumber='10'As to claim 13, Balakrishnan in view of Esposito and in further view of Berg does not explicitly disclose wherein the contact region of at least one wireless sensor module includes an array of raised surfaces, at least a first of the array of raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface, and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface.\n\tFarell discloses wherein the contact region of at least one wireless sensor module includes an array of raised surfaces (Fig. 16A-C, Paragraph 88-90: array of pin connectors or snap connectors), at least a first of the array of raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface (Fig. 16A-C, Paragraph 88-90: the components are mated), and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface (Paragraph 93: position detector connected to pins).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito and in further view of Burich to also use pins as taught by Farell.\nThe motivation for such a modification would be to allow the user to easily connect and disconnect the connections amongst the different components.\n\nClaim(s) 14-16, 18, and 20 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071).\nAs to claim 14, Balakrishnan discloses a method for monitoring a biometric signal of a user (Paragraph 95: biometric information), comprising: at a first wireless sensor module (Paragraph 36: sensors in garment), detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment (Paragraph 83: identify location on apparel). \n\tBalakrishnan does not explicitly disclose by way of at least one of the first wireless sensor module and a control module automatically selecting, based on the first position of the first wireless sensor module, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module; from the first wireless sensor module, transmitting the first subset of biometric signal outputs to the control module. \n\tEsposito discloses by way of at least one of the first wireless sensor module and a control module automatically selecting, based on the first position of the first wireless sensor module, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body); from the first wireless sensor module, transmitting the first subset of biometric signal outputs to number='11'the control module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body). \nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan to use a subset of the sensors as taught by Esposito.\nThe motivation for such a modification would be to increase the flexibility of the system by allowing the users to choose which parameters to monitor as well as saving power by not activating the sensors that are not of interest.\n\tAs to claim 15, Balakrishnan in view of Esposito discloses further comprising: providing a set of wireless sensor modules, each at a corresponding wireless sensor interface of the garment (Balakrishnan; Paragraph 7 and 83: each location has an identifier and interface); detecting, at each wireless sensor module of the set of wireless sensor modules, a corresponding position of each wireless sensor module with respect to the garment, based on an interaction between each wireless sensor module and the corresponding wireless sensor interface (Balakrishnan; Paragraph 7 and 83: each location has an identifier), and by way of the control module, automatically selecting, based on the detected corresponding position of each wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding set of biometric signal outputs of each wireless sensor module (Esposito; Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body).\nnumber='12'As to claim 16, Balakrishnan in view of Esposito discloses wherein the interaction between the first wireless sensor and the first wireless sensor interface comprises measurement of the impedance of a portion of the wireless sensor interface by way of the first wireless sensor module (Balakrishnan; Paragraph 39: measuring resistance, Esposito; Paragraph 9: measure resistance).\nAs to claim 18, Balakrishnan in view of Esposito discloses further comprising combining, at the control module, two of the corresponding subsets of biometric signal outputs of two of the wireless sensor modules of the set of wireless sensor modules into a compound biometric signal (Balakrishnan; Paragraph 25: combining data from multiple sensors).\nAs to claim 20, Balakrishnan in view of Esposito discloses further comprising at least one of recording, storing and processing the first subset of biometric signal outputs at the control module (Balakrishnan; Paragraph 74-75: data is stored).\n\nClaim(s) 17 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Crockford (PGPub 2013/0245480).\nAs to claim 17, Balakrishnan in view of Esposito does not explicitly disclose further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module.\nnumber='13'Crockford discloses further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module (Paragraph 7, Claim 48: choosing from different sets of sensors based on quality).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use a quality metric as taught by Crockford.\nThe motivation for such a modification would be to ensure the best accuracy of the sensors possible.\n\nClaim(s) 19 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Banerji et al. (PGPub 2014/0200432).\nAs to claim 19, Balakrishnan in view of Esposito discloses using motion signals for determining muscle activity (Balakrishnan; Paragraph 25: motion signals).\nBalakrishnan in view of Esposito does not explicitly disclose wherein transmitting comprises transmitting, from a first subset of the set of wireless sensor modules, an electromyography signal; and wherein the method further comprises rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time.\nnumber='14'\tBanerji discloses wherein transmitting comprises transmitting, from a first subset of the set of wireless sensor modules, an electromyography signal (Paragraph 106: EMG signals); transmitting, from a second subset of the set of wireless sensor modules, a motion signal (Paragraph 106: motion sensors); and wherein the method further comprises rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time (Paragraph 106 and 193: muscle activity display).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to have a graphic display as taught by Berg.\nThe motivation for such a modification would be to allow the user to visualize the extent of the bodyโs current state.\n\nClaim(s) 21 is/are rejected under 35 U.S.C. 103 as being unpatentable over Balakrishnan et al. (PGPub 2014/0278125) in view of Esposito et al. (PGPub 2013/0192071) and in further view of Ataee et al. (PGPub 2015/0109202).\nAs to claim 21, Balakrishnan in view of Esposito does not explicitly disclose wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, electrooculography signals, electrocardiography signals, and electromyography signals.\n\tAtaee discloses wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, number='15'electrooculography signals, electrocardiography signals, and electromyography signals (Paragraph 13: EMG signals).\nTherefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to also monitor EMG as taught by Ataee.\nThe motivation for such a modification would be to increase the robustness of the system allowing it to be applicable many different applications (Ataee; Paragraph 9).\n\nConclusion\n",
  "NOABodyText": "CNTA  14/937,767  NOA  86619  2683    15-10-aia AIA 07-03-aia The present application, filed on or after March 16, 2013, is being examined under the first inventor to file provisions of the AIA.   REASONS FOR ALLOWANCE  13-03 AIA The following is an examinerโs statement of reasons for allowance:  Balakrishnan et al. (PGPub 2014/0278125), Burich et al. (PGPub 2013/0041590), and Jayalath et al. (PGPub 2017/0035354) is considered to be the closest prior art to the claimed invention.  Balakrishnan, Burich, and Jayalath does not disclose selecting the set of sensor signal types based on the detected position of the wireless sensor interface .   Any comments considered necessary by applicant must be submitted no later than the payment of the issue fee and, to avoid processing delays, should preferably accompany the issue fee.  Such submissions should be clearly labeled โComments on Statement of Reasons for Allowance.โ   Conclusion  Any inquiry concerning this communication or earlier communications from the examiner should be directed to Kevin Lau whose telephone number is (571)270-7329.  The examiner can normally be reached on Monday - Friday, 8:30 AM - 5:00 PM.  Examiner interviews are available via telephone, in-person, and video conferencing using a USPTO supplied web-based collaboration tool. To schedule an interview, applicant is encouraged to use the USPTO Automated Interview Request (AIR) at http://www.uspto.gov/interviewpractice.  If attempts to reach the examiner by telephone are unsuccessful, the examinerโs supervisor, Brian Zimmerman can be reached on (571) 272-3059.  The fax phone number for the organization where this application or proceeding is assigned is 571-273-8300.  Information regarding the status of an application may be obtained from the Patent Application Information Retrieval (PAIR) system.  Status information for published applications may be obtained from either Private PAIR or Public PAIR.  Status information for unpublished applications is available through Private PAIR only.  For more information about the PAIR system, see http://pair-direct.uspto.gov. Should you have questions on access to the Private PAIR system, contact the Electronic Business Center (EBC) at 866-217-9197 (toll-free). If you would like assistance from a USPTO Customer Service Representative or access to the automated information system, call 800-786-9199 (IN USA OR CANADA) or 571-272-1000.       /K. L./  Examiner, Art Unit 2683    /BRIAN ZIMMERMAN/  Supervisory Patent Examiner, Art Unit 2683     Application/Control Number:  14/937,767  Page 2    Art Unit:  2683          Application/Control Number:  14/937,767  Page 3    Art Unit:  2683",
  "applicationNumber": "14937767",
  "patentsCitedByExaminer": [
    {
      "referenceIdentifier": "20130192071",
      "abstract": "Sensing devices including flexible and stretchable fabric-based pressure sensors, may be associated with or incorporated in garments intended to be worn against a body surface (directly or indirectly), or may be associated with other types of flexible substrates, such as sheet-like materials, bandages and other materials that contact the body (directly or indirectly), and may be provided as independently positionable sensor components. Systems and methods for storing, communicating, processing, analyzing and displaying data collected by sensor components for remote monitoring of conditions at body surfaces, or within the body, are also disclosed. Sensors and sensor systems provide substantially real-time feedback relating to current body conditions and may provide notifications or alerts to users, caretakers and/or clinicians, enabling early intervention when conditions indicate intervention is appropriate.",
      "claims": [
        "1. A sensing device comprising an electrically conductive sensor;\nat least two electrically conductive leads connected to the sensor;\nat least one electrically conductive trace connected to each of the conductive leads; and\nat least one signal transfer terminal electrically connected to each of the conductive traces;\nwherein the sensor, the conductive leads, the conductive traces, and the signal transfer terminals are associated with a flexible, non-electrically conductive substrate.",
        "2. The sensing device of claim 1, wherein the conductive sensor comprises an electrically conductive fabric.",
        "3. The sensing device of claim 2, additionally comprising at least one additional non-fabric sensor.",
        "4. The sensing device of claim 1, wherein the conductive sensor is capable of sensing force exerted on the sensor.",
        "5. The sensing device of claim 1, wherein the sensor is non-silicon-based.",
        "6. The sensing device of claim 1, wherein the sensor comprises a flexible fabric having a conductive coating.",
        "7. The sensing device of claim 6, wherein the flexible fabric is additionally stretchable.",
        "8. The sensing device of claim 1, wherein the sensor, each of the conductive leads, and each of the conductive traces comprise an electrically conductive fabric.",
        "9. The sensing device of claim 1, wherein the non-electrically conductive substrate is in the form factor of a wearable garment.",
        "10. The sensing device of claim 9, wherein the non-electrically conductive substrate is in the form factor of a sock.",
        "11. The sensing device of claim 1, wherein the non-electrically conductive substrate is in the form factor of an insole.",
        "12. The sensing device of claim 1, wherein the non-electrically conductive substrate is in the form factor of a bandage or wound dressing.",
        "13. The sensing device of claim 1, comprising at least one sensor capable of sensing moisture and/or temperature.",
        "14. The sensing device of claim 2, wherein the conductive traces comprise conductive fabric having different properties than the conductive fabric sensor.",
        "15. The sensing device of claim 1, wherein the signal transfer terminals comprise one part of a mating two-part mechanical fastener device.",
        "16. The sensing device of claim 15, wherein the signal transfer terminals incorporate a magnetic component.",
        "17. The sensing device of claim 1, additionally comprising a substantially liquid impervious barrier enclosing at least the electrically conductive sensor and each of the electrically conductive leads.",
        "18. The sensing device of claim 1 in combination with a dedicated electronic device having signal receipt terminals that mate with signal transfer terminals of the sensing device and additionally comprising a housing component with signal processing and communications components located within the housing component.",
        "19. The combination of claim 18, wherein the housing component of the dedicated electronic device is in the form of a curved housing configured to fit partially around the lower leg or ankle of a user.",
        "20. The combination of claim 18, wherein the housing component of the dedicated electronic device is configures as a shin guard.",
        "21. A system for data collection and remote monitoring of conditions at or near a body surface, comprising:\nat least one electrically conductive sensing device configured for positioning in direct or indirect contact with a portion of a user's body surface and having signal transfer terminals associated with a flexible, non-conductive substrate;\na dedicated electronic device having signal processing and communications components and signal receipt terminals that receive signals from the signal transfer terminals of the sensing device; and\na remote computing facility configured to receive data from the dedicated electronic device and execute data analysis in accordance with programmed and/or programmable instructions and routines.",
        "22. A method for collecting data and remotely monitoring conditions at or near body surfaces, comprising:\nplacing an electrically conductive sensor of an independently positionable sensing device comprising a flexible, electrically conductive sensor, at least two flexible, electrically conductive leads connected to the sensor, at least one flexible, electrically conductive trace connected to each of the conductive leads, and at least one signal transfer terminal electrically connected to each of the flexible, conductive traces at a location at or near a body surface desired to be monitored;\npositioning each of the signal transfer terminals at a location remote from the sensor;\ncovering the location at or near the body surface where the sensor is placed and allowing each of the signal transfer terminals to remain exposed and uncovered by the covering; and\ntransferring signals and/or data from the signal transfer terminals to a dedicated electronic device that communicates with an external, hosted computing system.",
        "23. A method for fitting footwear to a user's feet, comprising:\nplacing an electrically conductive sensor of a sensing device comprising a flexible, electrically conductive sensor, at least two flexible, electrically conductive leads connected to the sensor, at least one flexible, electrically conductive trace connected to each of the conductive leads, and at least one signal transfer terminal electrically connected to each of the flexible, conductive traces at a location at or near an area of the user's foot;\nplacing footwear on the user's foot and thereby locating the sensor between the user's foot and the footwear;\ncollecting data relating to sensed conditions while the user wears the footwear;\naugmenting collected data with user information; and\nproviding user-specific recommendations for footwear that fits the anatomy of the user's foot."
      ],
      "title": "SENSORS, INTERFACES AND SENSOR SYSTEMS FOR DATA COLLECTION AND INTEGRATED REMOTE MONITORING OF CONDITIONS AT OR NEAR BODY SURFACES"
    },
    {
      "referenceIdentifier": "20070299325",
      "abstract": "A physiological status monitoring system includes a shirt and a stretchable circumferential band attached to the shirt. The stretchable band includes a respiration detector subsystem and signal transmission conductors. One or more sensors on the band are electrically connected to a signal transmission conductor. At least one sensor has an exposed electrode inside the shirt. The system includes a cover over the band and/or the one or more sensors. A connection subsystem on the band is electrically connected to the respiration detector subsystem and the signal transmission conductors and includes signal traces therefrom to a first connector accessible from outside the shirt. An electronics module is releasably attached to the shirt and includes a second connector which mates with the first connector. The electronics module includes a processing system and a transmitter. The remote display unit includes a receiver, a display, and a processing system.",
      "claims": [
        "1. A physiological status monitoring system comprising:\na shirt;\na stretchable circumferential band attached to the shirt, the stretchable band including:\na respiration detector subsystem integral with the band, and signal transmission conductors also integral with the band and in a flexible configuration;\none or more sensors on the band each electrically connected to a signal transmission conductor, at least one sensor having an electrode exposed inside the shirt;\na cover over the band and/or the one or more sensors;\na connection subsystem on the band electrically connected to said respiration detector subsystem and said signal transmission conductors and including signal traces therefrom to a first connector accessible from outside the shirt;\nan electronics module releasably attached to the shirt including a second connector which mates with the first connector, the electronics module including:\na processing system for processing signals from the respiration detector subsystem and the signal transmission conductors, and a transmitter for wirelessly transmitting the processed signals; and\na remote display unit including:\na receiver which receives said transmitted processed signals, a display, and a processing system for displaying said received processed signals on said display.",
        "2. The system of claim 1 in which the electronics module includes a receiver for receiving communications from the remote display unit.",
        "3. The system of claim 1 in which said shirt is made of Lycra material.",
        "4. The system of claim 1 in which the shirt includes fabric having fibers of variable loft and thickness.",
        "5. The system of claim 1 in which said respiration detector subsystem includes in-plane circumferential conductors integral with said stretchable band.",
        "6. The system of claim 5 in which the in-plane circumferential conductors are in a sinusoidal configuration.",
        "7. The system of claim 6 including a pair of adjacent in-plane nested circumferential conductors integral with said stretchable band.",
        "8. The system of claim 7 in which the electronics module includes a circuit which detects changes in capacitance as the adjacent nested circumferential conductors move away from and towards each other as the stretchable band expands and contracts.",
        "9. The system of claim 5 in which the electronics module includes a circuit which detects changes in inductance as the circumferential conductors move as the stretchable band expands and contracts.",
        "10. The system of claim 1 in which the signal transmission conductors are sinusoidal and circumferential.",
        "11. The system of claim 1 in which the signal transmission conductors are sinusoidal.",
        "12. The system of claim 1 in which the at least one sensor exposed electrode is made of conductive fabric.",
        "13. The system of claim 12 in which there are one or more foam layers behind the conductive fabric to promote contact of the conductive fabric with skin.",
        "14. The system of claim 13 further including a fabric over and behind the one or more foam layers and attached to the stretchable band and the shirt.",
        "15. The system of claim 13 in which the one or more foam layers are water impenetrable to promote the conductivity of the conductive fabric.",
        "16. The system of claim 12 further including a conductive fastener through the conductive fabric and connected to a conductor coupled to a signal transmission conductor in the band.",
        "17. The system of claim 1 in which one said sensor includes a thermistor coupled to the band and having a conductor coupled to a signal transmission conductor.",
        "18. The system of claim 17 in which a side of the thermistor not in contact with a wearer is insulated.",
        "19. The system of claim 1 in which the cover is an outer cover.",
        "20. The system of claim 19 in which the outer cover is made of fabric.",
        "21. The system of claim 20 in which said outer cover fabric is the same as the shirt fabric.",
        "22. The system of claim 1 in which the connection subsystem is an insulation displacement connector.",
        "23. The system of claim 1 in which the connection subsystem is a circuit board.",
        "24. The system of claim 23 in which said circuit board is rigid.",
        "25. The system of claim 23 in which said circuit board is a flex circuit.",
        "26. The system of claim 1 in which said first connector is a Lemo connector.",
        "27. The system of claim 1 in which said first connector is a pin connector.",
        "28. The system of claim 1 in which said connection subsystem is encapsulated by a sealant.",
        "29. The system of claim 1 in which said transmitter is configured according to the Bluetooth standard and the remote display unit is a hand held electronic device.",
        "30. The system of claim 29 in which said hand held device is a personal digital assistant.",
        "31. The system of claim 1 further including a portal accessible over a network responsive to the remote display unit to display and log said processed signals.",
        "32. The system of claim 31 in which said portal is a website.",
        "33. The system of claim 1 in which said electronics module further includes a position detection subsystem.",
        "34. The system of claim 33 in which the position detection subsystem is a GPS subsystem.",
        "35. The system of claim 1 further including a position detection subsystem separate from but in communication with said electronics module.",
        "36. The system of claim 1 in which said electronics module further includes a motion detector.",
        "37. The system of claim 36 in which said motion detector is an accelerometer.",
        "38. The system of claim 1 in which said electronics module includes a display for displaying said processed signals.",
        "39. The system of claim 1 further including one of a hook and loop fastener on the shirt and the other of the hook and loop fastener on the electronics module for releasably attaching the electronics module to the shirt.",
        "40. The system of claim 1 further including snap connectors for releasably attaching the electronics module to the shirt:\n",
        "41. The system of claim 1 further including magnetic connectors for releasably attaching the electronics module to the shirt.",
        "42. The system of claim 41 in which the magnetic connectors provide electrical connectivity between the shirt and the electronics module.",
        "43. The system of claim 1 in which the processing system of the electronics module or the remote display unit includes a rules set including a rule which signals from the respiration detector subsystem are not transmitted if they indicate a breathing rate higher than possible by a subject wearing the shirt.",
        "44. The system of claim 1 in which the one or more sensors on the band includes electrocardiogram sensors located on opposite sides of the band and positioned to form a line across a wearer's heart.",
        "45. The system of claim 1 in which the shirt is made of loose fitting material and includes an inner liner attached to the loose fitting material.",
        "46. The system of claim 45 in which the inner liner extends to each edge of the loose fitting material.",
        "47. The system of claim 45 in which the inner liner extends from select edges of the loose fitting material to the stretchable circumferential band.",
        "48. The system of claim 45 in which the inner liner is attached to the loose fitting material by connecting material segments.",
        "49. The system of claim 45 in which the loose fitting material includes at least one opening therein for releasable attachment of the electronics module to the shirt.",
        "50. The system of claim 45 in which the stretchable circumferential band is included in the inner liner.",
        "51. A physiological status monitoring system comprising:\na garment;\na stretchable band attached to or integral with the garment, the stretchable band including:\nconductors integral with the band forming a respiration detector, and at least one signal transmission conductor also integral with the band;\nat least one sensor electrically connected to the signal transmission conductor; and\nan electronics module responsive to the conductors and the signal transmission conductor, the electronics module including:\na circuit which detects changes in impedance as geometry of the conductors changes as the stretchable band expands and contracts, and a transmitter responsive to the circuit and to signals transmitted from said sensor for wirelessly transmitting respiration and sensor signals.",
        "52. The system of claim 51 further including an outside cover over the band.",
        "53. The system of claim 51 further including a connection subsystem on the band electrically connected to said conductors and to said signal transmission conductor and including signal traces therefrom to a first connector accessible from outside the garment.",
        "54. The system of claim 53 in which the electronics module includes a second connector which mates with the first connector.",
        "55. The system of claim 51 in which the electronics module further includes a processing system for processing signals from the circuit and the signal transmission conductor.",
        "56. The system of claim 51 in which the conductors are in a sinusoidal configuration.",
        "57. The system of claim 56 in which the at least one signal transmission conductor is in a sinusoidal configuration.",
        "58. The system of claim 51 in which the conductors include a pair of adjacent nested conductors.",
        "59. The system of claim 55 further including a remote display unit comprising:\na receiver which receives signals from the transmitter, a display, and a processing system for displaying said received signals on said display.",
        "60. The system of claim 59 in which the electronics module includes a receiver which is responsive to the remote display unit and to signals transmitted from said remote display unit for receiving communications from the remote display unit.",
        "61. The system of claim 51 in which said garment is made of Lycra material.",
        "62. The system of claim 51 in which the garment includes fabric having fibers of variable loft and thickness.",
        "63. The system of claim 51 in which said band is circumferential and said conductors are in-plane.",
        "64. The system of claim 51 in which the at least one sensor includes an exposed electrode made of conductive fabric.",
        "65. The system of claim 64 in which there are one or more foam layers behind the conductive fabric to promote contact of the conductive fabric with skin.",
        "66. The system of claim 65 further including fabric over and behind the one or more foam layers and attached to the stretchable band.",
        "67. The system of claim 66 in which the one or more foam layers are water impenetrable to promote the conductivity of the conductive fabric.",
        "68. The system of claim 64 further including a conductive fastener through the conductive fabric and connected to a conductor coupled to a signal transmission conductor in the band.",
        "69. The system of claim 51 in which one said sensor includes a thermistor coupled to the band and having a conductor coupled to a signal transmission conductor.",
        "70. The system of claim 69 in which a side of the thermistor not in contact with a wearer is insulated.",
        "71. The system of claim 53 in which the connection subsystem is an insulated displacement connector.",
        "72. The system of claim 53 in which the connection subsystem is a circuit board.",
        "73. The system of claim 72 in which said circuit board is rigid.",
        "74. The system of claim 72 in which said circuit board is a flex circuit.",
        "75. The system of claim 53 in which said first connector is a Lemo connector.",
        "76. The system of claim 53 in which said first connector is a pin connector.",
        "77. The system of claim 51 in which said electronics module further includes a position detection subsystem.",
        "78. The system of claim 77 in which the position detection subsystem is a GPS subsystem.",
        "79. The system of claim 51 further including a position detection subsystem separate from but in communication with said electronics module.",
        "80. The system of claim 51 in which said electronics module further includes a motion detector.",
        "81. The system of claim 80 in which said motion detector is an accelerometer.",
        "82. The system of claim 51 in which said electronics module includes a display for displaying said respiration and sensor signals.",
        "83. The system of claim 51 further including one of a hook and loop fastener on the garment and the other of the hook and loop fastener on the electronics module for releasably attaching the electronics module to the garment.",
        "84. The system of claim 51 further including snap connectors for releasably attaching the electronics module to the garment.",
        "85. The system of claim 51 further including magnetic connectors for releasably attaching the electronics module to the garment.",
        "86. The system of claim 85 in which the magnetic connectors provide electrical connectivity between the garment and the electronics module.",
        "87. The system of claim 51 further including a processing system including a rules set including a rule in which signals from the respiration detector are not transmitted if they indicate a breathing rate higher than possible by a subject wearing the garment.",
        "88. The system of claim 51 further including electrocardiogram sensors on the stretchable band located on opposite sides of the band and positioned to form a line across a wearer's heart.",
        "89. The system of claim 51 in which the garment is made of loose fitting material and includes an inner liner attached to the loose fitting material.",
        "90. The system of claim 89 in which the inner liner extends to each edge of the loose fitting material.",
        "91. The system of claim 89 in which the inner liner extends from select edges of the loose fitting material to the stretchable circumferential band.",
        "92. The system of claim 88 in which the inner liner is attached to the loose fitting material by connecting material segments.",
        "93. The system of claim 88 in which the loose fitting material includes at least one opening therein for releasable attachment of the electronics module to the garment.",
        "94. The system of claim 89 in which the stretchable band is included in the inner liner.",
        "95. A physiological status monitoring system comprising:\na stretchable circumferential band including:\na respiration detector subsystem integral with the band, and signal transmission conductors also integral with the band and in a flexible configuration;\none or more sensors on the band and electrically connected to a signal transmission conductor, at least one sensor having an exposed electrode;\na connection subsystem on the band electrically connected to said respiration detector subsystem and the signal transmission conductors and including signal traces therefrom to a first connector; and\nan electronics module with a second connector which mates with the first connector, the electronics module including:\na processing system for processing signals from the respiration detector subsystem and the signal transmission conductors, and a transmitter for wirelessly transmitting the processed signals."
      ],
      "title": "Physiological status monitoring system"
    },
    {
      "referenceIdentifier": "20150100135",
      "abstract": "A system includes a plurality of conformal sensors and a central controller. Each conformal sensor includes a processing portion and an electrode portion. The electrode portion is configured to substantially conform to a portion of an outer skin surface of a subject and to sense electrical pulses generated by muscle tissue of the subject. The sensed electrical pulses are transmitted from the electrode portion to the processing portion as raw analog signals for onboard processing thereof by the processing portion of the conformal sensor. The processing portion is configured to create digital signals representative of the raw analog signals. The central controller is coupled to each of the plurality of conformal sensors and is configured to receive the digital signals from each of the plurality of conformal sensors.",
      "claims": [
        "1. A system comprising:\na plurality of conformal sensors, each conformal sensor including a processing portion and an electrode portion, the electrode portion being configured to substantially conform to a portion of an outer skin surface of a subject and to sense electrical pulses generated by muscle tissue of the subject, the sensed electrical pulses being transmitted from the electrode portion to the processing portion as raw analog signals for onboard processing thereof by the processing portion of the conformal sensor, the processing portion being configured to create digital signals representative of the raw analog signals; and\na central controller coupled to each of the plurality of conformal sensors and being configured to receive the digital signals from each of the plurality of conformal sensors.",
        "2. The system of claim 1, wherein the central controller is further configured to compare the received digital signals with physiological templates to determine a physiological status of the subject.",
        "3. The system of claim 2, wherein the central controller is further configured to actuate an exoskeleton worn by the subject at various levels of power based on the determined physiological status of the subject.",
        "4. The system of claim 3, wherein the various levels of power include a zero power level, a ten percent power level, a fifty percent power level, a one hundred percent power level, or any other power level in between.",
        "5. A system for monitoring physiological performance of a mammal, the system comprising:\na plurality of conformal sensors, each conformal sensor including a processing portion and an electrode portion, the electrode portion being configured to substantially conform to a portion of an outer skin surface of the mammal and to sense electrical pulses generated by muscle tissue of the mammal, the sensed electrical pulses being transmitted from the electrode portion to the processing portion as raw analog signals for onboard processing thereof by the processing portion of the conformal sensor, the processing portion being configured to create digital signals representative of the raw analog signals; and\na central controller coupled to at least each of the plurality of conformal sensors, the central controller being configurable to:\n(i) receive the digital signals from each of the plurality of conformal sensors;\n(ii) compare the received digital signals with physiological templates stored in a memory device accessible by the central controller to determine a physiological status for the mammal; and\n(iii) based on the determined physiological status, the central controller causing an action to occur within the system.",
        "6. The system of claim 5, wherein the plurality of conformal sensors are electromyography sensors.",
        "7. The system of claim 5, wherein one or more of the plurality of conformal sensors includes a hard-wired connection to the central controller such that at least some of the electrical signals are received by the central controller via the hard-wired connection.",
        "8. The system of claim 5, wherein one or more of the plurality of conformal sensors are wirelessly connected to the central controller such that at least some of the electrical signals are received by the central controller via the wireless connection.",
        "9. The system of claim 5, wherein one or more of the plurality of conformal sensors are positioned on the outer surface of the mammal adjacent to different muscles.",
        "10. The system of claim 9, wherein the different muscles include the quadriceps muscles, the hamstring muscles, the calf muscles, the biceps muscles, the triceps muscles, or any combination thereof.",
        "11. The system of claim 5, wherein one or more of the plurality of conformal sensors are integral with a stretchable layer of fabric material worn by the mammal such that the conformal sensor device is positioned adjacent to the outer skin surface of the mammal.",
        "12. The system of claim 5, wherein the plurality of conformal sensors are stretchable and bendable.",
        "13. A system for monitoring physiological performance of a subject, the system comprising:\na plurality of conformal sensors, each conformal sensor including an electrode for monitoring muscle tissue activity of the subject by measuring analog electrical signals output by the muscle tissue that are indicative of muscle tissue movement, the analog signal being received by a processor chip within each of the plurality of conformal sensors, the processor chip configured to digitize and filter noise from the analog signal to generate a digital representation of the muscle tissue being monitored, the generated digital representation being stored in at least one first memory; and\na central processing unit communicatively coupled with the processor chip of each of the plurality of conformal sensors, the central processing unit including at least one second memory for storing instructions executable by the central processing unit to cause the central processing unit to:\na) receive the generated digital representations from each of the processor chips of the plurality of conformal sensors;\nb) access physiological profiles stored on the at least one second memory or the at least one first memory; and\nc) compare the generated digital representations to the physiological profiles to determine a physiological status of the subject.",
        "14. The system of claim 13, wherein the plurality of conformal sensors includes stretchable processing sensors, each conformal sensor substantially conforming to a portion of an outer surface of the mammal.",
        "15. The system of claim 13, wherein each of the plurality of conformal sensors is an electromyography sensor.",
        "16. The system of claim 13, wherein one or more of the plurality of conformal sensors includes a hard-wired connection to the central processing unit such that at least some of the generated digital representations are received by the central processing unit via the hard-wired connection.",
        "17. The system of claim 13, wherein one or more of the plurality of conformal sensors are wirelessly connected to the central processing unit such that at least some of the generated digital representations are received by the central processing unit via the wireless connection.",
        "18. The system of claim 13, wherein the physiological profiles are stored in a library of physiological profiles stored in the at least one second memory, the at least one first memory, or both.",
        "19. The system of claim 13, wherein the physiological status of the subject indicates that the subject is walking, running, climbing, or crawling.",
        "20. The system of claim 13, wherein the physiological status of the subject indicates that the subject is exhausted, injured, has a dangerously high heart rate, has a dangerously high core body temperature, performing as expected, performing a specific function, or any combination thereof.",
        "21. The system of claim 13, wherein the instructions executable by the central processing unit further cause the central processing unit to transmit a signal from the central processing unit to mechanical components of utility gear worn by the subject in response to the comparison, the signal activating the utility gear to aid activity of the subject.",
        "22. The system of claim 21, wherein the mechanical components include an exoskeleton and the signal activate the exoskeleton to aid the subject's leg movement.",
        "23. The system of claim 13, wherein the physiological status is transmitted wirelessly by the central processing unit for receipt at a remote location.",
        "24. The system of claim 13, wherein one or more of the plurality of conformal sensors are integral with a layer of stretchable fabric material worn by the subject such that the conformal sensors are positioned adjacent to the outer skin surface of the subject.",
        "25. A system for monitoring physiological performance of a subject, the system comprising:\na physiological conformal sensor configured to conform to a portion of an outer skin surface of the subject and to create digital signals representative of physiological data sensed by the physiological sensor; and\na central controller coupled to the physiological conformal sensor, the central controller being configured to:\n(i) receive the digital signals from the physiological conformal sensor;\n(ii) determine a physiological stress index based on the received digital signals; and\n(iii) analyze the determined physiological stress index to determine if the subject is at risk or not at risk of reaching dangerous levels of stress.",
        "26. The system of claim 25, wherein in response to an at risk determination being made by the central controller, the central controller is caused to send an alert to the subject, to a third party, or both.",
        "27. The system of claim 25, wherein the physiological conformal sensor includes a heart rate sensor for sensing a heart rate of the subject and a core body temperature sensor for estimating a core body temperature of the subject.",
        "28. The system of claim 27, wherein at least a portion of the received digital signals is representative of the heart rate and the core body temperature of the subject.",
        "29. The system of claim 28, wherein the determined physiological stress index condition is transmitted wirelessly by the central controller to the third party.",
        "30. A system comprising:\na plurality of conformal sensors, at least a portion of each of the conformal sensors being configured to substantially conform to a portion of an outer skin surface of a subject and to sense a parameter of the subject and generate a parameter signal based on the sensed parameter; and\na central controller coupled to each of the plurality of conformal sensors and being configured to receive the parameter signals from each of the plurality of conformal sensors."
      ],
      "title": "UTILITY GEAR INCLUDING CONFORMAL SENSORS"
    },
    {
      "referenceIdentifier": "20130245480",
      "abstract": "An electrocardiographic device for sensing cardiac activity in a user, the electrocardiographic device comprising: plurality of electrodes provided at a surface of the device for electrical engagement with a pair of extremities of a user; one or more movement sensors arranged to, in use, detect movement of a user's extremities; and a control unit configured to receive electrical signals from the electrodes and to, in use, process said signals in dependence on the output of the one or more movement sensors so as to filter variations from the signals due to movement of the user's extremities.",
      "claims": [
        "1. An electrocardiographic device for sensing cardiac activity in a user, the electrocardiographic device comprising:\na plurality of electrodes provided at a surface of the device for electrical engagement with a pair of extremities of a user;\none or more movement sensors arranged to, in use, detect movement of a user's extremities; and\na control unit configured to receive electrical signals from the electrodes and to, in use, process said signals in dependence on the output of the one or more movement sensors so as to filter variations from the signals due to movement of the user's extremities.",
        "2. An electrocardiographic device as claimed in claim 1, wherein the plurality of electrodes comprises a first set of one or more electrodes for engagement with a first extremity of a user and a second set of one or more electrodes for engagement with a second extremity of a user, the first set of electrodes having an associated first movement sensor arranged to detect movement of the first extremity and the second set of electrodes having an associated second movement sensor arranged to detect movement of the second extremity, the control unit being configured to perform filtering of signals from the first and second sets of electrodes in dependence on the output from the respective movement sensor.",
        "3. An electrocardiographic device as claimed in claim 1, wherein said filtering comprises cancellation or suppression of features in electrical signals from the electrodes that are common to both the signals from the electrodes and the output of the one or more movement sensors.",
        "4. An electrocardiographic device as claimed in claim 1, wherein the control unit is configured to provide said filtered electrical signals at an output of the device.",
        "5. An electrocardiographic device as claimed in claim 1, wherein the output of the one or more movement sensors represents motion and/or vibration of the user's extremities.",
        "6. An electrocardiographic device as claimed in claim 1, wherein the one or more movement sensors include one or more of an accelerometer, a strain gauge, a microphone and a pressure sensor.",
        "7. An electrocardiographic device as claimed in claim 1, wherein the electrodes of the set are provided at two electrically insulating user interaction regions of the electrocardiographic device, each user interaction region being adapted for engagement with an extremity of a user.",
        "8. An electrocardiographic device as claimed in claim 7, wherein each user interaction region comprises a layer of shape memory foam for engagement with a user's extremity, the electrodes being provided at the shape memory foam.",
        "9. An electrocardiographic device as claimed in claim 7, wherein each user interaction region is supported on a floating plate elastically coupled to the body of the electrocardiographic device.",
        "10. An electrocardiographic device as claimed in claim 9, wherein each user interaction region is coupled to the body of the electrocardiographic device by a damping mechanism arranged to dissipate kinetic energy due to motion of the floating plate relative to the body of the electrocardiographic device.",
        "11. An electrocardiographic device as claimed in claim 9, wherein both user interaction regions are supported at the same floating plate.",
        "12. An electrocardiographic device as claimed in claim 9, wherein each floating plate is elastically coupled to the body of the electrocardiographic device by one or more of:\nelastic springs, resilient rubber or plastic members, and elastic foam.",
        "13. An electrocardiographic device as claimed in claim 1, wherein the set of electrodes of the device are provided for electrical engagement with the hands of a user and the device comprises a set of indicia indicating an intended position for a user's hands on the device, the set of electrodes being arranged relative to the set of indicia such that, in use when a user's hands are in the intended position, at least one electrode is located under the thenar eminence or the hypothenar eminence of each of the user's hands.",
        "14. An electrocardiographic device as claimed in claim 13, wherein the indicia comprise a graphical pair of hands indicating the intended position of a user's hands relative to the electrodes and/or indentations on the surface of the device indicating the intended position of a user's hands relative to the electrodes.",
        "15. An electrocardiographic device as claimed in claim 13, further comprising a second set of indicia indicating a second intended position of a user's hands with respect to the electrodes;\nwherein the electrodes are arranged relative to the second set of indicia such that, in use when a user's hands are in the second intended position, at least one electrode is located under the medial side of the hypothenar eminence of each of the user's hands.",
        "16. An electrocardiographic device as claimed in claim 13, wherein the set of electrodes of the device are provided for electrical engagement with the feet of a user and the device comprises a set of indicia indicating an intended position for a user's feet on the device, the set of electrodes being arranged relative to the set of indicia such that, in use when a user's feet are in the intended position, at least one electrode is located under the heel pad of each of the user's feet.",
        "17. An electrocardiographic device as claimed in claim 1, further comprising a display screen operable to display an electrocardiograph acquired by the electrodes.",
        "18. An electrocardiographic device as claimed in claim 1, wherein the electrocardiographic device is configured to be foldable along one or more folds such that, when folded, the device is operable to present at least one of the electrodes on each of two outward-facing surfaces of the device, the two outward-facing surfaces being separated by at least one fold.",
        "19. An electrocardiographic device as claimed in claim 18, wherein the electrocardiographic device is provided in the form of a book having one or more pages, at least one of the electrodes being provided at the front and rear inside covers of the book.",
        "20. An electrocardiographic device as claimed in claim 19, wherein the pages of the book provide instructions for use of the electrocardiographic device.",
        "21. An electrocardiographic device as claimed in claim 1, further comprising one or more inputs for receiving signals from wearable electrodes, the control unit being operable to combine said one or more inputs with the signals from the set of electrodes so as to form representations of one or more multi-lead ECGs.",
        "22. An electrocardiographic device as claimed in claim 21, wherein the inputs are wired or wireless inputs.",
        "23. An electrocardiographic system comprising:\na first electrocardiographic device as claimed in any preceding claims; and\na data processing unit configured to process signals from the electrodes of the first electrocardiographic device so as to form an electrocardiogram and/or diagnose cardiac abnormalities.",
        "24. An electrocardiographic system as claimed in claim 23, wherein the data processing unit is one or more of a personal computer, handheld computer, smartphone, server, or a processing unit of the electrocardiographic device itself.",
        "25. An electrocardiographic system as claimed in claim 23, wherein the electrocardiogram is a Lead I electrocardiogram.",
        "26. An electrocardiographic system as claimed in claim 23, wherein the electrocardiographic system further comprises one or more wearable biosensors and the data processing unit is further configured to process signals from the wearable biosensors so as to form an electrocardiogram in dependence on signals from both the wearable biosensors and the electrodes of the first electrocardiographic device.",
        "27. An electrocardiographic device as claimed in claim 26, wherein the wearable biosensors are electric potential sensors or conducting electrodes.",
        "28. An electrocardiographic system as claimed in claim 26, wherein the wearable biosensors are provided in clothing and/or as straps adapted for engagement with a limb or extremity of a user.",
        "29. An electrocardiographic system as claimed in claim 23, wherein the electrocardiographic system further comprises a second electrocardiographic device as claimed in any of claims 1 to 22, and the data processing unit is further configured to process signals from the electrodes of the second electrocardiographic device so as to form an electrocardiogram in dependence on signals from electrodes of both the first and second electrocardiographic devices.",
        "30. An electrocardiographic system as claimed in claim 29, wherein the electrocardiogram includes a Lead II and/or III electrocardiogram.",
        "31. An electrocardiographic system as claimed in claim 23, wherein the data processing unit is configured to characterise an electrocardiogram according to a predetermined set of cardiac parameters, including one or more of:\namplitude and duration of a detected QRS complex, ventricular activation time, relative amplitude and timings of the Q, R and S peaks, R-R interval, QT interval, P wave timing relative to the QRS complex, and T wave to P wave smoothness.",
        "32. An electrocardiographic system as claimed in claim 31, wherein the data processing unit is configured to diagnose cardiac abnormalities in dependence on the predetermined set of cardiac parameters.",
        "33. An electrocardiographic system as claimed in claim 32, wherein the data processing unit is configured to diagnose cardiac abnormalities in dependence on a comparison of the cardiac parameters of the electrocardiogram with a set of stored cardiac parameters.",
        "34. An electrocardiographic system as claimed in claim 23, wherein the data processing unit is configured to, on detecting one or more features indicative of cardiac abnormalities in the electrocardiogram, provide the electrocardiogram to a healthcare professional for further analysis and/or indicate to the user that the advice of a healthcare professional should be sought.",
        "35. An electrocardiographic system as claimed in claim 23, further comprising a data store accessible to the data processing unit, the data processing unit being configured to store the predetermined set of cardiac parameters at the data store and optionally a digital representation of signals from the electrodes along with, optionally, a digital representation of output(s) of the movement sensor(s).",
        "36. An electrocardiographic system as claimed in claim 23, wherein the data processing system is configured to instruct the user to connect at least one wearable biosensor and/or a second electrocardiographic device as claimed in any of claims 1 to 22 if one or more of the following is true:\none or more features characteristic of a cardiac abnormality are detected in the electrocardiogram;\nsignals from the electrodes of the first electrocardiographic device or the electrocardiogram itself includes characteristics indicative of a poor signal; and\none or more expected characteristics of cardiac activity are absent or only weakly present in the electrocardiogram.",
        "37. An electrocardiographic system as claimed in claim 36, wherein the expected characteristics of cardiac activity include a P wave.",
        "38. An electrocardiographic system as claimed in claim 36, wherein the data processing unit is configured to instruct the user by means of a display screen at the first electrocardiographic device.",
        "39. An electrocardiographic system as claimed in claim 23, wherein the first and second sets of electrodes of the first electrocardiographic device each comprise a plurality of electrodes and the data processing unit is configured to (i) form a measure of the quality of the differential signal from each pair of electrodes that includes one electrode from the first set and one electrode from the second set, and (ii) select that pair of electrodes that has the highest quality measure as the Lead I signal.",
        "40. An electrocardiographic system as claimed in claim 23, wherein the data processing system is configured to process signals from the electrodes in accordance with a QRS detection algorithm and, if the amplitude of the QRS complex is determined to exceed the noise floor by greater than a predetermined amount then a P wave algorithm is used for subsequent analysis of the electrocardiogram, otherwise an R-R interval algorithm is used for subsequent analysis of the electrocardiogram.",
        "41. Use of an electrocardiographic device as claimed in claim 1 to acquire an electromyogram of one or more muscles of a user.",
        "42. Use of an electrocardiographic system as claimed in claim 23 to acquire an electromyogram of one or more muscles of a user, the system including one or more wearable biosensors and the data processing system being configured to control apparatus for electrical stimulation of said one or more muscles.",
        "43. A method for acquiring an electrocardiogram by means of an electrocardiographic system comprising an electrocardiographic device having a plurality of electrodes adapted for engagement with a user, the method comprising:\ncapturing a representation of the cardiac activity of a user by means of the plurality of electrodes;\nat a data processing device of the electrocardiographic system, processing the representation of the cardiac activity so as to identify whether it includes characteristics indicative of a poor signal;\nif the processing step identifies characteristics indicative of a poor signal, indicating to the user by means of a display screen at the electrocardiographic device a preferred engagement of the user with the electrocardiographic device; and\nsubsequently, acquiring an electrocardiogram in dependence on signals from the electrodes of the electrocardiographic device.",
        "44. A method for acquiring an electrocardiogram by means of an electrocardiographic system comprising a first electrocardiographic device having a plurality of electrodes adapted for engagement with a pair of hands, the method comprising:\ncapturing a representation of the cardiac activity of a user by means of the plurality of electrodes;\nat a data processing device of the electrocardiographic system, comparing the representation of the cardiac activity of the user with a set of predetermined characteristics of cardiac activity and identifying whether one or more of the following conditions is true:\none or more characteristics indicative of a cardiac abnormality are present in the representation of the cardiac activity;\nthe representation of the cardiac activity includes characteristics indicative of a poor signal; and\none or more expected characteristics are absent or only weakly present in the representation of the cardiac activity;\nin response to identifying that one or more of the conditions is true, indicating to the user to connect into the electrocardiographic system one or more wearable electrodes and/or a second electrocardiographic device having a plurality of electrodes adapted for engagement with a pair of feet; and\nacquiring an electrocardiogram in dependence on signals from the electrodes of the first electrocardiographic device and the one or more wearable electrodes and/or the second electrocardiographic device.",
        "45. A method as claimed in claim 44, wherein the characteristics indicative of a poor signal include a predetermined noise level.",
        "46. A method as claimed in claim 44, wherein the expected characteristics include a P wave.",
        "47. A method for analysing an electrocardiogram by means of an electrocardiographic system comprising an electrocardiographic device having a plurality of electrodes adapted for engagement with a user, the method comprising:\nacquiring an electrocardiogram by means of the plurality of electrodes;\nat a data processing device of the electrocardiographic system, processing the electrocardiogram in accordance with a QRS detection algorithm in order to identify the amplitude of the QRS complex in the electrocardiogram relative to its noise floor;\nif the amplitude of the QRS complex is determined to exceed the noise floor by greater than a predetermined amount, selecting a P wave algorithm for subsequent analysis of the electrocardiogram, and otherwise selecting an R-R interval algorithm for subsequent analysis of the electrocardiogram; and\nanalysing the electrocardiogram using the selected algorithm.",
        "48. A method for acquiring an electrocardiogram by means of an electrocardiographic system comprising an electrocardiographic device having first and second sets of electrodes, each set of electrodes being arranged for engagement with a different one of a pair of extremities of a user, the method comprising:\nfor each of a predetermined series of pairs of electrodes, forming a measure of the quality of the differential signal from the pair of electrodes, each pair of electrodes including one sensor from the first set and one sensor from the second set:\nselecting the pair of electrodes having the highest measure of signal quality; and\nacquiring an electrocardiogram by means of the selected pair of electrodes of the first electrocardiographic device.",
        "49. An electrocardiographic device for sensing cardiac activity in a user comprising:\na plurality of electrodes; and\na set of indicia indicating an intended position of a pair of hands of a user with respect to the electrodes;\nwherein the electrodes are arranged relative to the set of indicia such that, in use when a user's hands are in the intended position, an electrode is located under the thenar eminence and/or the hypothenar eminence of each of the user's hands."
      ],
      "title": "HEART MONITORING APPARATUS"
    },
    {
      "referenceIdentifier": "20130041590",
      "abstract": "The present invention provides a group monitoring device for monitoring a plurality of individuals engaged in an athletic activity, the device including a display configured to display, during an athletic activity: a metric relating to each of a plurality of individuals engaged in the athletic activity, and a status of a system component used to monitor the athletic activity. The group monitoring device may also include an input configured to allow manipulation of the display.",
      "claims": [
        "1. A group monitoring device for monitoring a plurality of individuals engaged in an athletic activity, the device comprising:\na display configured to display, during an athletic activity:\na metric relating to each of a plurality of individuals engaged in the athletic activity, and a status of a system component used to monitor the athletic activity; and\nan input configured to allow manipulation of the display.",
        "2. The device of claim 1, wherein the system component is a component remote from the display.",
        "3. The device of claim 1, wherein the system component is a base station.",
        "4. The device of claim 1, wherein the system component is an individual monitor.",
        "5. The device of claim 1, wherein the system component is an object monitor.",
        "6. The device of claim 1, wherein the system component is a sensor in communication with an individual monitor.",
        "7. The device of claim 1, wherein the system component is a sensor in communication with an object monitor.",
        "8. The device of claim 1, wherein the status is an indication of remaining battery power of a battery of the system component.",
        "9. The device of claim 8, wherein the system component is a base station.",
        "10. The device of claim 8, wherein the system component is an individual monitor coupled to an individual engaged in the athletic activity.",
        "11. The device of claim 8, wherein the system component is an object monitor coupled to a sports object.",
        "12. The device of claim 1, wherein the status is an indication of a number of remote monitors docked at the base station.",
        "13. The device of claim 1, wherein the status is an indication of a GPS signal strength at a remote monitor.",
        "14. The device of claim 13, wherein the remote monitor is an individual monitor coupled to an individual engaged in the athletic activity.",
        "15. The device of claim 13, wherein the remote monitor is an object monitor coupled to a sports object.",
        "16. The device of claim 1, wherein the status is an indication of proper operation of the system component.",
        "17. The device of claim 16, wherein the system component is an individual monitor coupled to a sensor of a monitor garment, and wherein an indication of improper operation indicates improper fit of the sensor garment on an individual.",
        "18. The device of claim 1, wherein the status is an indication of proper placement of the system component.",
        "19. The device of claim 1, wherein the status is displayed in response to the status passing a system alert threshold.",
        "20. The device of claim 19, wherein the displayed status corresponds to an alert indication on a remote monitor.",
        "21. The device of claim 20, wherein the alert indication is an illuminated light coupled to the remote monitor.",
        "22. The device of claim 1, wherein the status of a system component associated with an individual is displayed simultaneously with a performance metric relating to the individual.",
        "23. A method for monitoring a plurality of individuals engaged in an athletic activity, the method comprising:\ndisplaying, during the athletic activity, a plurality of metrics relating to a plurality of individuals engaged in the athletic activity; and\ndisplaying, during the athletic activity, a status of a system component used to monitor the athletic activity.",
        "24. A computer program product comprising computer-useable medium having computer program logic recorded thereon that, when executed by one or more processors, provides to a user performance information related to an athletic activity engaged in by a plurality of individuals, the computer program logic comprising:\nfirst computer-readable program code that enables a processor to display, during the athletic activity, a plurality of metrics relating to a plurality of individuals engaged in the athletic activity; and\nsecond computer-readable program code that enables a processor to display, during the athletic activity, a status of a system component used to monitor the athletic activity.",
        "25. A group monitoring device for monitoring a plurality of individuals engaged in an athletic activity, the device comprising:\na display configured to display, during the athletic activity, a plurality of metrics relating to a plurality of individuals engaged in the athletic activity, each metric relating to one of the plurality of individuals; and\nan input configured to allow manipulation of the display, wherein a metric of the plurality of metrics is a relative metric, and wherein the relative metric provides an indication of a level of performance of its associated individual, relative to personal ability of the associated individual.",
        "26. The device of claim 25, wherein the relative metric provides an indication of relative power of the associated individual, and wherein relative power is an indication of power output of the associated individual relative to a personal reference power output of the associated individual.",
        "27. The device of claim 25, wherein the relative metric provides an indication of efficiency of the associated individual.",
        "28. The device of claim 27, wherein the indication of efficiency is based on the relative power of the associated individual in comparison to a heart rate of the associated individual.",
        "29. The device of claim 25, wherein the relative power metric associated with the first associated individual is displayed simultaneously with a relative power metric associated with a second associated individual.",
        "30. A method for monitoring a plurality of individuals engaged in an athletic activity, the method comprising:\ndisplaying, during the athletic activity, a plurality of metrics relating to a plurality of individuals engaged in the athletic activity, each metric relating to one of the plurality of individuals, wherein a metric of the plurality of metrics is a relative metric, and wherein the relative metric provides an indication of a level of performance of its associated individual, relative to personal ability of the associated individual.",
        "31. The method of claim 30, further comprising:\ndetermining a reference value for the relative metric based on a calibration assessment activity, wherein the relative metric is based on the reference value.",
        "32. A computer program product comprising computer-useable medium having computer program logic recorded thereon that, when executed by one or more processors, provides to a user performance information related to an athletic activity engaged in by a plurality of individuals, the computer program logic comprising:\ncomputer-readable program code that enables a processor to display, during the athletic activity, a plurality of metrics relating to a plurality of individuals engaged in the athletic activity, each metric relating to one of the plurality of individuals, wherein a metric of the plurality of metrics is a relative metric, and wherein the relative metric provides an indication of a level of performance of its associated individual, relative to personal ability of the associated individual.",
        "33. (canceled)",
        "34. (canceled)",
        "35. (canceled)",
        "36. (canceled)",
        "37. (canceled)",
        "38. (canceled)",
        "39. (canceled)",
        "40. (canceled)",
        "41. (canceled)",
        "42. (canceled)",
        "43. (canceled)",
        "44. (canceled)",
        "45. (canceled)",
        "46. (canceled)",
        "47. (canceled)",
        "48. (canceled)",
        "49. (canceled)",
        "50. (canceled)",
        "51. (canceled)",
        "52. (canceled)",
        "53. (canceled)",
        "54. (canceled)",
        "55. (canceled)",
        "56. (canceled)",
        "57. (canceled)",
        "58. (canceled)",
        "59. (canceled)",
        "60. (canceled)",
        "61. (canceled)",
        "62. (canceled)",
        "63. (canceled)",
        "64. (canceled)",
        "65. (canceled)",
        "66. (canceled)",
        "67. (canceled)",
        "68. (canceled)",
        "69. (canceled)",
        "70. (canceled)",
        "71. (canceled)",
        "72. (canceled)",
        "73. (canceled)",
        "74. (canceled)",
        "75. (canceled)",
        "76. (canceled)",
        "77. (canceled)",
        "78. (canceled)",
        "79. (canceled)",
        "80. (canceled)",
        "81. (canceled)",
        "82. (canceled)",
        "83. (canceled)",
        "84. (canceled)",
        "85. (canceled)",
        "86. (canceled)",
        "87. (canceled)",
        "88. (canceled)",
        "89. (canceled)",
        "90. (canceled)",
        "91. (canceled)",
        "92. (canceled)",
        "93. (canceled)",
        "94. (canceled)",
        "95. (canceled)",
        "96. (canceled)",
        "97. (canceled)",
        "98. (canceled)",
        "99. (canceled)",
        "100. (canceled)",
        "101. (canceled)",
        "102. (canceled)",
        "103. (canceled)",
        "104. (canceled)",
        "105. (canceled)",
        "106. (canceled)",
        "107. (canceled)",
        "108. (canceled)",
        "109. (canceled)",
        "110. (canceled)",
        "111. (canceled)",
        "112. (canceled)",
        "113. (canceled)",
        "114. (canceled)",
        "115. (canceled)",
        "116. (canceled)",
        "117. (canceled)",
        "118. (canceled)",
        "119. (canceled)",
        "120. (canceled)",
        "121. (canceled)",
        "122. (canceled)",
        "123. (canceled)",
        "124. (canceled)",
        "125. (canceled)",
        "126. (canceled)",
        "127. (canceled)",
        "128. (canceled)",
        "129. (canceled)",
        "130. (canceled)",
        "131. (canceled)",
        "132. (canceled)",
        "133. (canceled)",
        "134. (canceled)",
        "135. (canceled)",
        "136. (canceled)",
        "137. (canceled)",
        "138. (canceled)",
        "139. (canceled)",
        "140. (canceled)",
        "141. (canceled)",
        "142. (canceled)",
        "143. (canceled)",
        "144. (canceled)",
        "145. (canceled)"
      ],
      "title": "Group Performance Monitoring System and Method"
    },
    {
      "referenceIdentifier": "20140278125",
      "abstract": "Systems and methods are provided for calculating athletic activity parameters. Multiple housings are position at different locations on a user's body. The housings are configured to be removably engaged with an electronic module that includes a sensor and a processor configured to calculate athletic activity parameters. Each housing is connected to or includes an identification memory that stores information identifying a location of the housing. The electronic module uses the location information to select an algorithm to use when calculating the athletic activity parameters.",
      "claims": [
        "1. An electronic module configured to be removeably engaged with a receptacle;\nan interface that receives identifying information from an identification memory attached to the receptacle;\na non-transitory computer-readable medium that contains multiple algorithms for calculating athletic data;\na processor programmed with computer-executable instructions that when executed cause the processor to perform the steps comprising:\n(i) retrieving identifying information from the identification memory; and\n(ii) selecting an algorithm from the multiple algorithms based on the identifying information.",
        "2. The electronic module of claim 1, wherein the identification memory comprises a memory that includes a single contact serial interface.",
        "3. The electronic module of claim 1, wherein the identification memory comprises an RFID tag.",
        "4. The electronic module of claim 1, wherein the multiple algorithms comprises algorithms for calculating activity points.",
        "5. The electronic module of claim 1, wherein the identifying information identifies a location of the receptacle on a user's body.",
        "6. The electronic module of claim 1, wherein the identifying information identifies a location in proximity to a user.",
        "7. The electronic module of claim 1, wherein the identifying information identifies athletic equipment.",
        "8. The electronic module of claim 1, wherein the processor is further programmed with computer-executable instructions to perform the steps comprising:\n(iii) calculating activity points with the algorithm selected in (ii).",
        "9. The electronic module of claim 1, wherein the processor is further programmed with computer-executable instructions to perform the steps comprising:\n(iii) wirelessly transmitting data to a computer devices.",
        "10. The electronic module of claim 1, wherein the processor is further programmed with computer-executable instructions to perform the steps comprising:\n(iii) wirelessly receiving data from a computer device.",
        "11. The electronic module of claim 10, wherein the processor is further programmed with computer-executable instructions to perform the steps comprising:\n(iv) wirelessly transmitting data to a computer device.",
        "12. The electronic module of claim 10, wherein (ii) comprises selecting an algorithm from the multiple algorithms based on the identifying information and the data received in (iii).",
        "13. The electronic module of claim 10, wherein the processor is further programmed with computer-executable instructions to perform the steps comprising:\n(iv) calculating activity points with the algorithm selected in (ii) and the data received in (iii).",
        "14. The electronic module of claim 1, further comprising an accelerometer configured to provide acceleration data to the processor.",
        "15. An activity monitoring system comprising:\na plurality of receptacles attached to clothing;\nan identification memory attached to each of the plurality of receptacles and containing identifying information; and\nan electronic module configured to be removeably engaged with the plurality of a receptacles and to read identifying information contained in an identification memory when engaged in a receptacle.",
        "16. The system of claim 15, where the electronic module comprises:\na non-transitory computer-readable medium that contains multiple algorithms for calculating athletic data a processor programmed with computer-executable instructions that when executed cause the processor to perform the steps comprising:\n(i) selecting an algorithm from the multiple algorithms based on the identifying information. (ii) calculating activity points with the algorithm selected in (i).",
        "17. The system of claim 16, wherein the identification memory comprises a memory that includes a single contact serial interface.",
        "18. The system of claim 16, wherein the identification memory comprises an RFID tag.",
        "19. The system of claim 16, wherein the processor is further programmed with computer-executable instructions to perform the step comprising:\n(iii) wirelessly transmitting data to a computer devices.",
        "20. The system of claim 19, wherein the processor is further programmed with computer-executable instructions to perform the step comprising:\n(iv) wirelessly receiving data from a computer devices."
      ],
      "title": "Apparel and Location Information System"
    },
    {
      "referenceIdentifier": "20150109202",
      "abstract": "Systems, articles, and methods perform gesture identification with limited computational resources. A wearable electromyography (\"EMG\") device includes multiple EMG sensors, an on-board processor, and a non-transitory processor-readable memory that stores data and/or processor-executable instructions for performing gesture identification. The wearable EMG device detects and determines features of signals when a user performs a physical gesture, and processes the features by performing a decision tree analysis. The decision tree analysis invokes a decision tree stored in the memory, where storing and executing the decision tree may be managed by limited computational resources. The outcome of the decision tree analysis is a probability vector that assigns a respective probability score to each gesture in a gesture library. The accuracy of the gesture identification may be enhanced by performing multiple iterations of the decision tree analysis across multiple time windows of the EMG signal data and combining the resulting probability vectors.",
      "claims": [
        "1. A method of operating a wearable electromyography (\"EMG\") device, wherein the wearable EMG device includes a set of EMG sensors and a processor communicatively coupled to the set of EMG sensors, the method comprising:\ndetecting muscle activity of a user of the wearable EMG device by the set of EMG sensors, wherein the muscle activity corresponds to a user-performed gesture;\nin response to detecting muscle activity of the user by the set of EMG sensors, providing a set of signals from the set of EMG sensors to the processor;\ndetermining a set of features of the set of signals by the processor;\nperforming a series of evaluations of at least some of the features in the set of features by the processor, wherein each evaluation in the series of evaluations includes evaluating a respective feature in the set of features by the processor, and wherein a first evaluation in the series of evaluations includes evaluating a first feature in the set of features by the processor and each subsequent evaluation in the series of evaluations is based at least in part on an outcome of a previous evaluation in the series of evaluations;\ndetermining a respective probability score of each gesture in a gesture library by the processor based at least in part on an outcome of the series of evaluations; and\nidentifying the user-performed gesture by the processor based at least in part on the probability score of at least one gesture in the gesture library.",
        "2. The method of claim 1 wherein performing a series of evaluations of at least some of the features in the set of features by the processor includes performing a decision tree analysis of the set of features by the processor.",
        "3. The method of claim 1 wherein each evaluation in the series of evaluations includes comparing a magnitude of a respective feature in the set of features to a respective value by the processor.",
        "4. The method of claim 1 wherein determining a set of features of the set of signals by the processor includes determining at least one feature selected from the group consisting of:\nan average value of a signal in the set of signals, a mean value of a signal in the set of signals, a median value of a signal in the set of signals, a mode value of a signal in the set of signals, a maximum value of a signal in the set of signals, a minimum value of a signal in the set of signals, a standard deviation of a signal in the set of signals, and/or a root mean squared (\"RMS\") value of a signal in the set of signals.",
        "5. The method of claim 1 wherein identifying the user-performed gesture by the processor based at least in part on the probability score of at least one gesture in the gesture library includes identifying, by the processor, a gesture in the gesture library that has a largest probability score.",
        "6. The method of claim 1 wherein the wearable EMG device further includes a non-transitory processor-readable storage medium communicatively coupled to the processor, and wherein the non-transitory processor-readable storage medium stores processor-executable gesture identification instructions, and wherein:\ndetermining a set of features of the set of signals by the processor includes executing, by the processor, the processor-executable gesture identification instructions to cause the processor to determine a set of features of the set of signals;\nperforming a series of evaluations of at least some of the features in the set of features by the processor includes executing, by the processor, the processor-executable gesture identification instructions to cause the processor to perform a series of evaluations of at least some of the features in the set of features;\ndetermining a respective probability score of each gesture in a gesture library by the processor based at least in part on an outcome of the series of evaluations includes executing, by the processor, the processor-executable gesture identification instructions to cause the processor to determine a respective probability score of each gesture in a gesture library based at least in part on an outcome of the series of evaluations; and\nidentifying the user-performed gesture by the processor based at least in part on the probability score of at least one gesture in the gesture library includes executing, by the processor, the processor-executable gesture identification instructions to cause the processor to identify the user-performed gesture based at least in part on the probability score of at least one gesture in the gesture library.",
        "7. The method of claim 1 wherein the wearable EMG device further includes at least one inertial sensor, and wherein the method further comprises:\ndetecting motion of the wearable EMG device by the at least one inertial sensor, wherein the motion corresponds to the user-performed gesture;\nin response to detecting motion of the wearable EMG device by the at least one inertial sensor, providing at least one signal from the at least one inertial sensor to the processor; and\nprocessing the at least one signal from the at least one inertial sensor by the processor, and wherein identifying the user-performed gesture by the processor based at least in part on the probability score of at least one gesture in the gesture library includes identifying the user-performed gesture by the processor based at least in part on an outcome of the processing the at least one signal from the at least one inertial sensor by the processor.",
        "8. The method of claim 1, further comprising:\ncapturing a respective time-synchronized first portion of each signal in the set of signals by the processor, and wherein:\ndetermining a set of features of the set of signals by the processor includes determining a set of features of the time-synchronized first portions of the signals in the set of signals by the processor;\nperforming a series of evaluations of at least some of the features in the set of features by the processor includes performing a series of evaluations of at least some of the features of the time-synchronized first portions of the signals in the set of signals by the processor; and\ndetermining a respective probability score of each gesture in a gesture library by the processor based at least in part on an outcome of the series of evaluations includes determining a respective first probability score of each gesture in the gesture library by the processor based at least in part on an outcome of the series of evaluations of at least some of the features of the time-synchronized first portions of the signals in the set of signals.",
        "9. The method of claim 8, further comprising:\ncapturing a respective time-synchronized second portion of each signal in the set of signals by the processor, wherein:\ndetermining a set of features of the set of signals by the processor includes determining a set of features of the time-synchronized second portions of the signals in the set of signals by the processor;\nperforming a series of evaluations of at least some of the features in the set of features by the processor includes performing a series of evaluations of at least some of the features of the time-synchronized second portions of the signals in the set of signals by the processor; and\ndetermining a respective probability score of each gesture in a gesture library by the processor based at least in part on an outcome of the series of evaluations includes determining a respective second probability score of each gesture in the gesture library by the processor based at least in part on an outcome of the series of evaluations of at least some of the features of the time-synchronized second portions of the signals in the set of signals; and\ngenerating a respective cumulative probability score of each gesture in the gesture library by the processor, wherein the respective cumulative probability score of each gesture in the gesture library combines the first probability score of the gesture and the second probability score of the gesture, and wherein identifying the user-performed gesture by the processor based at least in part on the probability score of at least one gesture in the gesture library includes identifying the user-performed gesture by the processor based at least in part on the cumulative probability score of at least one gesture in the gesture library.",
        "10. The method of claim 1, further comprising:\nin response to the user performing a reference gesture:\ndetermining an orientation of the wearable EMG device on the user by the wearable EMG device; and\ncalibrating the series of evaluations by the wearable EMG device.",
        "11. The method of claim 1 wherein:\nproviding a set of signals from the set of EMG sensors to the processor includes providing a respective signal from each respective EMG sensor in the set of EMG sensors to the processor; and\ndetermining a set of features of the set of signals by the processor includes determining at least one respective feature of the signal from each respective EMG sensor in the set of EMG sensors by the processor.",
        "12. The method of claim 1 wherein determining a respective probability score of each gesture in a gesture library by the processor based at least in part on an outcome of the series of evaluations includes determining a corresponding probability vector from a set of probability vectors by the processor based at least in part on the outcome of the series of evaluations.",
        "13. A wearable electromyography (\"EMG\") device comprising:\na set of EMG sensors responsive to muscle activity corresponding to a gesture performed by a user of the wearable EMG device, wherein in response to muscle activity corresponding to a gesture performed by the user, the set of EMG sensors provide a set of signals;\na processor communicatively coupled to the set of EMG sensors; and\na non-transitory processor-readable storage medium communicatively coupled to the processor, wherein the non-transitory processor-readable storage medium stores processor-executable gesture identification instructions that, when executed by the processor, cause the processor to:\ndetermine a set of features of the set of signals;\nperform a series of evaluations of at least some of the features in the set of features by the processor, wherein each evaluation in the series of evaluations includes evaluating a respective feature in the set of features, and wherein a first evaluation in the series of evaluations includes evaluating a first feature in the set of features and each subsequent evaluation in the series of evaluations is based at least in part on an outcome of a previous evaluation in the series of evaluations;\ndetermine a respective probability score of each gesture in a gesture library based at least in part on the series of evaluations; and\nidentify the gesture performed by the user based at least in part on the probability score of at least one gesture in the gesture library.",
        "14. The wearable EMG device of claim 13, further comprising:\nat least one communication terminal communicatively coupled to the processor, the at least one communication terminal to transmit information about the gesture performed by the user.",
        "15. The wearable EMG device of claim 13, further comprising:\nat least one inertial sensor communicatively coupled to the processor, the at least one inertial sensor responsive to motion corresponding to the gesture performed by the user of the wearable EMG device, wherein in response to motion corresponding to the gesture performed by the user, the at least one inertial sensor provides at least one signal, and wherein the processor-executable gesture identification instructions that, when executed by the processor, cause the processor to identify the gesture performed by the user based at least in part on the probability score of at least one gesture in the gesture library cause the processor to identify the gesture performed by the user based at least in part on both the probability score of at least one gesture in the gesture library and the at least one signal provided by the at least one inertial sensor in response to the motion.",
        "16. The wearable EMG device of claim 13, further comprising:\na set of pod structures that form physically coupled links of the wearable EMG device, wherein each pod structure in the set of pod structures is positioned adjacent and in between two other pod structures in the set of pod structures and physically coupled to the two other pod structures in the set of pod structures, and wherein the set of pod structures forms a perimeter of an annular configuration.",
        "17. A method of identifying which gesture in a gesture library is performed by a user of a wearable electromyography (\"EMG\") device, wherein the wearable EMG device includes a set of EMG sensors and a processor communicatively coupled to the set of EMG sensors, the method comprising:\nin response to the user performing a gesture while wearing the wearable EMG device, detecting muscle activity of the user by the set of EMG sensors;\nin response to detecting muscle activity of the user by the set of EMG sensors, providing a set of signals from the set of EMG sensors to the processor, wherein each signal in the set of signals is provided by a respective one of the EMG sensors in the set of EMG sensors;\nuntil a cumulative probability score that exceeds a threshold value is identified, iteratively:\ncapturing a respective time-synchronized portion of each signal in the set of signals by the processor;\ndetermining a set of features of the time-synchronized portions of the signals in the set of signals by the processor;\nperforming a decision tree analysis of the set of features by the processor;\ndetermining a respective probability score of each gesture in the gesture library by the processor;\ngenerating a respective cumulative probability score of each gesture in the gesture library by the processor; and\ncomparing the cumulative probability scores in the set of cumulative probability scores to the threshold value by the processor; and\nin response to identifying a cumulative probability score that exceeds a threshold value:\nstopping the iteration; and\nreturning a gesture in the gesture library that corresponds to the cumulative probability score that exceeds the threshold value by the processor.",
        "18. The method of claim 17 wherein determining a set of features of the time-synchronized portions of the signals in the set of signals by the processor includes determining at least one respective feature of the time-synchronized portion of each respective signal in the set of signals by the processor.",
        "19. The method of claim 17 wherein performing a decision tree analysis of the set of features by the processor includes performing a series of evaluations of at least some of the features in the set of features by the processor, wherein each evaluation in the series of evaluations includes evaluating a respective feature in the set of features by the processor, and wherein a first evaluation in the series of evaluations includes evaluating a first feature in the set of features by the processor and each subsequent evaluation in the series of evaluations is based at least in part on an outcome of a previous evaluation in the series of evaluations.",
        "20. The method of claim 17 wherein the wearable EMG device further includes at least one inertial sensor communicatively coupled to the processor, and wherein the method further comprises:\nin response to the user performing the gesture while wearing the wearable EMG device, detecting motion of the wearable EMG device by the at least one inertial sensor;\nin response to detecting motion of the wearable EMG device by the at least one inertial sensor, providing at least one signal from the at least one inertial sensor to the processor;\nprocessing the at least one signal from the at least one inertial sensor by the processor; and\nidentifying which gesture from the gesture library is performed by the user based at least in part on both the gesture in the gesture library that corresponds to the cumulative probability score that exceeds the threshold value and the processing the at least one signal from the at least one inertial sensor.",
        "21. The method of claim 17 wherein generating a respective cumulative probability score of each gesture in the gesture library by the processor includes, for each gesture in the gesture library, combining the respective probability scores from multiple iterations.",
        "22. The method of claim 21 wherein generating a respective cumulative probability score of each gesture in the gesture library in an i.sup.th iteration includes, for each gesture in the gesture library, combining the respective probability score determined in the i.sup.th iteration with the respective probability score determined in an (i-1).sup.th iteration.",
        "23. The method of claim 17 wherein determining a respective probability score of each gesture in the gesture library by the processor includes determining a corresponding probability vector from a set of probability vectors by the processor based at least in part on an outcome of the decision tree analysis.",
        "24. A wearable electromyography (\"EMG\") device comprising:\na set of EMG sensors responsive to muscle activity corresponding to a gesture performed by a user of the wearable EMG device, wherein in response to muscle activity corresponding to a gesture performed by the user, the set of EMG sensors provide a set of signals;\na processor communicatively coupled to the set of EMG sensors; and\na non-transitory processor-readable storage medium communicatively coupled to the processor, wherein the non-transitory processor-readable storage medium stores processor-executable gesture identification instructions that, when executed by the processor, cause the processor to:\ni) until a cumulative probability score that exceeds a threshold value is identified, iteratively:\ncapture a respective time-synchronized portion of each signal in the set of signals;\ndetermine a set of features of the time-synchronized portions of the signals in the set of signals;\nperform a decision tree analysis of the set of features;\ndetermine a respective probability score of each gesture in the gesture library;\ngenerate a respective cumulative probability score of each gesture in the gesture library; and\ncompare the cumulative probability scores in the set of cumulative probability scores to the threshold value; and\nii) in response to identifying a cumulative probability score that exceeds a threshold value:\nstop the iteration; and\nreturn the gesture in the gesture library that corresponds to the cumulative probability score that exceeds the threshold value.",
        "25. The wearable EMG device of claim 24, further comprising:\nat least one communication terminal communicatively coupled to the processor, the at least one communication terminal to transmit information about the gesture performed by the user.",
        "26. The wearable EMG device of claim 24, further comprising:\nat least one inertial sensor communicatively coupled to the processor, the at least one inertial sensor responsive to motion corresponding to the gesture performed by the user of the wearable EMG device, wherein in response to motion corresponding to the gesture performed by the user, the at least one inertial sensor provides at least one signal, and wherein the processor-executable gesture identification instructions, when executed by the processor, cause the processor to identify the gesture performed by the user based at least in part on the at least one signal provided by the at least one inertial sensor in response to the motion.",
        "27. The wearable EMG device of claim 24, further comprising:\na set of pod structures that form physically coupled links of the wearable EMG device, wherein each pod structure in the set of pod structures is positioned adjacent and in between two other pod structures in the set of pod structures and physically coupled to the two other pod structures in the set of pod structures, and wherein the set of pod structures forms a perimeter of an annular configuration."
      ],
      "title": "SYSTEMS, ARTICLES, AND METHODS FOR GESTURE IDENTIFICATION IN WEARABLE ELECTROMYOGRAPHY DEVICES"
    },
    {
      "referenceIdentifier": "20140200432",
      "abstract": "A system for facilitating a subject's functional development includes sensing devices configured for sensing mind state signals; sensing devices configured for sensing body state signals; and a set of processing resources configured for generating a mind state indicator/measure, a body state indicator/measure, and a mind-body synergy indicator/measure that corresponds to which each of the subject's mind state and body state are synergistically aligned for facilitating the subject's functional development. The system can be configured for concurrently presenting a set of activities involving a model body part; engaging in attempted imitation of the set of activities by way of attempted movement of a body part that is a mirror image of the model body part; presenting an indication of an extent to which each of the mind state and body state are cooperative with respect to performance of the set of activities; and presenting an indication of relaxation.",
      "claims": [
        "1. (canceled)",
        "2. (canceled)",
        "3. (canceled)",
        "4. (canceled)",
        "5. (canceled)",
        "6. (canceled)",
        "7. (canceled)",
        "8. (canceled)",
        "9. (canceled)",
        "10. (canceled)",
        "11. (canceled)",
        "12. (canceled)",
        "13. (canceled)",
        "14. (canceled)",
        "15. (canceled)",
        "16. (canceled)",
        "17. (canceled)",
        "18. (canceled)",
        "19. (canceled)",
        "20. (canceled)",
        "21. (canceled)",
        "22. (canceled)",
        "23. (canceled)",
        "24. (canceled)",
        "25. (canceled)",
        "26. (canceled)",
        "27. (canceled)",
        "28. (canceled)",
        "29. (canceled)",
        "30. (canceled)",
        "31. (canceled)",
        "32. (canceled)",
        "33. (canceled)",
        "34. (canceled)",
        "35. (canceled)",
        "36. (canceled)",
        "37. (canceled)",
        "38. (canceled)",
        "39. (canceled)",
        "40. (canceled)",
        "41. (canceled)",
        "42. (canceled)",
        "43. (canceled)",
        "44. (canceled)",
        "45. (canceled)",
        "46. (canceled)",
        "47. A system for facilitating a subject's functional development, wherein the subject is experiencing at least one of a functional shortcoming, functional inadequacy, functional impairment and functional dysregulation, the system comprising:\na first set of sensing devices configured for sensing signals corresponding to the subject's mind state;\na second set of sensing devices configured for sensing signals corresponding to the subject's body state; and\na set of processing resources configured for generating a mind-body synergy measure that corresponds to an expected extent to which each of the subject's mind state and the subject's body state are cooperatively aligned with respect to facilitating the subject's functional development, wherein the set of processing resources is configured for generating each of (a) a mind state alignment measure corresponding to an expected extent to which the subject's mental activity is conducive to learning, and (b) a body state alignment measure corresponding to an expected extent to which the subject's bodily activity is conducive to successfully performing a functional development activity, wherein the body state alignment measure corresponds to a measure of agonist-antagonist muscle contraction; and\na set of display devices configured for presenting a visual functional development activity sequence to the subject that conveys at least one target movement of at least one model body part, the visual functional development activity sequence intended for at least one of performance, attempted performance, and imagined performance by the subject by way of at least one subject body part that is a mirror image of the at least one model body part, wherein the visual functional development activity sequence is presented concurrently with the subject's at least one of performance, attempted performance, and imagined performance of the visual functional development activity sequence, wherein the set of display devices is further configured for presenting to the subject a visual representation of a level of subject activation of each of an agonist muscle and an antagonist muscle associated with subject performance, attempted performance or imagined performance of the functional development activity sequence concurrently with the presentation of the visual functional development activity sequence to the subject.",
        "48. The system of claim 47, wherein the first set of sensing devices comprises a set of devices configured for detecting signals representative of intracranial neural activity.",
        "49. The system of claim 48, wherein the first set of sensing devices comprises a set of EEG signal detection elements.",
        "50. The system of claim 47, wherein the second set of sensing devices comprises a set of devices configured for detecting signals corresponding to peripheral nervous system activity.",
        "51. The system of claim 49, wherein the second set of sensing devices comprises a set of EMG signal detection elements.",
        "52. The system of claim 47, wherein the mind state alignment measure corresponds to at least one of a level of stress, a level of anxiety, a level of mental relaxation, and a level of mental attention or focus.",
        "53. The system of claim 52, wherein the mind state alignment measure is correlated with a ratio between a mean relative alpha band power measure P.sub..alpha., and a delta-to-alpha measure DAR referenced to a particular time t, normalized to a baseline or at rest ratio between the mean relative alpha measure P.sub..alpha., and the delta-to-alpha measure DAR.",
        "54. The system of claim 47, wherein the body state alignment measure is correlated with a difference between a measure of voluntary target agonist muscle contraction and a measure of voluntary target antagonist muscle contraction.",
        "55. The system of claim 47, wherein the mind-body synergy measure includes a breakthrough measure that is expected to correspond to a likelihood that the subject's mind state and body state can synergistically facilitate at least one of substantial, accelerated, sudden, nonlinear, surprising, spontaneous, and lasting gains in functional capability.",
        "56. The system of claim 55, wherein the breakthrough measure is correlated with a voluntary muscle contraction measure that (a) meets or exceeds a threshold muscle contraction condition, and which (b) is temporally associated with each of the mind state alignment measure satisfying a mind state alignment condition and the body state alignment measure satisfying a body state alignment condition.",
        "57. The system of claim 47, further comprising a set of display devices configured for presenting to the subject each of the visual functional development activity sequence and a visual representation of at least one of the mind-body synergy measure, a measure of subject relaxed mental attention, a measure of subject bodily tension, a measure of subject heart rate, a measure of subject skin conductance, a measure of subject sweat, a measure of subject blood oxygenation, and a target subject breathing rate.",
        "58. The system of claim 57, wherein the set of display devices is further configured for selectively presenting mind state training exercises and body state training exercises to the subject.",
        "59. The system of claim 47, wherein at least a portion of the system is wearable by the subject.",
        "60. The system of claim 58, wherein the system is wearable by the subject.",
        "61. The system of claim 57, further comprising at least one of a robotic orthosis configured for providing movement assistance to the subject and a functional electrical stimulation (FES) apparatus configured for delivering FES signals to the subject.",
        "62. The system of claim 61, wherein the robotic orthosis comprises:\na set of appendage motion modules configured for engaging with a portion of a subject appendage;\na set of mechanical power interface modules coupled to the set of appendage motion modules and configured for facilitating movement of appendage motion modules within the set of appendage motion modules; and\na set of flexible drive shafts couplable to the set of mechanical power interface modules and a set of motors external to the wearable robotic orthosis, wherein the set of appendage motion modules and the set of mechanical power interface modules are subject wearable.",
        "63. The system of claim 62, wherein the set of appendage motion modules includes multiple independently operable and selectively detachable appendage motion modules.",
        "64. A method for facilitating functional development of a subject, wherein the subject is experiencing at least one of a functional shortcoming, functional inadequacy, functional impairment and functional dysregulation, the method comprising:\nsensing signals corresponding to the subject's mind state;\nsensing signals corresponding to the subject's body state; and\ngenerating a mind-body synergy measure that corresponds to an expected extent to which each of the subject's mind state and the subject's body state are cooperatively aligned with respect to facilitating the subject's functional development;\ngenerating each of (a) a mind state alignment measure corresponding to an expected extent to which the subject's mental activity is conducive to learning, and (b) a body state alignment measure corresponding to an expected extent to which the subject's bodily activity is conducive to successfully performing a functional development activity, wherein the body state alignment measure corresponds to a measure of agonist-antagonist muscle contraction;\npresenting a visual functional development activity sequence to the subject that conveys at least one target movement of at least one model body part, the visual functional development activity sequence intended for at least one of performance, attempted performance, and imagined performance by the subject by way of at least one subject body part that is a mirror image of the at least one model body part, wherein the visual functional development activity sequence is presented concurrently with the subject's at least one of performance, attempted performance, and imagined performance of the visual functional development activity sequence; and\npresenting to the subject a visual representation of a level of subject activation of each of an agonist muscle and an antagonist muscle associated with subject performance, attempted performance or imagined performance of the functional development activity sequence concurrently with the presentation of the visual functional development activity sequence to the subject.",
        "65. The method of claim 64, wherein sensing signals corresponding to the subject's mind state comprises detecting signals representative of intracranial neural activity.",
        "66. The method of claim 64, wherein sensing signals corresponding to the subject's mind state comprises sensing EEG signals.",
        "67. The method of claim 64, wherein sensing signals corresponding to the subject's body state comprises detecting signals corresponding to peripheral nervous system activity.",
        "68. The method of claim 64, wherein sensing signals corresponding to the subject's body state comprises sensing EMG signals.",
        "69. The system of claim 64, wherein the mind state alignment measure corresponds to at least one of a level of stress, a level of anxiety, a level of mental relaxation, and a level of mental attention or focus.",
        "70. The method of claim 69, wherein the mind state alignment measure is correlated with a ratio between a mean relative alpha band power measure P.sub..alpha. and a delta-to-alpha measure DAR referenced to a particular time t, normalized to a baseline or at rest ratio between the mean relative alpha measure P.sub..alpha. and the delta-to-alpha measure DAR.",
        "71. The method of claim 64, wherein the body state alignment measure is correlated with a difference between a measure of voluntary target agonist muscle contraction and a measure of voluntary target antagonist muscle contraction.",
        "72. The method of claim 64, wherein the mind-body synergy measure includes a breakthrough measure that is expected to correspond to a likelihood that the subject's mind state and body state can synergistically facilitate at least one of substantial, accelerated, sudden, nonlinear, surprising, spontaneous, and lasting gains in functional capability.",
        "73. The method of claim 72, wherein the breakthrough measure is correlated with a voluntary muscle contraction measure that (a) meets or exceeds a threshold muscle contraction condition, and which (b) is temporally associated with each of the mind state alignment measure satisfying a mind state alignment condition and the body state alignment measure satisfying a body state alignment condition.",
        "74. The method of claim 64, further comprising presenting to the subject each of the visual functional development activity sequence and a visual representation of at least one of the mind-body synergy measure, a measure of subject relaxed mental attention, a measure of subject bodily tension, a measure of subject heart rate, a measure of subject skin conductance, a measure of subject sweat, a measure of subject blood oxygenation, and a target subject breathing rate.",
        "75. The method of claim 74, further comprising selectively presenting to the subject a set of mind state training exercises in the event that a set of mind state alignment measures corresponds to a subject mind state that is expected to be counterproductive to subject functional development.",
        "76. The method of claim 75, further comprising automatically resuming presentation of the functional development activity sequence to the subject following presentation of the set of mind state training exercises to the subject.",
        "77. The method of claim 74, further comprising selectively presenting to the subject a set of body state training exercises in the event that a set of body state alignment measures corresponds to a subject body state that is expected to be counterproductive to subject functional development.",
        "78. The method of claim 64, wherein sensing signals corresponding to the subject's mind state and sensing signals corresponding to the subject's body state occurs during one of subject involvement in a therapy session and subject performance or attempted performance of activities of daily living.",
        "79. The method of claim 64, wherein sensing signals corresponding to the subject's mind state, sensing signals corresponding to the subject's body state, and generating the mind-body synergy measure occurs during one of subject involvement in a therapy session and subject performance or attempted performance of activities of daily living.",
        "80. The method of claim 64, further comprising:\nmounting a wearable robotic orthosis to a portion of a subject appendage; and\nproviding assistive movement to the subject appendage by way of the wearable robotic orthosis during subject performance or attempted performance of at least one of a functional development activity sequence and an activity of daily living.",
        "81. A method for facilitating a subject's functional development, the method comprising:\npresenting to the subject a set of activities involving a model body part;\nsimultaneously engaging the subject in attempted imitation of the set of activities by way of attempted movement of a subject body part that is a mirror image of the model body part;\nsimultaneously presenting to the subject an indication of an expected extent to which each of the subject's mind state and body state are cooperative with respect to subject performance of the set of activities; and\nsimultaneously presenting to the subject an indication of an extent of subject relaxation.",
        "82. A robotic orthosis system configured for providing assistive movement to a portion of an appendage of a subject, the robotic orthosis system including a robotic orthosis comprising:\na set of appendage motion modules configured for engaging with a portion of a subject appendage;\na set of mechanical power interface modules coupled to the set of appendage motion modules and configured for facilitating movement of appendage motion modules within the set of appendage motion modules; and\na set of flexible drive shafts couplable to the set of mechanical power interface modules, wherein the set of appendage motion modules and the set of mechanical power interface modules are subject wearable.",
        "83. The robotic orthosis system of claim 82, further comprising a set of motors external to the robotic orthosis, the set of motors couplable to the set of mechanical power interface modules by way of the set of flexible drive shafts.",
        "84. An EEG headset comprising:\nat least one flexible band configured for fittable engagement with a subject's head; and\na set of dry EEG electrode assemblies carried by the at least one flexible band, each dry EEG electrode assembly comprising an array of resiliently biased EEG sensing elements, wherein the set of dry EEG electrode assemblies are position adjustable relative to each of an anterior-posterior direction and a superior-inferior direction."
      ],
      "title": "SYSTEMS, APPARATUSES, DEVICES, AND PROCESSES FOR SYNERGISTIC NEURO-PHYSIOLOGICAL REHABILITATION AND/OR FUNCTIONAL DEVELOPMENT"
    }
  ],
  "firstInventorToFileIndicator": "Y",
  "applicationStatusCode": 150,
  "applicationTypeCode": "UTL",
  "entityStatusData": {
    "smallEntityStatusIndicator": false,
    "businessEntityStatusCategory": "Small"
  },
  "filingDate": "2015-11-10",
  "class/subclass": "340/870.07",
  "nationalStageIndicator": false,
  "firstInventorName": "Christopher John Wiebe",
  "cpcClassificationBag": [
    "A61B5/6804",
    "A61B5/0015",
    "A61B2562/08",
    "A61B2562/06"
  ],
  "effectiveFilingDate": "2015-11-10",
  "publicationDateBag": [
    "2016-05-12"
  ],
  "publicationSequenceNumberBag": [
    "0128632"
  ],
  "earliestPublicationDate": "2016-05-12",
  "applicationTypeLabelName": "Utility",
  "applicationStatusDate": "2018-02-21",
  "class": "340",
  "applicationTypeCategory": "REGULAR",
  "applicationStatusDescriptionText": "Patented Case",
  "patentNumber": "9913611",
  "grantDate": "2018-03-13",
  "applicantBag": [
    {
      "applicantNameText": "MAD Apparel, Inc.",
      "correspondenceAddressBag": [
        {
          "cityName": "Redwood City",
          "geographicRegionName": "CALIFORNIA",
          "geographicRegionCode": "CA",
          "nameLineOneText": "MAD Apparel, Inc.",
          "postalAddressCategory": "postal"
        }
      ]
    }
  ],
  "firstApplicantName": "MAD Apparel, Inc.",
  "customerNumber": 758,
  "groupArtUnitNumber": "2683",
  "earliestPublicationNumber": "US20160128632A1",
  "inventionTitle": "GARMENT INTEGRATED SENSING SYSTEM AND METHOD",
  "applicationConfirmationNumber": 7650,
  "examinerNameText": "LAU, KEVIN",
  "subclass": "870.07",
  "publicationCategoryBag": [
    "Granted/Issued",
    "Pre-Grant Publications - PGPub"
  ],
  "docketNumber": "32971-34420/US",
  "title": "GARMENT INTEGRATED SENSING SYSTEM AND METHOD",
  "parsed_CTNF": [
    {
      "claimNumber": 1,
      "parentClaim": -1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                25,
                36,
                39,
                82,
                83
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [
                76
              ],
              "img": [
                "22C",
                "22D",
                "22E",
                "22F"
              ]
            },
            {
              "patentNum": "US 20130041590",
              "text": [
                139,
                149
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 1, Balakrishnan discloses a biometric monitoring system, comprising: a set of wireless sensor interfaces coupled to a garment (Paragraph 36: sensors in garment), each of the set of wireless sensor interfaces comprising: 1) an electrode layer, configured for electrical contact with a user during operation, the electrode layer comprising a receiving region (Paragraph 39: electrode layer), 2) a positional identifier, associated with a position on the garment (Paragraph 83: identify location on apparel), and 3) a retention subsystem (Paragraph 82: sensors are attached or embedded); and comprising: a contact region electrically coupleable to the receiving region of the electrode layer of the corresponding wireless sensor interface (Paragraph 39: connection to the sensor system), a set of sensors configured to detect a set of biometric signal types (Paragraph 25: bio-sensor), and a positional interrogator configured to identify, upon interacting with the positional identifier of the corresponding wireless sensor interface (Paragraph 83: position of sensors is determined), the position associated with the corresponding wireless sensor interface (Paragraph 83: position of sensors). Balakrishnan does not explicitly disclose a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces, and a control module, communicatively coupled to the set of wireless sensor modules, wherein, based upon a detected position of each of the set of wireless sensor modules, the control module queries a subset of the set of biometric signal types for transmission from each of the set of wireless sensor modules. Esposito discloses a control module, communicatively coupled to the set of wireless sensor modules, wherein, based upon a detected position of each of the set of wireless sensor modules (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body), the control module queries a subset of the set of biometric signal types for transmission from each of the set of wireless sensor modules (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan to use a subset of the sensors as taught by Esposito. The motivation for such a modification would be to increase the flexibility of the system by allowing the users to choose which parameters to monitor as well as saving power by not activating the sensors that are not of interest. Balakrishnan in view of Esposito does not explicitly disclose a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces. Burich discloses a set of wireless sensor modules, each of the set of wireless sensor modules configured to be received by and removably coupled to the retention subsystem of a corresponding wireless sensor interface of the set of wireless sensor interfaces (Paragraph 139 and 149: sensors are removably mounted and/or connected). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use a subset of the sensors as taught by Esposito. The motivation for such a modification would be to increase the flexibility of the system by allowing the users to choose which parameters to monitor as well as saving power by not activating the sensors that are not of interest."
        }
      ]
    },
    {
      "claimNumber": 2,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                7,
                40
              ],
              "img": [
                "2A",
                "2B"
              ]
            },
            {
              "patentNum": "US 20130192071",
              "text": [
                7
              ],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 2, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the electrode layer further comprises a signal communication region, the signal communication region including a set of conductive leads (Balakrishnan; Fig. 2A-B: connections with the sensors), at least a portion of each of the set of conductive leads configured to electrically couple to the contact region of the corresponding wireless sensor module (Balakrishnan; Fig. 2A-B: connections with the sensors), and a set of biosensing contacts, coupled to the set of conductive leads of the signal communication region, the set of biosensing contacts composed of a conductive polymer (Balakrishnan; Paragraph 40: sensors use conductive polymer), at least a portion of each of the set of biosensing contacts disposed adjacent to and in electrical contact with a skin region of the user (Esposito; Paragraph 7: sensor sensing skin)."
        }
      ]
    },
    {
      "claimNumber": 3,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20150100135",
              "text": [
                45
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 3, Balakrishnan in view of Esposito and in further view of Burich does not explicitly disclose wherein the retention subsystem comprises a fabric layer covering the electrode layer and fixed to the garment at a portion of a periphery of the fabric layer, the retention subsystem thereby configured to form a pocket comprising an opening. Ives discloses wherein the retention subsystem comprises a fabric layer covering the electrode layer and fixed to the garment at a portion of a periphery of the fabric layer, the retention subsystem thereby configured to form a pocket comprising an opening (Paragraph 45: fabric pockets for sensors). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito and in further view of Burich to also use a fabric pocket as taught by Ives. The motivation for such a modification would be to allow for a secure attachment of the sensors."
        }
      ]
    },
    {
      "claimNumber": 4,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                80,
                82,
                83
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 4, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises a set of electronic circuit components which exhibit a known characteristic when an electrical current passes therethough, and wherein the positional interrogator is configured to induce the set of electrical components to exhibit the known characteristic thereof (Balakrishnan; Paragraph 80, 82-83: location memory signal)."
        }
      ]
    },
    {
      "claimNumber": 5,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                80,
                82,
                83
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 5, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises a wireless identification integrated circuit, and wherein the known characteristic comprises an encoded signal delivered by the wireless identification integrated circuit during operation (Balakrishnan; Paragraph 80, 82-83: location stored in memory)."
        }
      ]
    },
    {
      "claimNumber": 6,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                80,
                82,
                83
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 6, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises an integrated circuit, wherein the known characteristic comprises a unique identification code, and wherein the unique identification code is read by the positional interrogator during operation (Balakrishnan; Paragraph 80, 82-83: location stored in memory)."
        }
      ]
    },
    {
      "claimNumber": 7,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [],
              "img": [
                "4"
              ]
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 7, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the control module is electrically coupled to the garment at a control module interface (Balakrishnan; Fig. 4: electrically connected)."
        }
      ]
    },
    {
      "claimNumber": 8,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                24,
                86
              ],
              "img": [
                "2",
                "4"
              ]
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 8, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the control module further comprises a user input terminal and a user output display (Fig. 2, 4, Paragraph 24, 86: input devices and output display)."
        }
      ]
    },
    {
      "claimNumber": 9,
      "parentClaim": 1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                9,
                16
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20150109202",
              "text": [
                13
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 9, Balakrishnan in view of Esposito and in further view of Burich discloses wherein a first wireless sensor module of the set of wireless sensor modules is positioned proximal a heart region of the user (Paragraph 16: shirt and torso areas), a second wireless sensor module is positioned proximal a quadriceps region of the user (Paragraph 16: trousers and underwear areas), the subset of biometric signal types of the first wireless sensor module queried by the control module comprises a heart rate signal type (Paragraph 9: heart rate). Balakrishnan in view of Esposito and in further view of Burich does not explicitly disclose the subset of biometric signal types of the second wireless sensor module queried by the control module comprises an electromyography signal type. Ataee discloses the subset of biometric signal types of the second wireless sensor module queried by the control module comprises an electromyography signal type (Paragraph 13: EMG signals). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to also monitor EMG as taught by Ataee. The motivation for such a modification would be to increase the robustness of the system allowing it to be applicable many different applications (Ataee; Paragraph 9)."
        }
      ]
    },
    {
      "claimNumber": 10,
      "parentClaim": -1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                25,
                36,
                39,
                83
              ],
              "img": [
                "1A"
              ]
            },
            {
              "patentNum": "US 20130192071",
              "text": [
                76
              ],
              "img": [
                "22C",
                "22D",
                "22E",
                "22F"
              ]
            },
            {
              "patentNum": "US 20130041590",
              "text": [
                139,
                149
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 10, Balakrishnan discloses a biometric monitoring system, comprising: a wireless sensor interface coupled to a garment (Paragraph 36: sensors in garment), comprising: 1) an electrode layer, configured for electrical contact with a user during operation, the first electrode layer comprising a receiving region (Paragraph 39: electrode layer), 2) a positional identifier, associated with a position on the garment (Paragraph 83: identify location on apparel), and comprising: a contact region coupleable to the receiving region of the first electrode layer (Paragraph 39: connection to the sensor system), a set of sensors configured to detect a set of biometric signal types (Paragraph 25: bio-sensor), and a positional interrogator configured to identify (Paragraph 83: position of sensors is determined), upon interacting with the positional identifier of the wireless sensor interface, the position associated with the wireless sensor interface (Paragraph 83: position of sensors); and a control module, communicatively coupled to the wireless sensor module (Fig. 1A: connected control module). Balakrishnan does not explicitly disclose 3) a retention subsystem; a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless sensor interface and wherein, based upon a detected position of the wireless sensor module, the control module queries a subset of the set of biometric signal types for transmission from the wireless sensor module. Esposito discloses wherein, based upon a detected position of the wireless sensor module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body), the control module queries a subset of the set of biometric signal types for transmission from the wireless sensor module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use removable attachments as taught by Burich. The motivation for such a modification would be to increase the flexibility of the system by allowing the users to remove components of the system for maintenance. Balakrishnan in view of Esposito does not explicitly disclose 3) a retention subsystem; a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless sensor interface. Burich discloses 3) a retention subsystem; a wireless sensor module, configured to be received by and removably coupled to the retention subsystem of the wireless sensor interface (Paragraph 139 and 149: sensors are removably mounted and/or connected). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use removable attachments as taught by Burich. The motivation for such a modification would be to increase the flexibility of the system by allowing the users to remove components of the system for maintenance."
        }
      ]
    },
    {
      "claimNumber": 11,
      "parentClaim": 10,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [
                136
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 11, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the retention subsystem comprises a mount, embedded in the garment, configured to receive and removably couple to an external surface of the wireless sensor module (Burich; Paragraph 136: interfaces on the fabric for electrical connections with other components)."
        }
      ]
    },
    {
      "claimNumber": 12,
      "parentClaim": 10,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                79
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 12, Balakrishnan in view of Esposito and in further view of Burich discloses wherein the positional identifier comprises at least one passive electronic component, and wherein the positional interrogator is configured to induce the passive electronic component to exhibit a known characteristic during operation (Balakrishnan; Paragraph 79: passive memory)."
        }
      ]
    },
    {
      "claimNumber": 13,
      "parentClaim": 10,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130041590",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20070299325",
              "text": [
                88,
                89,
                90,
                93
              ],
              "img": [
                "16A",
                "16B",
                "16C"
              ]
            }
          ],
          "reason": "Regarding Claim 13, Balakrishnan in view of Esposito and in further view of Berg does not explicitly disclose wherein the contact region of at least one wireless sensor module includes an array of raised surfaces, at least a first of the array of raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface, and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface. Farell discloses wherein the contact region of at least one wireless sensor module includes an array of raised surfaces (Fig. 16A-C, Paragraph 88-90: array of pin connectors or snap connectors), at least a first of the array of raised surfaces configured to mate with the receiving region of the electrode layer of the corresponding wireless sensor interface (Fig. 16A-C, Paragraph 88-90: the components are mated), and at least a second of the raised surfaces comprising a portion of the positional interrogator, the second of the raised surfaces configured to mate with the positional identifier of the corresponding wireless sensor interface (Paragraph 93: position detector connected to pins). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito and in further view of Burich to also use pins as taught by Farell. The motivation for such a modification would be to allow the user to easily connect and disconnect the connections amongst the different components."
        }
      ]
    },
    {
      "claimNumber": 14,
      "parentClaim": -1,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                36,
                83,
                95
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [
                76
              ],
              "img": [
                "22C",
                "22D",
                "22E",
                "22F"
              ]
            }
          ],
          "reason": "Regarding Claim 14, Balakrishnan discloses a method for monitoring a biometric signal of a user (Paragraph 95: biometric information), comprising: at a first wireless sensor module (Paragraph 36: sensors in garment), detecting, based on an interaction between the first wireless sensor module and a first wireless sensor interface of a garment, a first position of the first wireless sensor module with respect to the garment (Paragraph 83: identify location on apparel). Balakrishnan does not explicitly disclose by way of at least one of the first wireless sensor module and a control module automatically selecting, based on the first position of the first wireless sensor module, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module; from the first wireless sensor module, transmitting the first subset of biometric signal outputs to the control module. Esposito discloses by way of at least one of the first wireless sensor module and a control module automatically selecting, based on the first position of the first wireless sensor module, a first subset of biometric signal outputs from among a first set of biometric signal outputs of the first wireless sensor module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body); from the first wireless sensor module, transmitting the first subset of biometric signal outputs to the control module (Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan to use a subset of the sensors as taught by Esposito. The motivation for such a modification would be to increase the flexibility of the system by allowing the users to choose which parameters to monitor as well as saving power by not activating the sensors that are not of interest."
        }
      ]
    },
    {
      "claimNumber": 15,
      "parentClaim": 14,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                7,
                83
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [
                76
              ],
              "img": [
                "22C",
                "22D",
                "22E",
                "22F"
              ]
            }
          ],
          "reason": "Regarding Claim 15, Balakrishnan in view of Esposito discloses further comprising: providing a set of wireless sensor modules, each at a corresponding wireless sensor interface of the garment (Balakrishnan; Paragraph 7 and 83: each location has an identifier and interface); detecting, at each wireless sensor module of the set of wireless sensor modules, a corresponding position of each wireless sensor module with respect to the garment, based on an interaction between each wireless sensor module and the corresponding wireless sensor interface (Balakrishnan; Paragraph 7 and 83: each location has an identifier), and by way of the control module, automatically selecting, based on the detected corresponding position of each wireless sensor module, a corresponding subset of biometric signal outputs from among a corresponding set of biometric signal outputs of each wireless sensor module (Esposito; Fig. 22C-F, Paragraph 76: certain sensors are activated based on the position of the users body)."
        }
      ]
    },
    {
      "claimNumber": 16,
      "parentClaim": 15,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                39
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [
                9
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 16, Balakrishnan in view of Esposito discloses wherein the interaction between the first wireless sensor and the first wireless sensor interface comprises measurement of the impedance of a portion of the wireless sensor interface by way of the first wireless sensor module (Balakrishnan; Paragraph 39: measuring resistance, Esposito; Paragraph 9: measure resistance)."
        }
      ]
    },
    {
      "claimNumber": 17,
      "parentClaim": 14,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130245480",
              "text": [
                7
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 17, Balakrishnan in view of Esposito does not explicitly disclose further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module. Crockford discloses further comprising computing, at the control module, a quality metric based on the first subset of biometric signal outputs and the first detected position, and automatically selecting an alternative subset of biometric signal outputs from among the first set of biometric signal outputs of the first wireless sensor module (Paragraph 7, Claim 48: choosing from different sets of sensors based on quality). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to use a quality metric as taught by Crockford. The motivation for such a modification would be to ensure the best accuracy of the sensors possible."
        }
      ]
    },
    {
      "claimNumber": 18,
      "parentClaim": 15,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                25
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 18, Balakrishnan in view of Esposito discloses further comprising combining, at the control module, two of the corresponding subsets of biometric signal outputs of two of the wireless sensor modules of the set of wireless sensor modules into a compound biometric signal (Balakrishnan; Paragraph 25: combining data from multiple sensors)."
        }
      ]
    },
    {
      "claimNumber": 19,
      "parentClaim": 15,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                25
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20140200432",
              "text": [
                106,
                193
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 19, Balakrishnan in view of Esposito discloses using motion signals for determining muscle activity (Balakrishnan; Paragraph 25: motion signals). Balakrishnan in view of Esposito does not explicitly disclose wherein transmitting comprises transmitting, from a first subset of the set of wireless sensor modules, an electromyography signal; and wherein the method further comprises rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time. Banerji discloses wherein transmitting comprises transmitting, from a first subset of the set of wireless sensor modules, an electromyography signal (Paragraph 106: EMG signals); transmitting, from a second subset of the set of wireless sensor modules, a motion signal (Paragraph 106: motion sensors); and wherein the method further comprises rendering, at an output device associated with the user, a graphic depicting muscle activation behavior and motion behavior of the user in near-real-time (Paragraph 106 and 193: muscle activity display). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to have a graphic display as taught by Berg. The motivation for such a modification would be to allow the user to visualize the extent of the bodyโs current state."
        }
      ]
    },
    {
      "claimNumber": 20,
      "parentClaim": 14,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [
                74,
                75
              ],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            }
          ],
          "reason": "Regarding Claim 20, Balakrishnan in view of Esposito discloses further comprising at least one of recording, storing and processing the first subset of biometric signal outputs at the control module (Balakrishnan; Paragraph 74-75: data is stored)."
        }
      ]
    },
    {
      "claimNumber": 21,
      "parentClaim": 14,
      "isReject": true,
      "reasons": [
        {
          "sectionCode": 103,
          "citedPatents": [
            {
              "patentNum": "US 20140278125",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20130192071",
              "text": [],
              "img": []
            },
            {
              "patentNum": "US 20150109202",
              "text": [
                13
              ],
              "img": []
            }
          ],
          "reason": "Regarding Claim 21, Balakrishnan in view of Esposito does not explicitly disclose wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, electrooculography signals, electrocardiography signals, and electromyography signals. Ataee discloses wherein the set of biometric signal outputs includes one or more of magnetoencephalography signals, galvanic skin response signals, electrooculography signals, electrocardiography signals, and electromyography signals (Paragraph 13: EMG signals). Therefore it would have been obvious to one of ordinary skill in the art at the time of the invention to modify the system in Balakrishnan in view of Esposito to also monitor EMG as taught by Ataee. The motivation for such a modification would be to increase the robustness of the system allowing it to be applicable many different applications (Ataee; Paragraph 9)."
        }
      ]
    }
  ]
}